{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544578035,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>So, I stumbled across <a href=\"http://www.pcmag.com/article2/0,1895,2164136,00.asp\">an article by John Dvorak</a>, who seems to think that we&rsquo;re headed for another bubble burst in the next few years, and that it&rsquo;ll be worse than the 2001 tech crash.  In fact, he asserts that <q>&ldquo;Every single person working in the media today who experienced the dot-com bubble in 1999 to 2000 believes that we are going through the exact same process and can expect the exact same results,&rdquo;</q> an absurdly over-reaching generalization that made me literally laugh out loud.</p>\n\n<p>I&rsquo;ve heard this before.  Every once in a while, a relative or friend of mine hears someone talking on the news about how Microsoft is going to buy Yahoo, or how we&rsquo;re headed for a crash, or how the internet will be outdated by some new thing in 6 months, or how &ldquo;web2.0 is changing everything,&rdquo; and so on, and sometimes calls me to ask what I think of it, since I&rsquo;m the person they know with some skin in that game.  The vast majority of punditry is utter trash.  Like any fortune teller, they get by on one or two hits, and rely on the short attention span of the crowd to hide their nearly endless string of failed predictions.  The more radical their claim, the more likely it is that they&rsquo;ll get attention, because people so often fall victim to the &ldquo;Cloud Insurance&rdquo; scam.  (&ldquo;What if this guy is right, and the clouds really <em>are</em> going to fall&hellip; then I&rsquo;ll be glad I bought that insurance!&rdquo;)  The more attention he gets, and the more he can whip the audience up into a frenzy, the more likely it is that the pundits&rsquo; past failed predictions will be forgotten.</p>\n\n<p>I don&rsquo;t want to come off as decrying punditry as such.  (That would sort of make me like a Dvorak of Pundits, wouldn&rsquo;t it?)  No, there is some very good analysis out there.  One mark of a good analyst is a history of successful predictions.  For example, if you look through the &ldquo;iTulip&rsquo;s Record&rdquo; links at the top of <a href=\"http://itulip.com\">iTulip.com</a>&rsquo;s homepage, you&rsquo;ll find some very sound predictions that were insightful, well-informed, and ultimately accurate.  In fact, <a href=\"http://www.bankrate.com/brm/news/investing/19991129f.asp?keyword=\">this article from November 1999</a> called the bubble for what it was.</p>\n\n<p>Back in the 90s, there was a great new thing that changed the way that humans interact, communicate, and generally live their lives.  Big technological innovations rarely come along and change the landscape of daily life.  The railroad, the steam engine, the printing press, the television&mdash;these kinds of things have made our world smaller, and in so doing, have had huge effects on the way that we live and work.  By changing the way that we live, they also made certain skills and commodities much more (or less) valuable than they were prior to the change.  Things that were never possible now are, and there&rsquo;s new money to be made.</p>\n\n<p>By definition, no one has any experience in a new landscape-changing technology when it shows up.  New ventures cost money, and carry a risk of failure.  Not wanting to be left behind, there is often a frenzy of new ideas, along with a corresponding frenzy of spending and speculation.  Money floods into the market, artificially pushing up prices above their &ldquo;real&rdquo; value.  Most of those ideas fail, and most of that money is thus wasted on unproductive ends.  Eventually, the economy does what economies do, and there is a correction.</p>\n\n<p>Not all <a href=\"http://en.wikipedia.org/wiki/Economic_bubble\">Economic Bubbles</a> are the same.  Some are big, and some are small.  The stock market crash of 1929 was a bubble that kicked off the start of the <a href=\"http://en.wikipedia.org/wiki/Great_Depression\">Great Depression</a>.  By comparison, the <a href=\"http://en.wikipedia.org/wiki/Dot-com_bubble\">dot-com bubble</a> was pretty tame, though it did reduce quite a few &ldquo;paper millionaires&rdquo; to pennies.  (Not all economic bubbles are <a href=\"http://en.wikipedia.org/wiki/Stock_market_bubble\">stock-market bubbles</a>.  Anything that is overvalued and becomes and object of speculation will eventually come crashing back to reality.  <a href=\"http://en.wikipedia.org/wiki/Tulip_mania\">Tulips</a> and <a href=\"http://en.wikipedia.org/wiki/Beanie_Baby\">Beanie Babies</a> come to mind.)</p>\n\n<p>A speculative bubble is a dangerous thing to get wrapped up in, and highlights the importance of not betting more than you have and always diversifying your investments.  However, in the long run, it&rsquo;s a necessary part of the feedback-cycle that produces a quality marketplace.  Yahoo, eBay, Amazon, and Google were never going to go under during the dot-com bubble.  They had to tighten their belts a notch or two, but good ideas that are executed on wisely will always do alright.</p>\n\n<p>I personally think that there really aren&rsquo;t any Amazon- or Google-sized ideas left on the web.  That&rsquo;s not to say that we can&rsquo;t innovate or can&rsquo;t make money, of course, but at this point, it&rsquo;s the 37signals and Twitters and Flickrs and YouTubes, which take a small team to create value with simple good ideas on a shoestring budget, that are making out well.  And of course, Yahoo and Google and them are doing what they do, and buying the successful startups when it makes sense to do so.  VC has been flowing back into Silicon Valley, but in much smaller streams, and with the benefit of a big failure to learn from.  The benefit of doing things on a shoestring is that it doesn&rsquo;t cost as much, and you get to keep more of your purchase price if you are eventually bought.  There is a much more stable ecosystem than there was 6 years ago.</p>\n\n<p>Granted, &ldquo;Web2.0&rdquo; is a silly marketing buzzword, and I think that most engineers and businesspeople pretty much understood that from the start.  Social networking is an interesting phenomenon, but ultimately nothing new.  (Weren&rsquo;t we networking socially <em>before</em> web2.0?)  Some things are getting attention and interest and $$$ that probably shouldn&rsquo;t, and there will be corrections in the future.  But the web crash of 2001 is not going to happen again&mdash;at least, not until the next life-changing piece of technology comes by and gets us all excited.</p>\n\n<p>What I want to know is this:  When will we as a society stop listening to doom-and-gloom pundits like Dvorak?  Did 2001 traumatize us so much that we can&rsquo;t even admit the possibility of a fortunate future?  I think there is a sort of &ldquo;interest bubble&rdquo; that somewhat mirrors the phenomenon of an economic speculative bubble.  You invest your agreement, and in return, you get to say &ldquo;I told you so.&rdquo;  The problem is, when that bubble pops, no one notices.</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2007-08-06 17:00:06 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 146671830,
    "is_blocks_post_format": false,
    "note_count": 0,
    "post_url": "http://blog.izs.me/post/146671830/when-will-the-bubble-bubble-burst-or-who-really",
    "reblog": {
        "comment": "<p>So, I stumbled across <a href=\"http://www.pcmag.com/article2/0,1895,2164136,00.asp\">an article by John Dvorak</a>, who seems to think that we’re headed for another bubble burst in the next few years, and that it’ll be worse than the 2001 tech crash.  In fact, he asserts that <q>“Every single person working in the media today who experienced the dot-com bubble in 1999 to 2000 believes that we are going through the exact same process and can expect the exact same results,”</q> an absurdly over-reaching generalization that made me literally laugh out loud.</p>\n\n<p>I’ve heard this before.  Every once in a while, a relative or friend of mine hears someone talking on the news about how Microsoft is going to buy Yahoo, or how we’re headed for a crash, or how the internet will be outdated by some new thing in 6 months, or how “web2.0 is changing everything,” and so on, and sometimes calls me to ask what I think of it, since I’m the person they know with some skin in that game.  The vast majority of punditry is utter trash.  Like any fortune teller, they get by on one or two hits, and rely on the short attention span of the crowd to hide their nearly endless string of failed predictions.  The more radical their claim, the more likely it is that they’ll get attention, because people so often fall victim to the “Cloud Insurance” scam.  (“What if this guy is right, and the clouds really <em>are</em> going to fall… then I’ll be glad I bought that insurance!”)  The more attention he gets, and the more he can whip the audience up into a frenzy, the more likely it is that the pundits’ past failed predictions will be forgotten.</p>\n\n<p>I don’t want to come off as decrying punditry as such.  (That would sort of make me like a Dvorak of Pundits, wouldn’t it?)  No, there is some very good analysis out there.  One mark of a good analyst is a history of successful predictions.  For example, if you look through the “iTulip’s Record” links at the top of <a href=\"http://itulip.com\">iTulip.com</a>’s homepage, you’ll find some very sound predictions that were insightful, well-informed, and ultimately accurate.  In fact, <a href=\"http://www.bankrate.com/brm/news/investing/19991129f.asp?keyword=\">this article from November 1999</a> called the bubble for what it was.</p>\n\n<p>Back in the 90s, there was a great new thing that changed the way that humans interact, communicate, and generally live their lives.  Big technological innovations rarely come along and change the landscape of daily life.  The railroad, the steam engine, the printing press, the television—these kinds of things have made our world smaller, and in so doing, have had huge effects on the way that we live and work.  By changing the way that we live, they also made certain skills and commodities much more (or less) valuable than they were prior to the change.  Things that were never possible now are, and there’s new money to be made.</p>\n\n<p>By definition, no one has any experience in a new landscape-changing technology when it shows up.  New ventures cost money, and carry a risk of failure.  Not wanting to be left behind, there is often a frenzy of new ideas, along with a corresponding frenzy of spending and speculation.  Money floods into the market, artificially pushing up prices above their “real” value.  Most of those ideas fail, and most of that money is thus wasted on unproductive ends.  Eventually, the economy does what economies do, and there is a correction.</p>\n\n<p>Not all <a href=\"http://en.wikipedia.org/wiki/Economic_bubble\">Economic Bubbles</a> are the same.  Some are big, and some are small.  The stock market crash of 1929 was a bubble that kicked off the start of the <a href=\"http://en.wikipedia.org/wiki/Great_Depression\">Great Depression</a>.  By comparison, the <a href=\"http://en.wikipedia.org/wiki/Dot-com_bubble\">dot-com bubble</a> was pretty tame, though it did reduce quite a few “paper millionaires” to pennies.  (Not all economic bubbles are <a href=\"http://en.wikipedia.org/wiki/Stock_market_bubble\">stock-market bubbles</a>.  Anything that is overvalued and becomes and object of speculation will eventually come crashing back to reality.  <a href=\"http://en.wikipedia.org/wiki/Tulip_mania\">Tulips</a> and <a href=\"http://en.wikipedia.org/wiki/Beanie_Baby\">Beanie Babies</a> come to mind.)</p>\n\n<p>A speculative bubble is a dangerous thing to get wrapped up in, and highlights the importance of not betting more than you have and always diversifying your investments.  However, in the long run, it’s a necessary part of the feedback-cycle that produces a quality marketplace.  Yahoo, eBay, Amazon, and Google were never going to go under during the dot-com bubble.  They had to tighten their belts a notch or two, but good ideas that are executed on wisely will always do alright.</p>\n\n<p>I personally think that there really aren’t any Amazon- or Google-sized ideas left on the web.  That’s not to say that we can’t innovate or can’t make money, of course, but at this point, it’s the 37signals and Twitters and Flickrs and YouTubes, which take a small team to create value with simple good ideas on a shoestring budget, that are making out well.  And of course, Yahoo and Google and them are doing what they do, and buying the successful startups when it makes sense to do so.  VC has been flowing back into Silicon Valley, but in much smaller streams, and with the benefit of a big failure to learn from.  The benefit of doing things on a shoestring is that it doesn’t cost as much, and you get to keep more of your purchase price if you are eventually bought.  There is a much more stable ecosystem than there was 6 years ago.</p>\n\n<p>Granted, “Web2.0” is a silly marketing buzzword, and I think that most engineers and businesspeople pretty much understood that from the start.  Social networking is an interesting phenomenon, but ultimately nothing new.  (Weren’t we networking socially <em>before</em> web2.0?)  Some things are getting attention and interest and $$$ that probably shouldn’t, and there will be corrections in the future.  But the web crash of 2001 is not going to happen again—at least, not until the next life-changing piece of technology comes by and gets us all excited.</p>\n\n<p>What I want to know is this:  When will we as a society stop listening to doom-and-gloom pundits like Dvorak?  Did 2001 traumatize us so much that we can’t even admit the possibility of a fortunate future?  I think there is a sort of “interest bubble” that somewhat mirrors the phenomenon of an economic speculative bubble.  You invest your agreement, and in return, you get to say “I told you so.”  The problem is, when that bubble pops, no one notices.</p>",
        "tree_html": ""
    },
    "reblog_key": "8332NPIK",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWy8lWZM",
    "slug": "when-will-the-bubble-bubble-burst-or-who-really",
    "state": "published",
    "summary": "When will the Bubble Bubble burst? (Or: Who really listens to these pundits?)",
    "tags": [
        "Punditry",
        "The Business"
    ],
    "timestamp": 1186419606,
    "title": "When will the Bubble Bubble burst? (Or: Who really listens to these pundits?)",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p>So, I stumbled across <a href=\"http://www.pcmag.com/article2/0,1895,2164136,00.asp\">an article by John Dvorak</a>, who seems to think that we&rsquo;re headed for another bubble burst in the next few years, and that it&rsquo;ll be worse than the 2001 tech crash.  In fact, he asserts that &ldquo;Every single person working in the media today who experienced the dot-com bubble in 1999 to 2000 believes that we are going through the exact same process and can expect the exact same results,&rdquo; an absurdly over-reaching generalization that made me literally laugh out loud.</p>\n\n<p>I&rsquo;ve heard this before.  Every once in a while, a relative or friend of mine hears someone talking on the news about how Microsoft is going to buy Yahoo, or how we&rsquo;re headed for a crash, or how the internet will be outdated by some new thing in 6 months, or how &ldquo;web2.0 is changing everything,&rdquo; and so on, and sometimes calls me to ask what I think of it, since I&rsquo;m the person they know with some skin in that game.  The vast majority of punditry is utter trash.  Like any fortune teller, they get by on one or two hits, and rely on the short attention span of the crowd to hide their nearly endless string of failed predictions.  The more radical their claim, the more likely it is that they&rsquo;ll get attention, because people so often fall victim to the &ldquo;Cloud Insurance&rdquo; scam.  (&ldquo;What if this guy is right, and the clouds really <em>are</em> going to fall&hellip; then I&rsquo;ll be glad I bought that insurance!&rdquo;)  The more attention he gets, and the more he can whip the audience up into a frenzy, the more likely it is that the pundits&rsquo; past failed predictions will be forgotten.</p>\n\n<p>I don&rsquo;t want to come off as decrying punditry as such.  (That would sort of make me like a Dvorak of Pundits, wouldn&rsquo;t it?)  No, there is some very good analysis out there.  One mark of a good analyst is a history of successful predictions.  For example, if you look through the &ldquo;iTulip&rsquo;s Record&rdquo; links at the top of <a href=\"http://itulip.com\">iTulip.com</a>&rsquo;s homepage, you&rsquo;ll find some very sound predictions that were insightful, well-informed, and ultimately accurate.  In fact, <a href=\"http://www.bankrate.com/brm/news/investing/19991129f.asp?keyword=\">this article from November 1999</a> called the bubble for what it was.</p>\n\n<p>Back in the 90s, there was a great new thing that changed the way that humans interact, communicate, and generally live their lives.  Big technological innovations rarely come along and change the landscape of daily life.  The railroad, the steam engine, the printing press, the television&mdash;these kinds of things have made our world smaller, and in so doing, have had huge effects on the way that we live and work.  By changing the way that we live, they also made certain skills and commodities much more (or less) valuable than they were prior to the change.  Things that were never possible now are, and there&rsquo;s new money to be made.</p>\n\n<p>By definition, no one has any experience in a new landscape-changing technology when it shows up.  New ventures cost money, and carry a risk of failure.  Not wanting to be left behind, there is often a frenzy of new ideas, along with a corresponding frenzy of spending and speculation.  Money floods into the market, artificially pushing up prices above their &ldquo;real&rdquo; value.  Most of those ideas fail, and most of that money is thus wasted on unproductive ends.  Eventually, the economy does what economies do, and there is a correction.</p>\n\n<p>Not all <a href=\"http://en.wikipedia.org/wiki/Economic_bubble\">Economic Bubbles</a> are the same.  Some are big, and some are small.  The stock market crash of 1929 was a bubble that kicked off the start of the <a href=\"http://en.wikipedia.org/wiki/Great_Depression\">Great Depression</a>.  By comparison, the <a href=\"http://en.wikipedia.org/wiki/Dot-com_bubble\">dot-com bubble</a> was pretty tame, though it did reduce quite a few &ldquo;paper millionaires&rdquo; to pennies.  (Not all economic bubbles are <a href=\"http://en.wikipedia.org/wiki/Stock_market_bubble\">stock-market bubbles</a>.  Anything that is overvalued and becomes and object of speculation will eventually come crashing back to reality.  <a href=\"http://en.wikipedia.org/wiki/Tulip_mania\">Tulips</a> and <a href=\"http://en.wikipedia.org/wiki/Beanie_Baby\">Beanie Babies</a> come to mind.)</p>\n\n<p>A speculative bubble is a dangerous thing to get wrapped up in, and highlights the importance of not betting more than you have and always diversifying your investments.  However, in the long run, it&rsquo;s a necessary part of the feedback-cycle that produces a quality marketplace.  Yahoo, eBay, Amazon, and Google were never going to go under during the dot-com bubble.  They had to tighten their belts a notch or two, but good ideas that are executed on wisely will always do alright.</p>\n\n<p>I personally think that there really aren&rsquo;t any Amazon- or Google-sized ideas left on the web.  That&rsquo;s not to say that we can&rsquo;t innovate or can&rsquo;t make money, of course, but at this point, it&rsquo;s the 37signals and Twitters and Flickrs and YouTubes, which take a small team to create value with simple good ideas on a shoestring budget, that are making out well.  And of course, Yahoo and Google and them are doing what they do, and buying the successful startups when it makes sense to do so.  VC has been flowing back into Silicon Valley, but in much smaller streams, and with the benefit of a big failure to learn from.  The benefit of doing things on a shoestring is that it doesn&rsquo;t cost as much, and you get to keep more of your purchase price if you are eventually bought.  There is a much more stable ecosystem than there was 6 years ago.</p>\n\n<p>Granted, &ldquo;Web2.0&rdquo; is a silly marketing buzzword, and I think that most engineers and businesspeople pretty much understood that from the start.  Social networking is an interesting phenomenon, but ultimately nothing new.  (Weren&rsquo;t we networking socially <em>before</em> web2.0?)  Some things are getting attention and interest and $$$ that probably shouldn&rsquo;t, and there will be corrections in the future.  But the web crash of 2001 is not going to happen again&mdash;at least, not until the next life-changing piece of technology comes by and gets us all excited.</p>\n\n<p>What I want to know is this:  When will we as a society stop listening to doom-and-gloom pundits like Dvorak?  Did 2001 traumatize us so much that we can&rsquo;t even admit the possibility of a fortunate future?  I think there is a sort of &ldquo;interest bubble&rdquo; that somewhat mirrors the phenomenon of an economic speculative bubble.  You invest your agreement, and in return, you get to say &ldquo;I told you so.&rdquo;  The problem is, when that bubble pops, no one notices.</p>",
            "content_raw": "<p>So, I stumbled across <a href=\"http://www.pcmag.com/article2/0,1895,2164136,00.asp\">an article by John Dvorak</a>, who seems to think that we’re headed for another bubble burst in the next few years, and that it’ll be worse than the 2001 tech crash.  In fact, he asserts that <q>“Every single person working in the media today who experienced the dot-com bubble in 1999 to 2000 believes that we are going through the exact same process and can expect the exact same results,”</q> an absurdly over-reaching generalization that made me literally laugh out loud.</p>\n\n<p>I’ve heard this before.  Every once in a while, a relative or friend of mine hears someone talking on the news about how Microsoft is going to buy Yahoo, or how we’re headed for a crash, or how the internet will be outdated by some new thing in 6 months, or how “web2.0 is changing everything,” and so on, and sometimes calls me to ask what I think of it, since I’m the person they know with some skin in that game.  The vast majority of punditry is utter trash.  Like any fortune teller, they get by on one or two hits, and rely on the short attention span of the crowd to hide their nearly endless string of failed predictions.  The more radical their claim, the more likely it is that they’ll get attention, because people so often fall victim to the “Cloud Insurance” scam.  (“What if this guy is right, and the clouds really <em>are</em> going to fall… then I’ll be glad I bought that insurance!”)  The more attention he gets, and the more he can whip the audience up into a frenzy, the more likely it is that the pundits’ past failed predictions will be forgotten.</p>\n\n<p>I don’t want to come off as decrying punditry as such.  (That would sort of make me like a Dvorak of Pundits, wouldn’t it?)  No, there is some very good analysis out there.  One mark of a good analyst is a history of successful predictions.  For example, if you look through the “iTulip’s Record” links at the top of <a href=\"http://itulip.com\">iTulip.com</a>’s homepage, you’ll find some very sound predictions that were insightful, well-informed, and ultimately accurate.  In fact, <a href=\"http://www.bankrate.com/brm/news/investing/19991129f.asp?keyword=\">this article from November 1999</a> called the bubble for what it was.</p>\n\n<p>Back in the 90s, there was a great new thing that changed the way that humans interact, communicate, and generally live their lives.  Big technological innovations rarely come along and change the landscape of daily life.  The railroad, the steam engine, the printing press, the television—these kinds of things have made our world smaller, and in so doing, have had huge effects on the way that we live and work.  By changing the way that we live, they also made certain skills and commodities much more (or less) valuable than they were prior to the change.  Things that were never possible now are, and there’s new money to be made.</p>\n\n<p>By definition, no one has any experience in a new landscape-changing technology when it shows up.  New ventures cost money, and carry a risk of failure.  Not wanting to be left behind, there is often a frenzy of new ideas, along with a corresponding frenzy of spending and speculation.  Money floods into the market, artificially pushing up prices above their “real” value.  Most of those ideas fail, and most of that money is thus wasted on unproductive ends.  Eventually, the economy does what economies do, and there is a correction.</p>\n\n<p>Not all <a href=\"http://en.wikipedia.org/wiki/Economic_bubble\">Economic Bubbles</a> are the same.  Some are big, and some are small.  The stock market crash of 1929 was a bubble that kicked off the start of the <a href=\"http://en.wikipedia.org/wiki/Great_Depression\">Great Depression</a>.  By comparison, the <a href=\"http://en.wikipedia.org/wiki/Dot-com_bubble\">dot-com bubble</a> was pretty tame, though it did reduce quite a few “paper millionaires” to pennies.  (Not all economic bubbles are <a href=\"http://en.wikipedia.org/wiki/Stock_market_bubble\">stock-market bubbles</a>.  Anything that is overvalued and becomes and object of speculation will eventually come crashing back to reality.  <a href=\"http://en.wikipedia.org/wiki/Tulip_mania\">Tulips</a> and <a href=\"http://en.wikipedia.org/wiki/Beanie_Baby\">Beanie Babies</a> come to mind.)</p>\n\n<p>A speculative bubble is a dangerous thing to get wrapped up in, and highlights the importance of not betting more than you have and always diversifying your investments.  However, in the long run, it’s a necessary part of the feedback-cycle that produces a quality marketplace.  Yahoo, eBay, Amazon, and Google were never going to go under during the dot-com bubble.  They had to tighten their belts a notch or two, but good ideas that are executed on wisely will always do alright.</p>\n\n<p>I personally think that there really aren’t any Amazon- or Google-sized ideas left on the web.  That’s not to say that we can’t innovate or can’t make money, of course, but at this point, it’s the 37signals and Twitters and Flickrs and YouTubes, which take a small team to create value with simple good ideas on a shoestring budget, that are making out well.  And of course, Yahoo and Google and them are doing what they do, and buying the successful startups when it makes sense to do so.  VC has been flowing back into Silicon Valley, but in much smaller streams, and with the benefit of a big failure to learn from.  The benefit of doing things on a shoestring is that it doesn’t cost as much, and you get to keep more of your purchase price if you are eventually bought.  There is a much more stable ecosystem than there was 6 years ago.</p>\n\n<p>Granted, “Web2.0” is a silly marketing buzzword, and I think that most engineers and businesspeople pretty much understood that from the start.  Social networking is an interesting phenomenon, but ultimately nothing new.  (Weren’t we networking socially <em>before</em> web2.0?)  Some things are getting attention and interest and $$$ that probably shouldn’t, and there will be corrections in the future.  But the web crash of 2001 is not going to happen again—at least, not until the next life-changing piece of technology comes by and gets us all excited.</p>\n\n<p>What I want to know is this:  When will we as a society stop listening to doom-and-gloom pundits like Dvorak?  Did 2001 traumatize us so much that we can’t even admit the possibility of a fortunate future?  I think there is a sort of “interest bubble” that somewhat mirrors the phenomenon of an economic speculative bubble.  You invest your agreement, and in return, you get to say “I told you so.”  The problem is, when that bubble pops, no one notices.</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "146671830"
            }
        }
    ],
    "type": "text"
}