{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544578035,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>It’s <a href=\"http://radar.oreilly.com/archives/2007/03/sfearthquakes-on-twitter.html\">been said</a> that the best startups take a popular Unix command and bring it to the web.  But there are a few that are poorly represented.  I understand that I may be making a bad career move by discussing this openly on a blog, but quite honestly, my desire as a consumer for a satisfying product is enough to risk—-nay, <em>hope</em>—-that someone else makes a million dollars doing this before I get a chance to.</p>\n\n<p>I’m thinking specifically  <a href=\"http://www.freebsd.org/cgi/man.cgi?query=chpass&amp;sektion=1\">chpass</a>, <a href=\"http://www.freebsd.org/cgi/man.cgi?query=finger\">finger</a>, and <a href=\"http://www.freebsd.org/cgi/man.cgi?query=pw&amp;sektion=8\">pw</a>.</p>\n\n<p>I know what you’re thinking.  There have been a few forays into this arena.  MySpace, Facebook, and Plaxo come to mind, not to mention whatever else some MBA has stuck to a “social network” this week.  (<q>It’s just like a regular duck, but this one swims around the lake <strong>and</strong> lets you put all your friends in a list! I’ll be rich!</q> The sad thing isn’t that he thinks it; the sad thing is that he just might be right.)</p>\n\n<p>The social-for-the-sake-of-being-social sites tragically miss the point.  I have resisted getting a Facebook account for a few years now, and even deleted my MySpace account.  They seemed to require a lot of time and effort doing basically nothing, and didn’t give me what I really want.</p>\n\n<h3 id=\"managing_data_is_not_necessarily_enjoyable\">Managing data is not (necessarily) enjoyable</h3>\n\n<p>I <strong>hate</strong> managing contact lists.  The worst contact list, the one that is the hardest to manage, is the one in my head.  Every day I get older, I get worse at remembering phone numbers, and I like to know who’s calling me.  I like to see your picture when you call, see your real name when you email.  I want my email program or my phone to know who you are when I start to type the three letters of your name that I can remember off-hand, even (especially!) if you’re someone I don’t talk to often.</p>\n\n<p>That’s why I shelled out $40 for <a href=\"http://radar.oreilly.com/archives/2007/03/sfearthquakes-on-twitter.html\">Missing Sync</a> so that my phone and computer can share an address book.  I have an Applescript program sitting on my back burner that will sync any contacts I add in Adium into this same collection, and even look up their contact details from Yahoo’s corporate intranet (since most of the time, they’re work mates.)  Automated replication is still not great, but it eases the pain of managing multiple lists.</p>\n\n<p>Facebook and MySpace are software platforms designed around the premise that <em>managing</em> a contact list is fun.  And it can be in that 12-23 age range where we attempt to define ourselves and carve out our place in the world through our social connections.  That’s a key demographic for advertisers.  Good for you, Facebook.  But if I wanted to spend all this time managing my friendships, I’d have more of them in real life.  <small>Ooh, burn! i mean… hey, wait a second..</small></p>\n\n<p><a href=\"http://plaxo.com\">Plaxo</a> is actually a pretty good approximation of what I’d like to see, at least on the “managing contacts” side of things.  Granted, I’ve been spamvited to their service by half a dozen people I hardly know, which is a classic example of “let’s be viral” gone horribly horribly wrong.  But their product offering is pretty close.  You get one contact list online, and it syncs with other areas.  It’s unfocused since they’ve added “Pulse” (basically an RSS aggregator for your other web profiles), but still pretty good.</p>\n\n<p>However, even Plaxo misses a key point, and makes several fatal flaws.  I’m actually talking about a profile and contact management system that is much grander.</p>\n\n<h3 id=\"dry_8212_what_changed\"><abbr title=\"don't repeat yourself\">DRY</abbr> — What Changed</h3>\n\n<p>In a relational database or data map, the idea is to keep a piece of data in only one place, and store the relationships between entities rather than making multiple copies.  Most contact management systems, from a little black book to the cell phone contact list to Outlook to Plaxo, fail to implement this simple principle.  Instead of making each node in the network keep track of all the data about all the other nodes in which it is interested, instead let each node control its own data, and store links to the nodes in which it is interested. </p>\n\n<p>In the old days of land lines, the phone book was enough.  If you knew someone’s name and city, you could get their phone number and, perhaps, their street address by performing a simple lookup.  Each user had the option to control how much information was shared with the public.  Until the autodialer came to telemarketing, the abuse rate was limited by the cost of using the technology.</p>\n\n<p>Today, each person has many more pieces of contact information, and the cost of abuse is virtually zero.  There is no way in hell that I’d let anyone publish my actual cell phone number, and once an email address is exposed, it’s basically useless.  Spam fighting is an arm’s race, and an unfair one even for Google and Yahoo to fight.</p>\n\n<h3 id=\"why_we_need_those_commands_on_the_web\">Why we need those commands on the web</h3>\n\n<p>Back to my original point: <a href=\"http://www.freebsd.org/cgi/man.cgi?query=chpass&amp;sektion=1\">chpass</a>, <a href=\"http://www.freebsd.org/cgi/man.cgi?query=finger\">finger</a>, and <a href=\"http://www.freebsd.org/cgi/man.cgi?query=pw&amp;sektion=8\">pw</a>.</p>\n\n<dl><dt>chpass</dt>\n    <dd>\n        <p>add or change user database information</p>\n        <p>In other words, manage my info in one place.</p>\n    </dd>\n    <dt>finger</dt>\n    <dd>\n        <p>The finger utility displays information about the system users.</p>\n        <p>In other words, look up the information that other have made available.</p>\n    </dd>\n    <dt>pw</dt>\n    <dd>\n        <p>create, remove, modify &amp; display system users and groups</p>\n        <p>In other words, specify who has permission to what.</p>\n    </dd>\n</dl><p>Many large companies have some sort of online system like this.  At Yahoo, it’s the almighty Backyard, the corp website that started as a list of email addresses and grew into a full-scale intranet with contact lookup and LDAP access.  (It also features conference room booking and documentation searching and plenty of other handy things.  But mostly, it’s still all about the mega employee contact list.)</p>\n\n<p>You manage your own profile, and make sure that your numbers and whatnot are up to date.  No one else ever has to worry about how to contact you, because it’s all in one place.  However, that only works because access to the backyard system is tightly limited to current employees, so abusing the system would entail serious consequences for the abuser’s reputation (and career).</p>\n\n<p>In other words, we have finger and chpass, but pw is being done manually by the <abbr title=\"Human Resources\">HR</abbr> department, which limits the possible size of the network considerably.</p>\n\n<h3 id=\"abuse_prevention_is_extremely_non_trivial\">Abuse Prevention is Extremely Non-Trivial</h3>\n\n<p>The easier it is to use a networked contact management system, the easier it is to abuse.  The more useful it is for you and your friends and associates, the more useful it is for spammers and scammers.  Already, we have to keep our email addresses hidden from strangers.  Imagine how much worse it would be if a <abbr title=\"Porn, Pills, and Credit\">PPC</abbr> pusher could just e-finger “isaac.schlueter” and have my home address, email, phone number, instant messenger alias, birthday, and photo.  Yes this is <em>exactly</em> the sort of information that I’d like to easily share with everyone else.</p>\n\n<p>Everything that has been done so far in the area of email spam, while impressive and necessary, is <strong>fundamentally</strong> inadequate.  As long as it remains profitable for a spammer to send out 100 billion emails every day, it will happen.  Any attempts to prevent or avoid this behavior run counter to the incentives of the market; which is to say that it’s a bit like building a dam of sand and expecting to stop the Mississippi.  Won’t happen.  A bigger dam will take longer, but eventually, they’ll all crumble.</p>\n\n<p>In order to truly divert human behavior, the <em>incentive</em> must be dealt with at the source.  Direct attacks against the offenders (ie, shutting down their accounts) are not effective in the long run (they just get new accounts.)  Negative incentives, such as putting spammers in jail, are not going to be effective in the long run, because it doesn’t push the <em>cost</em> of spamming up high enough.  John Q. Spammer doesn’t think he’ll be the one to get caught, and he’s probably right.</p>\n\n<p>I don’t claim to have this bit of the system figured out, not by a long shot.  But I have a few ideas.</p>\n\n<h4 id=\"irl\">IRL</h4>\n\n<p>In real life, we meet a lot of people, and many of them can and do annoy us by contacting us in unwanted, if mostly harmless, ways.  The foul smelling man who stops babbling for a second to ask me for a quarter.  The smiling woman who shoves a tract at me and tells me I’m going to hell.  Sadly, the list goes on and on and on.</p>\n\n<p>However:</p>\n\n<ol><li>It’s easy to size someone up quickly, because:</li>\n<li>Annoying people build a reputation for being annoying, because:</li>\n<li>They’re real people and you can see who they are.</li>\n</ol><p>There are still, of course, the violent offender and the con man.  However, in real life, direct attacks incur a high degree of risk, due to the chances of being caught or retaliated against, and so law enforcement has a relatively easy time keeping serious criminals in check.  And those looking to do you harm by gaining confidence and taking advantage of it, well, they’ll always be around, but they’re pretty rare and the reputational aspects keep them somewhat in check as well.</p>\n\n<h4 id=\"so8230\">So…</h4>\n\n<p>Entrance into this global open personnel file would require that an account be tied to a single real person, who doesn’t have any other account in the system.  Accounts that are not “backed” by some kind of reliable identity are only given some kind of limited provisional access—-perhaps they can email a user through the system, but they cannot get the user’s “real” email address, and users would be able to deny access altogether to unidentified strangers if they chose.</p>\n\n<p>Identification is itself a non-trivial task requiring a high degree of trust from the web site.  Even if you know it’s 100% secure, being asked for your date of birth, <abbr title=\"Social Security Number\">SSN</abbr> or passport, and a major credit card is a tall order.  Without biometrics, it must come down to discrete bits of information at some point, which can be (and often are) faked.</p>\n\n<p>A rinky-dink fly-by-night startup can’t hope to achieve this level of trust quickly.  And, without getting a critical mass of users, the value proposition to new users is a lot tougher.</p>\n\n<p>The company to build this system would need:</p>\n\n<ol><li>A huge base of existing users and preferably their contact details, too.</li>\n<li>A strong reputation for protecting user data.</li>\n<li>Impressive engineering resources and domain knowledge in the areas of spam protection and social networking.</li>\n<li>A serious commitment to open APIs that help the web as a whole.</li>\n</ol><h3 id=\"if_it8217s_not_everywhere8230\">If it’s not everywhere…</h3>\n\n<p>…then it may as well not be anywhere.  The goal of this system would be to revolutionize contact management the same way that email and hypertext revolutionized written communication.</p>\n\n<p>Just as email works in any email client, and web pages work can be viewed by any browser, the APIs provided by this system would have to be completely open.  Any application must be allowed to interact with them, both to change data and fetch it.</p>\n\n<p>In order for it to work, and <em>really</em> have the effect that I’m talking about, there must be absolutely no lock-in, no up-sell, and reasonably liberal rate limits.</p>\n\n<h3 id=\"\">$$$</h3>\n\n<p>How does something like this make money?  That’s an open question, and a big one, probably part of the reason why I’m still pushing bits in a day job and not out getting VC to build this thing.  <small>I also happen to really like what I do at that day job.</small></p>\n\n<p>Maybe it would have to be something built under the Apache foundation or some other OSS group, and sponsored by donations of capital and resources from some major players in the online social arenas.  Maybe there’s some clever way in which smaller users and early adopters get the API for free, but then charge everyone else.</p>\n\n<h3 id=\"who_could_do_this_what8217s_going_on_now\">Who could do this?  What’s going on now?</h3>\n\n<p><a href=\"http://openid.net\">OpenID</a> is a great start, but what we really need is an open <em>profile</em> and open <em>contact list</em> system, and OpenID doesn’t provide that.</p>\n\n<p>Google’s <a href=\"http://code.google.com/apis/opensocial/\">Open Social</a> is an interesting product, but the more I read about it, the more I think it’s not quite low-level enough to really deliver on what I’d like to see here.  While it promises to expose social data to third-party applications in an API that could be consistent across social websites, it doesn’t fully address the issue of being able to manage contact data in a distributed way.</p>\n\n<p>As I said above, the company to do this will need: </p>\n\n<ol><li>A huge base of existing users and preferably their contact details, too.</li>\n<li>A strong reputation for protecting user data.</li>\n<li>Impressive engineering resources and domain knowledge in the areas of spam protection and social networking.</li>\n<li>A serious commitment to open APIs that help the web as a whole.</li>\n</ol><p>Yahoo has all four of these, but that whole China escapade has damaged Yahoo’s reputation in the eyes of many users.  Of any company on the web, however, Yahoo has perhaps the most to gain from such a system and a lot of resources and domain knowledge to throw at the problem.</p>\n\n<p>Even if they only share user information when presented with a subpoena, that means that using this system exposes my information to governmental intrusion, which is deeply problematic.  In order to be truly trustworthy, a stronger commitment to protecting privacy needs to be in place than just words on a corporate press release.  The officers of the company to provide this service should enter into a binding agreement that they will not knowingly expose user information, even in the face of governmental pressure.</p>\n\n<p>Like I said, I don’t have all the answers to this product.  But I know that, as a user, I’d be absolutely delighted to see something like this take hold.</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2008-03-10 17:00:38 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 146672596,
    "is_blocks_post_format": false,
    "note_count": 0,
    "post_url": "http://blog.izs.me/post/146672596/needed-chpass-finger-and-pw-for-the-web",
    "reblog": {
        "comment": "<p>It’s <a href=\"http://radar.oreilly.com/archives/2007/03/sfearthquakes-on-twitter.html\">been said</a> that the best startups take a popular Unix command and bring it to the web.  But there are a few that are poorly represented.  I understand that I may be making a bad career move by discussing this openly on a blog, but quite honestly, my desire as a consumer for a satisfying product is enough to risk—-nay, <em>hope</em>—-that someone else makes a million dollars doing this before I get a chance to.</p>\n\n<p>I’m thinking specifically  <a href=\"http://www.freebsd.org/cgi/man.cgi?query=chpass&amp;sektion=1\">chpass</a>, <a href=\"http://www.freebsd.org/cgi/man.cgi?query=finger\">finger</a>, and <a href=\"http://www.freebsd.org/cgi/man.cgi?query=pw&amp;sektion=8\">pw</a>.</p>\n\n<p>I know what you’re thinking.  There have been a few forays into this arena.  MySpace, Facebook, and Plaxo come to mind, not to mention whatever else some MBA has stuck to a “social network” this week.  (<q>It’s just like a regular duck, but this one swims around the lake <strong>and</strong> lets you put all your friends in a list! I’ll be rich!</q> The sad thing isn’t that he thinks it; the sad thing is that he just might be right.)</p>\n\n<p>The social-for-the-sake-of-being-social sites tragically miss the point.  I have resisted getting a Facebook account for a few years now, and even deleted my MySpace account.  They seemed to require a lot of time and effort doing basically nothing, and didn’t give me what I really want.</p>\n\n<h3 id=\"managing_data_is_not_necessarily_enjoyable\">Managing data is not (necessarily) enjoyable</h3>\n\n<p>I <strong>hate</strong> managing contact lists.  The worst contact list, the one that is the hardest to manage, is the one in my head.  Every day I get older, I get worse at remembering phone numbers, and I like to know who’s calling me.  I like to see your picture when you call, see your real name when you email.  I want my email program or my phone to know who you are when I start to type the three letters of your name that I can remember off-hand, even (especially!) if you’re someone I don’t talk to often.</p>\n\n<p>That’s why I shelled out $40 for <a href=\"http://radar.oreilly.com/archives/2007/03/sfearthquakes-on-twitter.html\">Missing Sync</a> so that my phone and computer can share an address book.  I have an Applescript program sitting on my back burner that will sync any contacts I add in Adium into this same collection, and even look up their contact details from Yahoo’s corporate intranet (since most of the time, they’re work mates.)  Automated replication is still not great, but it eases the pain of managing multiple lists.</p>\n\n<p>Facebook and MySpace are software platforms designed around the premise that <em>managing</em> a contact list is fun.  And it can be in that 12-23 age range where we attempt to define ourselves and carve out our place in the world through our social connections.  That’s a key demographic for advertisers.  Good for you, Facebook.  But if I wanted to spend all this time managing my friendships, I’d have more of them in real life.  <small>Ooh, burn! i mean… hey, wait a second..</small></p>\n\n<p><a href=\"http://plaxo.com\">Plaxo</a> is actually a pretty good approximation of what I’d like to see, at least on the “managing contacts” side of things.  Granted, I’ve been spamvited to their service by half a dozen people I hardly know, which is a classic example of “let’s be viral” gone horribly horribly wrong.  But their product offering is pretty close.  You get one contact list online, and it syncs with other areas.  It’s unfocused since they’ve added “Pulse” (basically an RSS aggregator for your other web profiles), but still pretty good.</p>\n\n<p>However, even Plaxo misses a key point, and makes several fatal flaws.  I’m actually talking about a profile and contact management system that is much grander.</p>\n\n<h3 id=\"dry_8212_what_changed\"><abbr title=\"don't repeat yourself\">DRY</abbr> — What Changed</h3>\n\n<p>In a relational database or data map, the idea is to keep a piece of data in only one place, and store the relationships between entities rather than making multiple copies.  Most contact management systems, from a little black book to the cell phone contact list to Outlook to Plaxo, fail to implement this simple principle.  Instead of making each node in the network keep track of all the data about all the other nodes in which it is interested, instead let each node control its own data, and store links to the nodes in which it is interested. </p>\n\n<p>In the old days of land lines, the phone book was enough.  If you knew someone’s name and city, you could get their phone number and, perhaps, their street address by performing a simple lookup.  Each user had the option to control how much information was shared with the public.  Until the autodialer came to telemarketing, the abuse rate was limited by the cost of using the technology.</p>\n\n<p>Today, each person has many more pieces of contact information, and the cost of abuse is virtually zero.  There is no way in hell that I’d let anyone publish my actual cell phone number, and once an email address is exposed, it’s basically useless.  Spam fighting is an arm’s race, and an unfair one even for Google and Yahoo to fight.</p>\n\n<h3 id=\"why_we_need_those_commands_on_the_web\">Why we need those commands on the web</h3>\n\n<p>Back to my original point: <a href=\"http://www.freebsd.org/cgi/man.cgi?query=chpass&amp;sektion=1\">chpass</a>, <a href=\"http://www.freebsd.org/cgi/man.cgi?query=finger\">finger</a>, and <a href=\"http://www.freebsd.org/cgi/man.cgi?query=pw&amp;sektion=8\">pw</a>.</p>\n\n<dl><dt>chpass</dt>\n    <dd>\n        <p>add or change user database information</p>\n        <p>In other words, manage my info in one place.</p>\n    </dd>\n    <dt>finger</dt>\n    <dd>\n        <p>The finger utility displays information about the system users.</p>\n        <p>In other words, look up the information that other have made available.</p>\n    </dd>\n    <dt>pw</dt>\n    <dd>\n        <p>create, remove, modify &amp; display system users and groups</p>\n        <p>In other words, specify who has permission to what.</p>\n    </dd>\n</dl><p>Many large companies have some sort of online system like this.  At Yahoo, it’s the almighty Backyard, the corp website that started as a list of email addresses and grew into a full-scale intranet with contact lookup and LDAP access.  (It also features conference room booking and documentation searching and plenty of other handy things.  But mostly, it’s still all about the mega employee contact list.)</p>\n\n<p>You manage your own profile, and make sure that your numbers and whatnot are up to date.  No one else ever has to worry about how to contact you, because it’s all in one place.  However, that only works because access to the backyard system is tightly limited to current employees, so abusing the system would entail serious consequences for the abuser’s reputation (and career).</p>\n\n<p>In other words, we have finger and chpass, but pw is being done manually by the <abbr title=\"Human Resources\">HR</abbr> department, which limits the possible size of the network considerably.</p>\n\n<h3 id=\"abuse_prevention_is_extremely_non_trivial\">Abuse Prevention is Extremely Non-Trivial</h3>\n\n<p>The easier it is to use a networked contact management system, the easier it is to abuse.  The more useful it is for you and your friends and associates, the more useful it is for spammers and scammers.  Already, we have to keep our email addresses hidden from strangers.  Imagine how much worse it would be if a <abbr title=\"Porn, Pills, and Credit\">PPC</abbr> pusher could just e-finger “isaac.schlueter” and have my home address, email, phone number, instant messenger alias, birthday, and photo.  Yes this is <em>exactly</em> the sort of information that I’d like to easily share with everyone else.</p>\n\n<p>Everything that has been done so far in the area of email spam, while impressive and necessary, is <strong>fundamentally</strong> inadequate.  As long as it remains profitable for a spammer to send out 100 billion emails every day, it will happen.  Any attempts to prevent or avoid this behavior run counter to the incentives of the market; which is to say that it’s a bit like building a dam of sand and expecting to stop the Mississippi.  Won’t happen.  A bigger dam will take longer, but eventually, they’ll all crumble.</p>\n\n<p>In order to truly divert human behavior, the <em>incentive</em> must be dealt with at the source.  Direct attacks against the offenders (ie, shutting down their accounts) are not effective in the long run (they just get new accounts.)  Negative incentives, such as putting spammers in jail, are not going to be effective in the long run, because it doesn’t push the <em>cost</em> of spamming up high enough.  John Q. Spammer doesn’t think he’ll be the one to get caught, and he’s probably right.</p>\n\n<p>I don’t claim to have this bit of the system figured out, not by a long shot.  But I have a few ideas.</p>\n\n<h4 id=\"irl\">IRL</h4>\n\n<p>In real life, we meet a lot of people, and many of them can and do annoy us by contacting us in unwanted, if mostly harmless, ways.  The foul smelling man who stops babbling for a second to ask me for a quarter.  The smiling woman who shoves a tract at me and tells me I’m going to hell.  Sadly, the list goes on and on and on.</p>\n\n<p>However:</p>\n\n<ol><li>It’s easy to size someone up quickly, because:</li>\n<li>Annoying people build a reputation for being annoying, because:</li>\n<li>They’re real people and you can see who they are.</li>\n</ol><p>There are still, of course, the violent offender and the con man.  However, in real life, direct attacks incur a high degree of risk, due to the chances of being caught or retaliated against, and so law enforcement has a relatively easy time keeping serious criminals in check.  And those looking to do you harm by gaining confidence and taking advantage of it, well, they’ll always be around, but they’re pretty rare and the reputational aspects keep them somewhat in check as well.</p>\n\n<h4 id=\"so8230\">So…</h4>\n\n<p>Entrance into this global open personnel file would require that an account be tied to a single real person, who doesn’t have any other account in the system.  Accounts that are not “backed” by some kind of reliable identity are only given some kind of limited provisional access—-perhaps they can email a user through the system, but they cannot get the user’s “real” email address, and users would be able to deny access altogether to unidentified strangers if they chose.</p>\n\n<p>Identification is itself a non-trivial task requiring a high degree of trust from the web site.  Even if you know it’s 100% secure, being asked for your date of birth, <abbr title=\"Social Security Number\">SSN</abbr> or passport, and a major credit card is a tall order.  Without biometrics, it must come down to discrete bits of information at some point, which can be (and often are) faked.</p>\n\n<p>A rinky-dink fly-by-night startup can’t hope to achieve this level of trust quickly.  And, without getting a critical mass of users, the value proposition to new users is a lot tougher.</p>\n\n<p>The company to build this system would need:</p>\n\n<ol><li>A huge base of existing users and preferably their contact details, too.</li>\n<li>A strong reputation for protecting user data.</li>\n<li>Impressive engineering resources and domain knowledge in the areas of spam protection and social networking.</li>\n<li>A serious commitment to open APIs that help the web as a whole.</li>\n</ol><h3 id=\"if_it8217s_not_everywhere8230\">If it’s not everywhere…</h3>\n\n<p>…then it may as well not be anywhere.  The goal of this system would be to revolutionize contact management the same way that email and hypertext revolutionized written communication.</p>\n\n<p>Just as email works in any email client, and web pages work can be viewed by any browser, the APIs provided by this system would have to be completely open.  Any application must be allowed to interact with them, both to change data and fetch it.</p>\n\n<p>In order for it to work, and <em>really</em> have the effect that I’m talking about, there must be absolutely no lock-in, no up-sell, and reasonably liberal rate limits.</p>\n\n<h3 id=\"\">$$$</h3>\n\n<p>How does something like this make money?  That’s an open question, and a big one, probably part of the reason why I’m still pushing bits in a day job and not out getting VC to build this thing.  <small>I also happen to really like what I do at that day job.</small></p>\n\n<p>Maybe it would have to be something built under the Apache foundation or some other OSS group, and sponsored by donations of capital and resources from some major players in the online social arenas.  Maybe there’s some clever way in which smaller users and early adopters get the API for free, but then charge everyone else.</p>\n\n<h3 id=\"who_could_do_this_what8217s_going_on_now\">Who could do this?  What’s going on now?</h3>\n\n<p><a href=\"http://openid.net\">OpenID</a> is a great start, but what we really need is an open <em>profile</em> and open <em>contact list</em> system, and OpenID doesn’t provide that.</p>\n\n<p>Google’s <a href=\"http://code.google.com/apis/opensocial/\">Open Social</a> is an interesting product, but the more I read about it, the more I think it’s not quite low-level enough to really deliver on what I’d like to see here.  While it promises to expose social data to third-party applications in an API that could be consistent across social websites, it doesn’t fully address the issue of being able to manage contact data in a distributed way.</p>\n\n<p>As I said above, the company to do this will need: </p>\n\n<ol><li>A huge base of existing users and preferably their contact details, too.</li>\n<li>A strong reputation for protecting user data.</li>\n<li>Impressive engineering resources and domain knowledge in the areas of spam protection and social networking.</li>\n<li>A serious commitment to open APIs that help the web as a whole.</li>\n</ol><p>Yahoo has all four of these, but that whole China escapade has damaged Yahoo’s reputation in the eyes of many users.  Of any company on the web, however, Yahoo has perhaps the most to gain from such a system and a lot of resources and domain knowledge to throw at the problem.</p>\n\n<p>Even if they only share user information when presented with a subpoena, that means that using this system exposes my information to governmental intrusion, which is deeply problematic.  In order to be truly trustworthy, a stronger commitment to protecting privacy needs to be in place than just words on a corporate press release.  The officers of the company to provide this service should enter into a binding agreement that they will not knowingly expose user information, even in the face of governmental pressure.</p>\n\n<p>Like I said, I don’t have all the answers to this product.  But I know that, as a user, I’d be absolutely delighted to see something like this take hold.</p>",
        "tree_html": ""
    },
    "reblog_key": "NJTFlTf5",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWy8lWlK",
    "slug": "needed-chpass-finger-and-pw-for-the-web",
    "state": "published",
    "summary": "Needed: chpass, finger, and pw for the web",
    "tags": [
        "Bright Ideas Not Yet Realized",
        "Identity",
        "The Business"
    ],
    "timestamp": 1205168438,
    "title": "Needed: chpass, finger, and pw for the web",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p>It&rsquo;s <a href=\"http://radar.oreilly.com/archives/2007/03/sfearthquakes-on-twitter.html\">been said</a> that the best startups take a popular Unix command and bring it to the web.  But there are a few that are poorly represented.  I understand that I may be making a bad career move by discussing this openly on a blog, but quite honestly, my desire as a consumer for a satisfying product is enough to risk&mdash;-nay, <em>hope</em>&mdash;-that someone else makes a million dollars doing this before I get a chance to.</p>\n\n<p>I&rsquo;m thinking specifically  <a href=\"http://www.freebsd.org/cgi/man.cgi?query=chpass&amp;sektion=1\">chpass</a>, <a href=\"http://www.freebsd.org/cgi/man.cgi?query=finger\">finger</a>, and <a href=\"http://www.freebsd.org/cgi/man.cgi?query=pw&amp;sektion=8\">pw</a>.</p>\n\n<p>I know what you&rsquo;re thinking.  There have been a few forays into this arena.  MySpace, Facebook, and Plaxo come to mind, not to mention whatever else some MBA has stuck to a &ldquo;social network&rdquo; this week.  (It&rsquo;s just like a regular duck, but this one swims around the lake <strong>and</strong> lets you put all your friends in a list! I&rsquo;ll be rich! The sad thing isn&rsquo;t that he thinks it; the sad thing is that he just might be right.)</p>\n\n<p>The social-for-the-sake-of-being-social sites tragically miss the point.  I have resisted getting a Facebook account for a few years now, and even deleted my MySpace account.  They seemed to require a lot of time and effort doing basically nothing, and didn&rsquo;t give me what I really want.</p>\n\n<h3>Managing data is not (necessarily) enjoyable</h3>\n\n<p>I <strong>hate</strong> managing contact lists.  The worst contact list, the one that is the hardest to manage, is the one in my head.  Every day I get older, I get worse at remembering phone numbers, and I like to know who&rsquo;s calling me.  I like to see your picture when you call, see your real name when you email.  I want my email program or my phone to know who you are when I start to type the three letters of your name that I can remember off-hand, even (especially!) if you&rsquo;re someone I don&rsquo;t talk to often.</p>\n\n<p>That&rsquo;s why I shelled out $40 for <a href=\"http://radar.oreilly.com/archives/2007/03/sfearthquakes-on-twitter.html\">Missing Sync</a> so that my phone and computer can share an address book.  I have an Applescript program sitting on my back burner that will sync any contacts I add in Adium into this same collection, and even look up their contact details from Yahoo&rsquo;s corporate intranet (since most of the time, they&rsquo;re work mates.)  Automated replication is still not great, but it eases the pain of managing multiple lists.</p>\n\n<p>Facebook and MySpace are software platforms designed around the premise that <em>managing</em> a contact list is fun.  And it can be in that 12-23 age range where we attempt to define ourselves and carve out our place in the world through our social connections.  That&rsquo;s a key demographic for advertisers.  Good for you, Facebook.  But if I wanted to spend all this time managing my friendships, I&rsquo;d have more of them in real life.  <small>Ooh, burn! i mean&hellip; hey, wait a second..</small></p>\n\n<p><a href=\"http://plaxo.com\">Plaxo</a> is actually a pretty good approximation of what I&rsquo;d like to see, at least on the &ldquo;managing contacts&rdquo; side of things.  Granted, I&rsquo;ve been spamvited to their service by half a dozen people I hardly know, which is a classic example of &ldquo;let&rsquo;s be viral&rdquo; gone horribly horribly wrong.  But their product offering is pretty close.  You get one contact list online, and it syncs with other areas.  It&rsquo;s unfocused since they&rsquo;ve added &ldquo;Pulse&rdquo; (basically an RSS aggregator for your other web profiles), but still pretty good.</p>\n\n<p>However, even Plaxo misses a key point, and makes several fatal flaws.  I&rsquo;m actually talking about a profile and contact management system that is much grander.</p>\n\n<h3>DRY &mdash; What Changed</h3>\n\n<p>In a relational database or data map, the idea is to keep a piece of data in only one place, and store the relationships between entities rather than making multiple copies.  Most contact management systems, from a little black book to the cell phone contact list to Outlook to Plaxo, fail to implement this simple principle.  Instead of making each node in the network keep track of all the data about all the other nodes in which it is interested, instead let each node control its own data, and store links to the nodes in which it is interested. </p>\n\n<p>In the old days of land lines, the phone book was enough.  If you knew someone&rsquo;s name and city, you could get their phone number and, perhaps, their street address by performing a simple lookup.  Each user had the option to control how much information was shared with the public.  Until the autodialer came to telemarketing, the abuse rate was limited by the cost of using the technology.</p>\n\n<p>Today, each person has many more pieces of contact information, and the cost of abuse is virtually zero.  There is no way in hell that I&rsquo;d let anyone publish my actual cell phone number, and once an email address is exposed, it&rsquo;s basically useless.  Spam fighting is an arm&rsquo;s race, and an unfair one even for Google and Yahoo to fight.</p>\n\n<h3>Why we need those commands on the web</h3>\n\n<p>Back to my original point: <a href=\"http://www.freebsd.org/cgi/man.cgi?query=chpass&amp;sektion=1\">chpass</a>, <a href=\"http://www.freebsd.org/cgi/man.cgi?query=finger\">finger</a>, and <a href=\"http://www.freebsd.org/cgi/man.cgi?query=pw&amp;sektion=8\">pw</a>.</p>\n\nchpass\n    \n        <p>add or change user database information</p>\n        <p>In other words, manage my info in one place.</p>\n    \n    finger\n    \n        <p>The finger utility displays information about the system users.</p>\n        <p>In other words, look up the information that other have made available.</p>\n    \n    pw\n    \n        <p>create, remove, modify &amp; display system users and groups</p>\n        <p>In other words, specify who has permission to what.</p>\n    \n<p>Many large companies have some sort of online system like this.  At Yahoo, it&rsquo;s the almighty Backyard, the corp website that started as a list of email addresses and grew into a full-scale intranet with contact lookup and LDAP access.  (It also features conference room booking and documentation searching and plenty of other handy things.  But mostly, it&rsquo;s still all about the mega employee contact list.)</p>\n\n<p>You manage your own profile, and make sure that your numbers and whatnot are up to date.  No one else ever has to worry about how to contact you, because it&rsquo;s all in one place.  However, that only works because access to the backyard system is tightly limited to current employees, so abusing the system would entail serious consequences for the abuser&rsquo;s reputation (and career).</p>\n\n<p>In other words, we have finger and chpass, but pw is being done manually by the HR department, which limits the possible size of the network considerably.</p>\n\n<h3>Abuse Prevention is Extremely Non-Trivial</h3>\n\n<p>The easier it is to use a networked contact management system, the easier it is to abuse.  The more useful it is for you and your friends and associates, the more useful it is for spammers and scammers.  Already, we have to keep our email addresses hidden from strangers.  Imagine how much worse it would be if a PPC pusher could just e-finger &ldquo;isaac.schlueter&rdquo; and have my home address, email, phone number, instant messenger alias, birthday, and photo.  Yes this is <em>exactly</em> the sort of information that I&rsquo;d like to easily share with everyone else.</p>\n\n<p>Everything that has been done so far in the area of email spam, while impressive and necessary, is <strong>fundamentally</strong> inadequate.  As long as it remains profitable for a spammer to send out 100 billion emails every day, it will happen.  Any attempts to prevent or avoid this behavior run counter to the incentives of the market; which is to say that it&rsquo;s a bit like building a dam of sand and expecting to stop the Mississippi.  Won&rsquo;t happen.  A bigger dam will take longer, but eventually, they&rsquo;ll all crumble.</p>\n\n<p>In order to truly divert human behavior, the <em>incentive</em> must be dealt with at the source.  Direct attacks against the offenders (ie, shutting down their accounts) are not effective in the long run (they just get new accounts.)  Negative incentives, such as putting spammers in jail, are not going to be effective in the long run, because it doesn&rsquo;t push the <em>cost</em> of spamming up high enough.  John Q. Spammer doesn&rsquo;t think he&rsquo;ll be the one to get caught, and he&rsquo;s probably right.</p>\n\n<p>I don&rsquo;t claim to have this bit of the system figured out, not by a long shot.  But I have a few ideas.</p>\n\n<h4>IRL</h4>\n\n<p>In real life, we meet a lot of people, and many of them can and do annoy us by contacting us in unwanted, if mostly harmless, ways.  The foul smelling man who stops babbling for a second to ask me for a quarter.  The smiling woman who shoves a tract at me and tells me I&rsquo;m going to hell.  Sadly, the list goes on and on and on.</p>\n\n<p>However:</p>\n\n<ol><li>It&rsquo;s easy to size someone up quickly, because:</li>\n<li>Annoying people build a reputation for being annoying, because:</li>\n<li>They&rsquo;re real people and you can see who they are.</li>\n</ol><p>There are still, of course, the violent offender and the con man.  However, in real life, direct attacks incur a high degree of risk, due to the chances of being caught or retaliated against, and so law enforcement has a relatively easy time keeping serious criminals in check.  And those looking to do you harm by gaining confidence and taking advantage of it, well, they&rsquo;ll always be around, but they&rsquo;re pretty rare and the reputational aspects keep them somewhat in check as well.</p>\n\n<h4>So&hellip;</h4>\n\n<p>Entrance into this global open personnel file would require that an account be tied to a single real person, who doesn&rsquo;t have any other account in the system.  Accounts that are not &ldquo;backed&rdquo; by some kind of reliable identity are only given some kind of limited provisional access&mdash;-perhaps they can email a user through the system, but they cannot get the user&rsquo;s &ldquo;real&rdquo; email address, and users would be able to deny access altogether to unidentified strangers if they chose.</p>\n\n<p>Identification is itself a non-trivial task requiring a high degree of trust from the web site.  Even if you know it&rsquo;s 100% secure, being asked for your date of birth, SSN or passport, and a major credit card is a tall order.  Without biometrics, it must come down to discrete bits of information at some point, which can be (and often are) faked.</p>\n\n<p>A rinky-dink fly-by-night startup can&rsquo;t hope to achieve this level of trust quickly.  And, without getting a critical mass of users, the value proposition to new users is a lot tougher.</p>\n\n<p>The company to build this system would need:</p>\n\n<ol><li>A huge base of existing users and preferably their contact details, too.</li>\n<li>A strong reputation for protecting user data.</li>\n<li>Impressive engineering resources and domain knowledge in the areas of spam protection and social networking.</li>\n<li>A serious commitment to open APIs that help the web as a whole.</li>\n</ol><h3>If it&rsquo;s not everywhere&hellip;</h3>\n\n<p>&hellip;then it may as well not be anywhere.  The goal of this system would be to revolutionize contact management the same way that email and hypertext revolutionized written communication.</p>\n\n<p>Just as email works in any email client, and web pages work can be viewed by any browser, the APIs provided by this system would have to be completely open.  Any application must be allowed to interact with them, both to change data and fetch it.</p>\n\n<p>In order for it to work, and <em>really</em> have the effect that I&rsquo;m talking about, there must be absolutely no lock-in, no up-sell, and reasonably liberal rate limits.</p>\n\n<h3>$$$</h3>\n\n<p>How does something like this make money?  That&rsquo;s an open question, and a big one, probably part of the reason why I&rsquo;m still pushing bits in a day job and not out getting VC to build this thing.  <small>I also happen to really like what I do at that day job.</small></p>\n\n<p>Maybe it would have to be something built under the Apache foundation or some other OSS group, and sponsored by donations of capital and resources from some major players in the online social arenas.  Maybe there&rsquo;s some clever way in which smaller users and early adopters get the API for free, but then charge everyone else.</p>\n\n<h3>Who could do this?  What&rsquo;s going on now?</h3>\n\n<p><a href=\"http://openid.net\">OpenID</a> is a great start, but what we really need is an open <em>profile</em> and open <em>contact list</em> system, and OpenID doesn&rsquo;t provide that.</p>\n\n<p>Google&rsquo;s <a href=\"http://code.google.com/apis/opensocial/\">Open Social</a> is an interesting product, but the more I read about it, the more I think it&rsquo;s not quite low-level enough to really deliver on what I&rsquo;d like to see here.  While it promises to expose social data to third-party applications in an API that could be consistent across social websites, it doesn&rsquo;t fully address the issue of being able to manage contact data in a distributed way.</p>\n\n<p>As I said above, the company to do this will need: </p>\n\n<ol><li>A huge base of existing users and preferably their contact details, too.</li>\n<li>A strong reputation for protecting user data.</li>\n<li>Impressive engineering resources and domain knowledge in the areas of spam protection and social networking.</li>\n<li>A serious commitment to open APIs that help the web as a whole.</li>\n</ol><p>Yahoo has all four of these, but that whole China escapade has damaged Yahoo&rsquo;s reputation in the eyes of many users.  Of any company on the web, however, Yahoo has perhaps the most to gain from such a system and a lot of resources and domain knowledge to throw at the problem.</p>\n\n<p>Even if they only share user information when presented with a subpoena, that means that using this system exposes my information to governmental intrusion, which is deeply problematic.  In order to be truly trustworthy, a stronger commitment to protecting privacy needs to be in place than just words on a corporate press release.  The officers of the company to provide this service should enter into a binding agreement that they will not knowingly expose user information, even in the face of governmental pressure.</p>\n\n<p>Like I said, I don&rsquo;t have all the answers to this product.  But I know that, as a user, I&rsquo;d be absolutely delighted to see something like this take hold.</p>",
            "content_raw": "<p>It’s <a href=\"http://radar.oreilly.com/archives/2007/03/sfearthquakes-on-twitter.html\">been said</a> that the best startups take a popular Unix command and bring it to the web.  But there are a few that are poorly represented.  I understand that I may be making a bad career move by discussing this openly on a blog, but quite honestly, my desire as a consumer for a satisfying product is enough to risk—-nay, <em>hope</em>—-that someone else makes a million dollars doing this before I get a chance to.</p>\n\n<p>I’m thinking specifically  <a href=\"http://www.freebsd.org/cgi/man.cgi?query=chpass&amp;sektion=1\">chpass</a>, <a href=\"http://www.freebsd.org/cgi/man.cgi?query=finger\">finger</a>, and <a href=\"http://www.freebsd.org/cgi/man.cgi?query=pw&amp;sektion=8\">pw</a>.</p>\n\n<p>I know what you’re thinking.  There have been a few forays into this arena.  MySpace, Facebook, and Plaxo come to mind, not to mention whatever else some MBA has stuck to a “social network” this week.  (<q>It’s just like a regular duck, but this one swims around the lake <strong>and</strong> lets you put all your friends in a list! I’ll be rich!</q> The sad thing isn’t that he thinks it; the sad thing is that he just might be right.)</p>\n\n<p>The social-for-the-sake-of-being-social sites tragically miss the point.  I have resisted getting a Facebook account for a few years now, and even deleted my MySpace account.  They seemed to require a lot of time and effort doing basically nothing, and didn’t give me what I really want.</p>\n\n<h3 id=\"managing_data_is_not_necessarily_enjoyable\">Managing data is not (necessarily) enjoyable</h3>\n\n<p>I <strong>hate</strong> managing contact lists.  The worst contact list, the one that is the hardest to manage, is the one in my head.  Every day I get older, I get worse at remembering phone numbers, and I like to know who’s calling me.  I like to see your picture when you call, see your real name when you email.  I want my email program or my phone to know who you are when I start to type the three letters of your name that I can remember off-hand, even (especially!) if you’re someone I don’t talk to often.</p>\n\n<p>That’s why I shelled out $40 for <a href=\"http://radar.oreilly.com/archives/2007/03/sfearthquakes-on-twitter.html\">Missing Sync</a> so that my phone and computer can share an address book.  I have an Applescript program sitting on my back burner that will sync any contacts I add in Adium into this same collection, and even look up their contact details from Yahoo’s corporate intranet (since most of the time, they’re work mates.)  Automated replication is still not great, but it eases the pain of managing multiple lists.</p>\n\n<p>Facebook and MySpace are software platforms designed around the premise that <em>managing</em> a contact list is fun.  And it can be in that 12-23 age range where we attempt to define ourselves and carve out our place in the world through our social connections.  That’s a key demographic for advertisers.  Good for you, Facebook.  But if I wanted to spend all this time managing my friendships, I’d have more of them in real life.  <small>Ooh, burn! i mean… hey, wait a second..</small></p>\n\n<p><a href=\"http://plaxo.com\">Plaxo</a> is actually a pretty good approximation of what I’d like to see, at least on the “managing contacts” side of things.  Granted, I’ve been spamvited to their service by half a dozen people I hardly know, which is a classic example of “let’s be viral” gone horribly horribly wrong.  But their product offering is pretty close.  You get one contact list online, and it syncs with other areas.  It’s unfocused since they’ve added “Pulse” (basically an RSS aggregator for your other web profiles), but still pretty good.</p>\n\n<p>However, even Plaxo misses a key point, and makes several fatal flaws.  I’m actually talking about a profile and contact management system that is much grander.</p>\n\n<h3 id=\"dry_8212_what_changed\"><abbr title=\"don't repeat yourself\">DRY</abbr> — What Changed</h3>\n\n<p>In a relational database or data map, the idea is to keep a piece of data in only one place, and store the relationships between entities rather than making multiple copies.  Most contact management systems, from a little black book to the cell phone contact list to Outlook to Plaxo, fail to implement this simple principle.  Instead of making each node in the network keep track of all the data about all the other nodes in which it is interested, instead let each node control its own data, and store links to the nodes in which it is interested. </p>\n\n<p>In the old days of land lines, the phone book was enough.  If you knew someone’s name and city, you could get their phone number and, perhaps, their street address by performing a simple lookup.  Each user had the option to control how much information was shared with the public.  Until the autodialer came to telemarketing, the abuse rate was limited by the cost of using the technology.</p>\n\n<p>Today, each person has many more pieces of contact information, and the cost of abuse is virtually zero.  There is no way in hell that I’d let anyone publish my actual cell phone number, and once an email address is exposed, it’s basically useless.  Spam fighting is an arm’s race, and an unfair one even for Google and Yahoo to fight.</p>\n\n<h3 id=\"why_we_need_those_commands_on_the_web\">Why we need those commands on the web</h3>\n\n<p>Back to my original point: <a href=\"http://www.freebsd.org/cgi/man.cgi?query=chpass&amp;sektion=1\">chpass</a>, <a href=\"http://www.freebsd.org/cgi/man.cgi?query=finger\">finger</a>, and <a href=\"http://www.freebsd.org/cgi/man.cgi?query=pw&amp;sektion=8\">pw</a>.</p>\n\n<dl><dt>chpass</dt>\n    <dd>\n        <p>add or change user database information</p>\n        <p>In other words, manage my info in one place.</p>\n    </dd>\n    <dt>finger</dt>\n    <dd>\n        <p>The finger utility displays information about the system users.</p>\n        <p>In other words, look up the information that other have made available.</p>\n    </dd>\n    <dt>pw</dt>\n    <dd>\n        <p>create, remove, modify &amp; display system users and groups</p>\n        <p>In other words, specify who has permission to what.</p>\n    </dd>\n</dl><p>Many large companies have some sort of online system like this.  At Yahoo, it’s the almighty Backyard, the corp website that started as a list of email addresses and grew into a full-scale intranet with contact lookup and LDAP access.  (It also features conference room booking and documentation searching and plenty of other handy things.  But mostly, it’s still all about the mega employee contact list.)</p>\n\n<p>You manage your own profile, and make sure that your numbers and whatnot are up to date.  No one else ever has to worry about how to contact you, because it’s all in one place.  However, that only works because access to the backyard system is tightly limited to current employees, so abusing the system would entail serious consequences for the abuser’s reputation (and career).</p>\n\n<p>In other words, we have finger and chpass, but pw is being done manually by the <abbr title=\"Human Resources\">HR</abbr> department, which limits the possible size of the network considerably.</p>\n\n<h3 id=\"abuse_prevention_is_extremely_non_trivial\">Abuse Prevention is Extremely Non-Trivial</h3>\n\n<p>The easier it is to use a networked contact management system, the easier it is to abuse.  The more useful it is for you and your friends and associates, the more useful it is for spammers and scammers.  Already, we have to keep our email addresses hidden from strangers.  Imagine how much worse it would be if a <abbr title=\"Porn, Pills, and Credit\">PPC</abbr> pusher could just e-finger “isaac.schlueter” and have my home address, email, phone number, instant messenger alias, birthday, and photo.  Yes this is <em>exactly</em> the sort of information that I’d like to easily share with everyone else.</p>\n\n<p>Everything that has been done so far in the area of email spam, while impressive and necessary, is <strong>fundamentally</strong> inadequate.  As long as it remains profitable for a spammer to send out 100 billion emails every day, it will happen.  Any attempts to prevent or avoid this behavior run counter to the incentives of the market; which is to say that it’s a bit like building a dam of sand and expecting to stop the Mississippi.  Won’t happen.  A bigger dam will take longer, but eventually, they’ll all crumble.</p>\n\n<p>In order to truly divert human behavior, the <em>incentive</em> must be dealt with at the source.  Direct attacks against the offenders (ie, shutting down their accounts) are not effective in the long run (they just get new accounts.)  Negative incentives, such as putting spammers in jail, are not going to be effective in the long run, because it doesn’t push the <em>cost</em> of spamming up high enough.  John Q. Spammer doesn’t think he’ll be the one to get caught, and he’s probably right.</p>\n\n<p>I don’t claim to have this bit of the system figured out, not by a long shot.  But I have a few ideas.</p>\n\n<h4 id=\"irl\">IRL</h4>\n\n<p>In real life, we meet a lot of people, and many of them can and do annoy us by contacting us in unwanted, if mostly harmless, ways.  The foul smelling man who stops babbling for a second to ask me for a quarter.  The smiling woman who shoves a tract at me and tells me I’m going to hell.  Sadly, the list goes on and on and on.</p>\n\n<p>However:</p>\n\n<ol><li>It’s easy to size someone up quickly, because:</li>\n<li>Annoying people build a reputation for being annoying, because:</li>\n<li>They’re real people and you can see who they are.</li>\n</ol><p>There are still, of course, the violent offender and the con man.  However, in real life, direct attacks incur a high degree of risk, due to the chances of being caught or retaliated against, and so law enforcement has a relatively easy time keeping serious criminals in check.  And those looking to do you harm by gaining confidence and taking advantage of it, well, they’ll always be around, but they’re pretty rare and the reputational aspects keep them somewhat in check as well.</p>\n\n<h4 id=\"so8230\">So…</h4>\n\n<p>Entrance into this global open personnel file would require that an account be tied to a single real person, who doesn’t have any other account in the system.  Accounts that are not “backed” by some kind of reliable identity are only given some kind of limited provisional access—-perhaps they can email a user through the system, but they cannot get the user’s “real” email address, and users would be able to deny access altogether to unidentified strangers if they chose.</p>\n\n<p>Identification is itself a non-trivial task requiring a high degree of trust from the web site.  Even if you know it’s 100% secure, being asked for your date of birth, <abbr title=\"Social Security Number\">SSN</abbr> or passport, and a major credit card is a tall order.  Without biometrics, it must come down to discrete bits of information at some point, which can be (and often are) faked.</p>\n\n<p>A rinky-dink fly-by-night startup can’t hope to achieve this level of trust quickly.  And, without getting a critical mass of users, the value proposition to new users is a lot tougher.</p>\n\n<p>The company to build this system would need:</p>\n\n<ol><li>A huge base of existing users and preferably their contact details, too.</li>\n<li>A strong reputation for protecting user data.</li>\n<li>Impressive engineering resources and domain knowledge in the areas of spam protection and social networking.</li>\n<li>A serious commitment to open APIs that help the web as a whole.</li>\n</ol><h3 id=\"if_it8217s_not_everywhere8230\">If it’s not everywhere…</h3>\n\n<p>…then it may as well not be anywhere.  The goal of this system would be to revolutionize contact management the same way that email and hypertext revolutionized written communication.</p>\n\n<p>Just as email works in any email client, and web pages work can be viewed by any browser, the APIs provided by this system would have to be completely open.  Any application must be allowed to interact with them, both to change data and fetch it.</p>\n\n<p>In order for it to work, and <em>really</em> have the effect that I’m talking about, there must be absolutely no lock-in, no up-sell, and reasonably liberal rate limits.</p>\n\n<h3 id=\"\">$$$</h3>\n\n<p>How does something like this make money?  That’s an open question, and a big one, probably part of the reason why I’m still pushing bits in a day job and not out getting VC to build this thing.  <small>I also happen to really like what I do at that day job.</small></p>\n\n<p>Maybe it would have to be something built under the Apache foundation or some other OSS group, and sponsored by donations of capital and resources from some major players in the online social arenas.  Maybe there’s some clever way in which smaller users and early adopters get the API for free, but then charge everyone else.</p>\n\n<h3 id=\"who_could_do_this_what8217s_going_on_now\">Who could do this?  What’s going on now?</h3>\n\n<p><a href=\"http://openid.net\">OpenID</a> is a great start, but what we really need is an open <em>profile</em> and open <em>contact list</em> system, and OpenID doesn’t provide that.</p>\n\n<p>Google’s <a href=\"http://code.google.com/apis/opensocial/\">Open Social</a> is an interesting product, but the more I read about it, the more I think it’s not quite low-level enough to really deliver on what I’d like to see here.  While it promises to expose social data to third-party applications in an API that could be consistent across social websites, it doesn’t fully address the issue of being able to manage contact data in a distributed way.</p>\n\n<p>As I said above, the company to do this will need: </p>\n\n<ol><li>A huge base of existing users and preferably their contact details, too.</li>\n<li>A strong reputation for protecting user data.</li>\n<li>Impressive engineering resources and domain knowledge in the areas of spam protection and social networking.</li>\n<li>A serious commitment to open APIs that help the web as a whole.</li>\n</ol><p>Yahoo has all four of these, but that whole China escapade has damaged Yahoo’s reputation in the eyes of many users.  Of any company on the web, however, Yahoo has perhaps the most to gain from such a system and a lot of resources and domain knowledge to throw at the problem.</p>\n\n<p>Even if they only share user information when presented with a subpoena, that means that using this system exposes my information to governmental intrusion, which is deeply problematic.  In order to be truly trustworthy, a stronger commitment to protecting privacy needs to be in place than just words on a corporate press release.  The officers of the company to provide this service should enter into a binding agreement that they will not knowingly expose user information, even in the face of governmental pressure.</p>\n\n<p>Like I said, I don’t have all the answers to this product.  But I know that, as a user, I’d be absolutely delighted to see something like this take hold.</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "146672596"
            }
        }
    ],
    "type": "text"
}