{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544578035,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>I&rsquo;m working on a site right now with Yahoo! that has not yet been released to the public, so I can&rsquo;t say too much about it.  When I first started here, I was on the games team.  Being a fairly avid chess player, <a href=\"http://games.yahoo.com\">the games site</a> was a haunt of mine as early as 1997.  (In fact, it was the first Yahoo! offering that I used on a regular basis, and human-on-human chess remains one of my favorite Yahoo! products.)  However, most of the actual content on the site was not terribly thrilling to me, since I&rsquo;m not as into video games as I once was, and the latest match-three clone doesn&rsquo;t get me going.  It was a website, with business goals, and technical hurdles, and it was fun to solve the problems, but that&rsquo;s about as deep as it went.</p>\n\n<p>Later, on the brand universe sites, we never really worked on a brand that I was all that into, and, between you me and the internet, I wasn&rsquo;t really all that happy with the direction that the product went in.  It was fun building modules, and challenging, and there were definite good times, but I definitely never went to those sites except to show someone what I had done.</p>\n\n<p>This product, however, may well become my new starting page once it releases, or at least a frequently accessed bookmark.  Unfortunately, it&rsquo;s been a real challenge to actually get stuff done instead of just consuming all the great content that it is finding.</p>\n\n<p>In a fit of cosmic irony, I came across <a href=\"http://www.nytimes.com/2006/03/07/health/07essa.html?ex=1189656000&amp;en=f0e1ab4fcd4ed85c&amp;ei=5070\">an article on the New York Times about <abbr title=\"Attention Deficit Hyperactivity Disorder\">ADHD</abbr></a>.  While there&rsquo;s really nothing particularly controversial in Peter Steinberg&rsquo;s analysis, I was struck by this:</p>\n\n<blockquote cite=\"http://www.nytimes.com/2006/03/07/health/07essa.html?ex=1189656000&amp;en=f0e1ab4fcd4ed85c&amp;ei=5070\">For those of us who have &ldquo;attention-surplus disorder&rdquo; [&hellip;] this knowledge-based economy has been a godsend. We thrive.\n\nBut attention disorder cases, up to 5 to 15 percent of the population, are at a distinct disadvantage. What once conferred certain advantages in a hunter-gatherer era, in an agrarian age or even in an industrial age is now a potentially horrific character flaw, making people feel stupid or lazy and irresponsible, when in fact neither description is apt. </blockquote>\n\n<p>I&rsquo;ve worn a lot of hats in my career.  I&rsquo;ve peddled vacuums, fixed computers, written documentation, led training classes, managed products from concept to deployment, designed logos, and built software in ASP, PHP, Javascript, CSS, VB and C++.  I&rsquo;ve walked a technically illiterate grandmother through a registry patch over the telephone.  I was more successful in some of these roles than in others, but all in all, I&rsquo;ve done alright.  I&rsquo;d definitely say that I&rsquo;m a &ldquo;knowledge worker.&rdquo;  And, I was diagnosed with AD(H)D as a child.  I took Ritalin until I rebelled against the establishment in High School and decided that I didn&rsquo;t need to be dosed.  By all accounts, I still have ADHD.  And, I don&rsquo;t think I&rsquo;d be as good at what I do if I didn&rsquo;t have this so-called &ldquo;disorder.&rdquo;</p>\n\n<p>In the words of Tyler Durden, <q>You are not a beautiful and unique snowflake.</q>  While we all have our particular unique combination of traits, I&rsquo;m quite sure that there are lots and lots of people smarter and more successful than I am.  But, not to be too vain, I&rsquo;ve thrived in this knowledge economy, and I&rsquo;m equally sure that I&rsquo;m not the only person with an &ldquo;attention deficit&rdquo; who has managed to turn this mindset to their advantage.</p>\n\n<p>Why don&rsquo;t people stop to wonder <em>why</em> their attention deficit child can&rsquo;t sit still and do spelling homework?  Because that crap is <em><abbr title=\"boring\">BOOOOORRRRIIINNNNGGGG</abbr></em>.  Everyone&rsquo;s attention pretty much works the same way.  We all have different levels of instability in our attention.  My wife can start folding clothes, and just keep going until they&rsquo;re done.  She&rsquo;s a teensy bit OCD, which is just the other side of the attention-stability spectrum from ADHD.  (That&rsquo;s probably why we make such a good team.)</p>\n\n<p>One commonly cited symptom of ADHD is the ability to get deeply immersed in certain tasks, almost to a ridiculous amount.  As a kid in the summer, I would put a new RPG into the Nintendo, and not move until I had beaten it.  I had a deficit of attention like the Pope has a deficit of catholicism.  A meteor could have landed on our roof, and I might not have noticed.  These days, it&rsquo;s web pages.  7:00 rolls around, and it takes an act of extreme willpower to &ldquo;switch off&rdquo;.</p>\n\n<p>In programming, the right kind of laziness is good.  Each bit of functionality should only have to be written once; copy-and-paste programming is the ultimate in <a href=\"http://worsethanfailure\">wtf-ery</a>.  A person with ADHD avoids boring behaviors because, to them, <em>boredom feels like dying</em>, and changing tasks is easy.  While &ldquo;normal&rdquo; people feel a sense of fear or nervousness that the things they leave won&rsquo;t get done, those of us with ADHD are quite content that we&rsquo;ll get to it later, after we do something else.  I&rsquo;m sure that there&rsquo;s some evolutionary justification for this, but all I know is that I&rsquo;d gladly get punched in the nose rather than write out those fucking spelling words 3 times each ever again.  <small>(Incidentally, there&rsquo;s some research out there indicating that childhood spelling education has little if any effect on adult spelling ability.)</small></p>\n\n<p>I often hear this when I tell people that I&rsquo;m glad that I have ADHD: <q>Well, you&rsquo;re high-functioning.  My (sister, nephew, mother, uncle, friend) is so ADHD he can&rsquo;t even hold down a job.</q>  Listen, either your friend with ADHD hasn&rsquo;t found a job they love, or their problems run deeper than an attention instability.  &ldquo;High functioning,&rdquo; with respect to ADHD, is just a euphemism for &ldquo;found something you like doing that happens to pay well.&rdquo;  I&rsquo;m just as ADHD as I ever was.  My wife knows better than to send me to the store without a list, and is frequently (if understandingly) annoyed at my forgetful and distractable nature.</p>\n\n<p>Most of the programmers I know, and nearly all of the web developers I know, have been diagnosed at some time or another with ADHD.  Now, of course, this is anecdotal evidence, and utterly painfully unscientific.  I&rsquo;m the first to cast doubt when there is a lack of hard stats on a topic, and I&rsquo;d absolutely love for some sociologist to do a proper study on this.  But how is it that there are so many people working as engineers and artists and executives working and making a living on the web who have been diagnosed with ADHD, if this disorder is such a liability in the Knowledge Economy?</p>\n\n<p>I suspect that a part of the problem is that many people learn their sense of self-worth and competence at an early age, mostly based on their ability to please their parents and teachers.  A child with ADHD doesn&rsquo;t want to do his spelling homework, and speaking from experience, it was a frustrating and emotionally painful experience.  It&rsquo;s embarrassing.  A child who is embarrassed will naturally begin to think, <q>I&rsquo;m no good at this</q>.  That thought sticks.  It shapes their choices and the things that they&rsquo;re interested in.  Labeling ADHD a &ldquo;disorder&rdquo; and subjecting children to constant humiliation and parental frustration sends the message to that they aren&rsquo;t good at <em>just about everything</em>.  At the other extreme, ADHD children are often thought to need special help and attention, and the parent who wants to do right by their child shelters them from any kind of environment where they might fail.  They quickly learn that they&rsquo;re not as good as the other kids, and stop pushing themselves.</p>\n\n<p><em>The most important thing is for a child to feel competent and successful at something that challenges them.</em>  This is actually pretty easy with ADHD kids, but only if parents are willing to look beyond the carbon-copy stimulation that most public schools offer.  Competence breeds interest, and interest motivates action, which in turn leads to more competence.  It&rsquo;s a virtuous cycle.  The non-high functioning ADHD patients probably need a shrink more than medication.  Their instability, properly harnessed, could be a source of tremendous power in the world.</p>\n\n<p>I&rsquo;ll admit, occasionally I just don&rsquo;t feel like doing something, and it&rsquo;s really hard to get moving.  The drive that sustains me for hours of intensity can also turn in the other direction, and creating a new iTunes playlist is so fascinating I can&rsquo;t tear myself away.  But the benefit of web development is that there&rsquo;s always a lot of different things to do and it all tends to feel like playing.  The deadlines just add another element to the process, like the countdown in a video game that makes the adrenaline rise up and sharpen your wits.  But the slow times require you to be a patient teacher with yourself, and be firm but understanding.  So, I take 4 hour days sometimes, or spend the better part of the day reading through my friends&rsquo; twitter updates.  Tomorrow I&rsquo;ll make it up.  This slack-and-attack rhythm isn&rsquo;t so good in some fields, but it actually works quite well in most areas of the Knowledge Economy, since the person with instable attention frequently has a great breadth and depth of knowledge about the many various things that their interest drove them to.  <em>If</em>, of course, enough time is spent in &ldquo;attack&rdquo; mode to make a difference.</p>\n\n<p>Speaking of which, we have a demo tomorrow.  So, writing this blog post <em>probably</em> isn&rsquo;t the best use of my time&hellip;</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2007-10-22 20:02:43 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 146672347,
    "is_blocks_post_format": false,
    "note_count": 1,
    "post_url": "http://blog.izs.me/post/146672347/adhd-and-web-development",
    "reblog": {
        "comment": "<p>I’m working on a site right now with Yahoo! that has not yet been released to the public, so I can’t say too much about it.  When I first started here, I was on the games team.  Being a fairly avid chess player, <a href=\"http://games.yahoo.com\">the games site</a> was a haunt of mine as early as 1997.  (In fact, it was the first Yahoo! offering that I used on a regular basis, and human-on-human chess remains one of my favorite Yahoo! products.)  However, most of the actual content on the site was not terribly thrilling to me, since I’m not as into video games as I once was, and the latest match-three clone doesn’t get me going.  It was a website, with business goals, and technical hurdles, and it was fun to solve the problems, but that’s about as deep as it went.</p>\n\n<p>Later, on the brand universe sites, we never really worked on a brand that I was all that into, and, between you me and the internet, I wasn’t really all that happy with the direction that the product went in.  It was fun building modules, and challenging, and there were definite good times, but I definitely never went to those sites except to show someone what I had done.</p>\n\n<p>This product, however, may well become my new starting page once it releases, or at least a frequently accessed bookmark.  Unfortunately, it’s been a real challenge to actually get stuff done instead of just consuming all the great content that it is finding.</p>\n\n<p>In a fit of cosmic irony, I came across <a href=\"http://www.nytimes.com/2006/03/07/health/07essa.html?ex=1189656000&amp;en=f0e1ab4fcd4ed85c&amp;ei=5070\">an article on the New York Times about <abbr title=\"Attention Deficit Hyperactivity Disorder\">ADHD</abbr></a>.  While there’s really nothing particularly controversial in Peter Steinberg’s analysis, I was struck by this:</p>\n\n<blockquote cite=\"http://www.nytimes.com/2006/03/07/health/07essa.html?ex=1189656000&amp;en=f0e1ab4fcd4ed85c&amp;ei=5070\">For those of us who have “attention-surplus disorder” […] this knowledge-based economy has been a godsend. We thrive.\n\nBut attention disorder cases, up to 5 to 15 percent of the population, are at a distinct disadvantage. What once conferred certain advantages in a hunter-gatherer era, in an agrarian age or even in an industrial age is now a potentially horrific character flaw, making people feel stupid or lazy and irresponsible, when in fact neither description is apt. </blockquote>\n\n<p>I’ve worn a lot of hats in my career.  I’ve peddled vacuums, fixed computers, written documentation, led training classes, managed products from concept to deployment, designed logos, and built software in ASP, PHP, Javascript, CSS, VB and C++.  I’ve walked a technically illiterate grandmother through a registry patch over the telephone.  I was more successful in some of these roles than in others, but all in all, I’ve done alright.  I’d definitely say that I’m a “knowledge worker.”  And, I was diagnosed with AD(H)D as a child.  I took Ritalin until I rebelled against the establishment in High School and decided that I didn’t need to be dosed.  By all accounts, I still have ADHD.  And, I don’t think I’d be as good at what I do if I didn’t have this so-called “disorder.”</p>\n\n<p>In the words of Tyler Durden, <q>You are not a beautiful and unique snowflake.</q>  While we all have our particular unique combination of traits, I’m quite sure that there are lots and lots of people smarter and more successful than I am.  But, not to be too vain, I’ve thrived in this knowledge economy, and I’m equally sure that I’m not the only person with an “attention deficit” who has managed to turn this mindset to their advantage.</p>\n\n<p>Why don’t people stop to wonder <em>why</em> their attention deficit child can’t sit still and do spelling homework?  Because that crap is <em><abbr title=\"boring\">BOOOOORRRRIIINNNNGGGG</abbr></em>.  Everyone’s attention pretty much works the same way.  We all have different levels of instability in our attention.  My wife can start folding clothes, and just keep going until they’re done.  She’s a teensy bit OCD, which is just the other side of the attention-stability spectrum from ADHD.  (That’s probably why we make such a good team.)</p>\n\n<p>One commonly cited symptom of ADHD is the ability to get deeply immersed in certain tasks, almost to a ridiculous amount.  As a kid in the summer, I would put a new RPG into the Nintendo, and not move until I had beaten it.  I had a deficit of attention like the Pope has a deficit of catholicism.  A meteor could have landed on our roof, and I might not have noticed.  These days, it’s web pages.  7:00 rolls around, and it takes an act of extreme willpower to “switch off”.</p>\n\n<p>In programming, the right kind of laziness is good.  Each bit of functionality should only have to be written once; copy-and-paste programming is the ultimate in <a href=\"http://worsethanfailure\">wtf-ery</a>.  A person with ADHD avoids boring behaviors because, to them, <em>boredom feels like dying</em>, and changing tasks is easy.  While “normal” people feel a sense of fear or nervousness that the things they leave won’t get done, those of us with ADHD are quite content that we’ll get to it later, after we do something else.  I’m sure that there’s some evolutionary justification for this, but all I know is that I’d gladly get punched in the nose rather than write out those fucking spelling words 3 times each ever again.  <small>(Incidentally, there’s some research out there indicating that childhood spelling education has little if any effect on adult spelling ability.)</small></p>\n\n<p>I often hear this when I tell people that I’m glad that I have ADHD: <q>Well, you’re high-functioning.  My (sister, nephew, mother, uncle, friend) is so ADHD he can’t even hold down a job.</q>  Listen, either your friend with ADHD hasn’t found a job they love, or their problems run deeper than an attention instability.  “High functioning,” with respect to ADHD, is just a euphemism for “found something you like doing that happens to pay well.”  I’m just as ADHD as I ever was.  My wife knows better than to send me to the store without a list, and is frequently (if understandingly) annoyed at my forgetful and distractable nature.</p>\n\n<p>Most of the programmers I know, and nearly all of the web developers I know, have been diagnosed at some time or another with ADHD.  Now, of course, this is anecdotal evidence, and utterly painfully unscientific.  I’m the first to cast doubt when there is a lack of hard stats on a topic, and I’d absolutely love for some sociologist to do a proper study on this.  But how is it that there are so many people working as engineers and artists and executives working and making a living on the web who have been diagnosed with ADHD, if this disorder is such a liability in the Knowledge Economy?</p>\n\n<p>I suspect that a part of the problem is that many people learn their sense of self-worth and competence at an early age, mostly based on their ability to please their parents and teachers.  A child with ADHD doesn’t want to do his spelling homework, and speaking from experience, it was a frustrating and emotionally painful experience.  It’s embarrassing.  A child who is embarrassed will naturally begin to think, <q>I’m no good at this</q>.  That thought sticks.  It shapes their choices and the things that they’re interested in.  Labeling ADHD a “disorder” and subjecting children to constant humiliation and parental frustration sends the message to that they aren’t good at <em>just about everything</em>.  At the other extreme, ADHD children are often thought to need special help and attention, and the parent who wants to do right by their child shelters them from any kind of environment where they might fail.  They quickly learn that they’re not as good as the other kids, and stop pushing themselves.</p>\n\n<p><em>The most important thing is for a child to feel competent and successful at something that challenges them.</em>  This is actually pretty easy with ADHD kids, but only if parents are willing to look beyond the carbon-copy stimulation that most public schools offer.  Competence breeds interest, and interest motivates action, which in turn leads to more competence.  It’s a virtuous cycle.  The non-high functioning ADHD patients probably need a shrink more than medication.  Their instability, properly harnessed, could be a source of tremendous power in the world.</p>\n\n<p>I’ll admit, occasionally I just don’t feel like doing something, and it’s really hard to get moving.  The drive that sustains me for hours of intensity can also turn in the other direction, and creating a new iTunes playlist is so fascinating I can’t tear myself away.  But the benefit of web development is that there’s always a lot of different things to do and it all tends to feel like playing.  The deadlines just add another element to the process, like the countdown in a video game that makes the adrenaline rise up and sharpen your wits.  But the slow times require you to be a patient teacher with yourself, and be firm but understanding.  So, I take 4 hour days sometimes, or spend the better part of the day reading through my friends’ twitter updates.  Tomorrow I’ll make it up.  This slack-and-attack rhythm isn’t so good in some fields, but it actually works quite well in most areas of the Knowledge Economy, since the person with instable attention frequently has a great breadth and depth of knowledge about the many various things that their interest drove them to.  <em>If</em>, of course, enough time is spent in “attack” mode to make a difference.</p>\n\n<p>Speaking of which, we have a demo tomorrow.  So, writing this blog post <em>probably</em> isn’t the best use of my time…</p>",
        "tree_html": ""
    },
    "reblog_key": "Pnh2KzPy",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWy8lWhR",
    "slug": "adhd-and-web-development",
    "state": "published",
    "summary": "ADHD and Web Development",
    "tags": [
        "Psychology of Programming",
        "Punditry"
    ],
    "timestamp": 1193083363,
    "title": "ADHD and Web Development",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p>I&rsquo;m working on a site right now with Yahoo! that has not yet been released to the public, so I can&rsquo;t say too much about it.  When I first started here, I was on the games team.  Being a fairly avid chess player, <a href=\"http://games.yahoo.com\">the games site</a> was a haunt of mine as early as 1997.  (In fact, it was the first Yahoo! offering that I used on a regular basis, and human-on-human chess remains one of my favorite Yahoo! products.)  However, most of the actual content on the site was not terribly thrilling to me, since I&rsquo;m not as into video games as I once was, and the latest match-three clone doesn&rsquo;t get me going.  It was a website, with business goals, and technical hurdles, and it was fun to solve the problems, but that&rsquo;s about as deep as it went.</p>\n\n<p>Later, on the brand universe sites, we never really worked on a brand that I was all that into, and, between you me and the internet, I wasn&rsquo;t really all that happy with the direction that the product went in.  It was fun building modules, and challenging, and there were definite good times, but I definitely never went to those sites except to show someone what I had done.</p>\n\n<p>This product, however, may well become my new starting page once it releases, or at least a frequently accessed bookmark.  Unfortunately, it&rsquo;s been a real challenge to actually get stuff done instead of just consuming all the great content that it is finding.</p>\n\n<p>In a fit of cosmic irony, I came across <a href=\"http://www.nytimes.com/2006/03/07/health/07essa.html?ex=1189656000&amp;en=f0e1ab4fcd4ed85c&amp;ei=5070\">an article on the New York Times about ADHD</a>.  While there&rsquo;s really nothing particularly controversial in Peter Steinberg&rsquo;s analysis, I was struck by this:</p>\n\n<blockquote><p>For those of us who have &ldquo;attention-surplus disorder&rdquo; [&hellip;] this knowledge-based economy has been a godsend. We thrive.\n\nBut attention disorder cases, up to 5 to 15 percent of the population, are at a distinct disadvantage. What once conferred certain advantages in a hunter-gatherer era, in an agrarian age or even in an industrial age is now a potentially horrific character flaw, making people feel stupid or lazy and irresponsible, when in fact neither description is apt. </p></blockquote>\n\n<p>I&rsquo;ve worn a lot of hats in my career.  I&rsquo;ve peddled vacuums, fixed computers, written documentation, led training classes, managed products from concept to deployment, designed logos, and built software in ASP, PHP, Javascript, CSS, VB and C++.  I&rsquo;ve walked a technically illiterate grandmother through a registry patch over the telephone.  I was more successful in some of these roles than in others, but all in all, I&rsquo;ve done alright.  I&rsquo;d definitely say that I&rsquo;m a &ldquo;knowledge worker.&rdquo;  And, I was diagnosed with AD(H)D as a child.  I took Ritalin until I rebelled against the establishment in High School and decided that I didn&rsquo;t need to be dosed.  By all accounts, I still have ADHD.  And, I don&rsquo;t think I&rsquo;d be as good at what I do if I didn&rsquo;t have this so-called &ldquo;disorder.&rdquo;</p>\n\n<p>In the words of Tyler Durden, You are not a beautiful and unique snowflake.  While we all have our particular unique combination of traits, I&rsquo;m quite sure that there are lots and lots of people smarter and more successful than I am.  But, not to be too vain, I&rsquo;ve thrived in this knowledge economy, and I&rsquo;m equally sure that I&rsquo;m not the only person with an &ldquo;attention deficit&rdquo; who has managed to turn this mindset to their advantage.</p>\n\n<p>Why don&rsquo;t people stop to wonder <em>why</em> their attention deficit child can&rsquo;t sit still and do spelling homework?  Because that crap is <em>BOOOOORRRRIIINNNNGGGG</em>.  Everyone&rsquo;s attention pretty much works the same way.  We all have different levels of instability in our attention.  My wife can start folding clothes, and just keep going until they&rsquo;re done.  She&rsquo;s a teensy bit OCD, which is just the other side of the attention-stability spectrum from ADHD.  (That&rsquo;s probably why we make such a good team.)</p>\n\n<p>One commonly cited symptom of ADHD is the ability to get deeply immersed in certain tasks, almost to a ridiculous amount.  As a kid in the summer, I would put a new RPG into the Nintendo, and not move until I had beaten it.  I had a deficit of attention like the Pope has a deficit of catholicism.  A meteor could have landed on our roof, and I might not have noticed.  These days, it&rsquo;s web pages.  7:00 rolls around, and it takes an act of extreme willpower to &ldquo;switch off&rdquo;.</p>\n\n<p>In programming, the right kind of laziness is good.  Each bit of functionality should only have to be written once; copy-and-paste programming is the ultimate in <a href=\"http://worsethanfailure\">wtf-ery</a>.  A person with ADHD avoids boring behaviors because, to them, <em>boredom feels like dying</em>, and changing tasks is easy.  While &ldquo;normal&rdquo; people feel a sense of fear or nervousness that the things they leave won&rsquo;t get done, those of us with ADHD are quite content that we&rsquo;ll get to it later, after we do something else.  I&rsquo;m sure that there&rsquo;s some evolutionary justification for this, but all I know is that I&rsquo;d gladly get punched in the nose rather than write out those fucking spelling words 3 times each ever again.  <small>(Incidentally, there&rsquo;s some research out there indicating that childhood spelling education has little if any effect on adult spelling ability.)</small></p>\n\n<p>I often hear this when I tell people that I&rsquo;m glad that I have ADHD: Well, you&rsquo;re high-functioning.  My (sister, nephew, mother, uncle, friend) is so ADHD he can&rsquo;t even hold down a job.  Listen, either your friend with ADHD hasn&rsquo;t found a job they love, or their problems run deeper than an attention instability.  &ldquo;High functioning,&rdquo; with respect to ADHD, is just a euphemism for &ldquo;found something you like doing that happens to pay well.&rdquo;  I&rsquo;m just as ADHD as I ever was.  My wife knows better than to send me to the store without a list, and is frequently (if understandingly) annoyed at my forgetful and distractable nature.</p>\n\n<p>Most of the programmers I know, and nearly all of the web developers I know, have been diagnosed at some time or another with ADHD.  Now, of course, this is anecdotal evidence, and utterly painfully unscientific.  I&rsquo;m the first to cast doubt when there is a lack of hard stats on a topic, and I&rsquo;d absolutely love for some sociologist to do a proper study on this.  But how is it that there are so many people working as engineers and artists and executives working and making a living on the web who have been diagnosed with ADHD, if this disorder is such a liability in the Knowledge Economy?</p>\n\n<p>I suspect that a part of the problem is that many people learn their sense of self-worth and competence at an early age, mostly based on their ability to please their parents and teachers.  A child with ADHD doesn&rsquo;t want to do his spelling homework, and speaking from experience, it was a frustrating and emotionally painful experience.  It&rsquo;s embarrassing.  A child who is embarrassed will naturally begin to think, I&rsquo;m no good at this.  That thought sticks.  It shapes their choices and the things that they&rsquo;re interested in.  Labeling ADHD a &ldquo;disorder&rdquo; and subjecting children to constant humiliation and parental frustration sends the message to that they aren&rsquo;t good at <em>just about everything</em>.  At the other extreme, ADHD children are often thought to need special help and attention, and the parent who wants to do right by their child shelters them from any kind of environment where they might fail.  They quickly learn that they&rsquo;re not as good as the other kids, and stop pushing themselves.</p>\n\n<p><em>The most important thing is for a child to feel competent and successful at something that challenges them.</em>  This is actually pretty easy with ADHD kids, but only if parents are willing to look beyond the carbon-copy stimulation that most public schools offer.  Competence breeds interest, and interest motivates action, which in turn leads to more competence.  It&rsquo;s a virtuous cycle.  The non-high functioning ADHD patients probably need a shrink more than medication.  Their instability, properly harnessed, could be a source of tremendous power in the world.</p>\n\n<p>I&rsquo;ll admit, occasionally I just don&rsquo;t feel like doing something, and it&rsquo;s really hard to get moving.  The drive that sustains me for hours of intensity can also turn in the other direction, and creating a new iTunes playlist is so fascinating I can&rsquo;t tear myself away.  But the benefit of web development is that there&rsquo;s always a lot of different things to do and it all tends to feel like playing.  The deadlines just add another element to the process, like the countdown in a video game that makes the adrenaline rise up and sharpen your wits.  But the slow times require you to be a patient teacher with yourself, and be firm but understanding.  So, I take 4 hour days sometimes, or spend the better part of the day reading through my friends&rsquo; twitter updates.  Tomorrow I&rsquo;ll make it up.  This slack-and-attack rhythm isn&rsquo;t so good in some fields, but it actually works quite well in most areas of the Knowledge Economy, since the person with instable attention frequently has a great breadth and depth of knowledge about the many various things that their interest drove them to.  <em>If</em>, of course, enough time is spent in &ldquo;attack&rdquo; mode to make a difference.</p>\n\n<p>Speaking of which, we have a demo tomorrow.  So, writing this blog post <em>probably</em> isn&rsquo;t the best use of my time&hellip;</p>",
            "content_raw": "<p>I’m working on a site right now with Yahoo! that has not yet been released to the public, so I can’t say too much about it.  When I first started here, I was on the games team.  Being a fairly avid chess player, <a href=\"http://games.yahoo.com\">the games site</a> was a haunt of mine as early as 1997.  (In fact, it was the first Yahoo! offering that I used on a regular basis, and human-on-human chess remains one of my favorite Yahoo! products.)  However, most of the actual content on the site was not terribly thrilling to me, since I’m not as into video games as I once was, and the latest match-three clone doesn’t get me going.  It was a website, with business goals, and technical hurdles, and it was fun to solve the problems, but that’s about as deep as it went.</p>\n\n<p>Later, on the brand universe sites, we never really worked on a brand that I was all that into, and, between you me and the internet, I wasn’t really all that happy with the direction that the product went in.  It was fun building modules, and challenging, and there were definite good times, but I definitely never went to those sites except to show someone what I had done.</p>\n\n<p>This product, however, may well become my new starting page once it releases, or at least a frequently accessed bookmark.  Unfortunately, it’s been a real challenge to actually get stuff done instead of just consuming all the great content that it is finding.</p>\n\n<p>In a fit of cosmic irony, I came across <a href=\"http://www.nytimes.com/2006/03/07/health/07essa.html?ex=1189656000&amp;en=f0e1ab4fcd4ed85c&amp;ei=5070\">an article on the New York Times about <abbr title=\"Attention Deficit Hyperactivity Disorder\">ADHD</abbr></a>.  While there’s really nothing particularly controversial in Peter Steinberg’s analysis, I was struck by this:</p>\n\n<blockquote cite=\"http://www.nytimes.com/2006/03/07/health/07essa.html?ex=1189656000&amp;en=f0e1ab4fcd4ed85c&amp;ei=5070\">For those of us who have “attention-surplus disorder” […] this knowledge-based economy has been a godsend. We thrive.\n\nBut attention disorder cases, up to 5 to 15 percent of the population, are at a distinct disadvantage. What once conferred certain advantages in a hunter-gatherer era, in an agrarian age or even in an industrial age is now a potentially horrific character flaw, making people feel stupid or lazy and irresponsible, when in fact neither description is apt. </blockquote>\n\n<p>I’ve worn a lot of hats in my career.  I’ve peddled vacuums, fixed computers, written documentation, led training classes, managed products from concept to deployment, designed logos, and built software in ASP, PHP, Javascript, CSS, VB and C++.  I’ve walked a technically illiterate grandmother through a registry patch over the telephone.  I was more successful in some of these roles than in others, but all in all, I’ve done alright.  I’d definitely say that I’m a “knowledge worker.”  And, I was diagnosed with AD(H)D as a child.  I took Ritalin until I rebelled against the establishment in High School and decided that I didn’t need to be dosed.  By all accounts, I still have ADHD.  And, I don’t think I’d be as good at what I do if I didn’t have this so-called “disorder.”</p>\n\n<p>In the words of Tyler Durden, <q>You are not a beautiful and unique snowflake.</q>  While we all have our particular unique combination of traits, I’m quite sure that there are lots and lots of people smarter and more successful than I am.  But, not to be too vain, I’ve thrived in this knowledge economy, and I’m equally sure that I’m not the only person with an “attention deficit” who has managed to turn this mindset to their advantage.</p>\n\n<p>Why don’t people stop to wonder <em>why</em> their attention deficit child can’t sit still and do spelling homework?  Because that crap is <em><abbr title=\"boring\">BOOOOORRRRIIINNNNGGGG</abbr></em>.  Everyone’s attention pretty much works the same way.  We all have different levels of instability in our attention.  My wife can start folding clothes, and just keep going until they’re done.  She’s a teensy bit OCD, which is just the other side of the attention-stability spectrum from ADHD.  (That’s probably why we make such a good team.)</p>\n\n<p>One commonly cited symptom of ADHD is the ability to get deeply immersed in certain tasks, almost to a ridiculous amount.  As a kid in the summer, I would put a new RPG into the Nintendo, and not move until I had beaten it.  I had a deficit of attention like the Pope has a deficit of catholicism.  A meteor could have landed on our roof, and I might not have noticed.  These days, it’s web pages.  7:00 rolls around, and it takes an act of extreme willpower to “switch off”.</p>\n\n<p>In programming, the right kind of laziness is good.  Each bit of functionality should only have to be written once; copy-and-paste programming is the ultimate in <a href=\"http://worsethanfailure\">wtf-ery</a>.  A person with ADHD avoids boring behaviors because, to them, <em>boredom feels like dying</em>, and changing tasks is easy.  While “normal” people feel a sense of fear or nervousness that the things they leave won’t get done, those of us with ADHD are quite content that we’ll get to it later, after we do something else.  I’m sure that there’s some evolutionary justification for this, but all I know is that I’d gladly get punched in the nose rather than write out those fucking spelling words 3 times each ever again.  <small>(Incidentally, there’s some research out there indicating that childhood spelling education has little if any effect on adult spelling ability.)</small></p>\n\n<p>I often hear this when I tell people that I’m glad that I have ADHD: <q>Well, you’re high-functioning.  My (sister, nephew, mother, uncle, friend) is so ADHD he can’t even hold down a job.</q>  Listen, either your friend with ADHD hasn’t found a job they love, or their problems run deeper than an attention instability.  “High functioning,” with respect to ADHD, is just a euphemism for “found something you like doing that happens to pay well.”  I’m just as ADHD as I ever was.  My wife knows better than to send me to the store without a list, and is frequently (if understandingly) annoyed at my forgetful and distractable nature.</p>\n\n<p>Most of the programmers I know, and nearly all of the web developers I know, have been diagnosed at some time or another with ADHD.  Now, of course, this is anecdotal evidence, and utterly painfully unscientific.  I’m the first to cast doubt when there is a lack of hard stats on a topic, and I’d absolutely love for some sociologist to do a proper study on this.  But how is it that there are so many people working as engineers and artists and executives working and making a living on the web who have been diagnosed with ADHD, if this disorder is such a liability in the Knowledge Economy?</p>\n\n<p>I suspect that a part of the problem is that many people learn their sense of self-worth and competence at an early age, mostly based on their ability to please their parents and teachers.  A child with ADHD doesn’t want to do his spelling homework, and speaking from experience, it was a frustrating and emotionally painful experience.  It’s embarrassing.  A child who is embarrassed will naturally begin to think, <q>I’m no good at this</q>.  That thought sticks.  It shapes their choices and the things that they’re interested in.  Labeling ADHD a “disorder” and subjecting children to constant humiliation and parental frustration sends the message to that they aren’t good at <em>just about everything</em>.  At the other extreme, ADHD children are often thought to need special help and attention, and the parent who wants to do right by their child shelters them from any kind of environment where they might fail.  They quickly learn that they’re not as good as the other kids, and stop pushing themselves.</p>\n\n<p><em>The most important thing is for a child to feel competent and successful at something that challenges them.</em>  This is actually pretty easy with ADHD kids, but only if parents are willing to look beyond the carbon-copy stimulation that most public schools offer.  Competence breeds interest, and interest motivates action, which in turn leads to more competence.  It’s a virtuous cycle.  The non-high functioning ADHD patients probably need a shrink more than medication.  Their instability, properly harnessed, could be a source of tremendous power in the world.</p>\n\n<p>I’ll admit, occasionally I just don’t feel like doing something, and it’s really hard to get moving.  The drive that sustains me for hours of intensity can also turn in the other direction, and creating a new iTunes playlist is so fascinating I can’t tear myself away.  But the benefit of web development is that there’s always a lot of different things to do and it all tends to feel like playing.  The deadlines just add another element to the process, like the countdown in a video game that makes the adrenaline rise up and sharpen your wits.  But the slow times require you to be a patient teacher with yourself, and be firm but understanding.  So, I take 4 hour days sometimes, or spend the better part of the day reading through my friends’ twitter updates.  Tomorrow I’ll make it up.  This slack-and-attack rhythm isn’t so good in some fields, but it actually works quite well in most areas of the Knowledge Economy, since the person with instable attention frequently has a great breadth and depth of knowledge about the many various things that their interest drove them to.  <em>If</em>, of course, enough time is spent in “attack” mode to make a difference.</p>\n\n<p>Speaking of which, we have a demo tomorrow.  So, writing this blog post <em>probably</em> isn’t the best use of my time…</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "146672347"
            }
        }
    ],
    "type": "text"
}