{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544578035,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>I stumbled across a <a href=\"http://www.ibm.com/developerworks/linux/library/l-clear-code/?ca=dgr-FClnxw01linuxcodetips\">great article about clean code</a> from Jeff Vogel over at the IBM Developerworks blog site, via a <a href=\"http://developers.slashdot.org/article.pl?sid=07/05/30/1813247&amp;from=rss\">/. article</a>.  Even more valuable was the <a href=\"http://www.freevbcode.com/ShowCode.Asp?ID=2547\">How to write unmaintainable code</a> article, which appears to have grown considerably since I first saw a version of it back in college.</p>\n\n<p>A simple <a href=\"http://www.google.com/search?q=maintainable+code\">web search</a> can uncover a lot of articles about writing maintainable code.  There have been <a href=\"http://www.amazon.com/s/ref=nb_ss_gw/102-4912607-6304117?url=search-alias%3Daps&amp;field-keywords=maintainable+code&amp;tag=isaacschlcom-20\">several books written on the subject</a>.  And yet, I consistently find that code examples and tutorials, not to mention programming text books, very often break all or most of these rules.</p>\n\n<p>To a certain degree, what makes code &ldquo;maintainable&rdquo; is a matter of opinion.  However, it is pretty universally accepted that the vast majority of programmer-hours are spent debugging, fixing, and extending existing code.  It&rsquo;s very rare, even when working on an entirely new project, that you open up a blank file in your text editor and start coding.  After the first few hours of the first day of a project, you&rsquo;re working in an existing code ecosystem.  Is it a crazy jungle with vines and savage beasts?  Or a well-lit sidewalk with friendly pedestrians?</p>\n\n<p>I think these assumptions are pretty safe to make for any programmer in any language:</p>\n\n<ol><li>At least 80% of a programmer&rsquo;s time is spent working with an existing code base (possibly one they just created).</li>\n    <li>Debugging code is more difficult than writing it. (Or, problems are harder to fix than to create.)</li>\n    <li>Extending code (adding features) is the riskiest thing that you can do (bug-wise.)</li>\n</ol><p>Nevertheless, no matter what code you&rsquo;re working on, every programmer faces these demands:</p>\n\n<ol><li>Management allocates more time for development than for maintenance. (Usually <strong>after</strong> asking us for insight!)</li>\n    <li>Maintenance is sloughed off onto the least experienced developer in the team.</li>\n    <li>The existing feature set is looked at as a &ldquo;base,&rdquo; and new features are requested constantly.</li>\n</ol><p>It is thus impossible to overestimate the importance of writing code that is as easy as possible to fix, extend, and reconfigure, even if the person doing the fixing or extending has never seen the code before.  (Or, as is perhaps more common, was the code&rsquo;s original author, but has forgotten what they were originally thinking when they wrote it.)  If you are a programmer or manager of programmers, look at it this way: at least 80% of your development budget depends on the maintainability of the code that you and your team produce.  The techniques that create maintainable code are mostly free, but not using them costs you big time.</p>\n\n<p>As a web developer, I tend to have a somewhat extended view of product lifetimes.  There is still code on the internet from 1993, and that was back when we didn&rsquo;t know what we were doing.  Now that we&rsquo;ve got all this experience, we should expect that the code we write will be around even longer.  The programmer who gets to maintain your code might not have been born yet.  Be kind to that poor soul.</p>\n\n<p>These are the tips that I think are the most important contributors to writing maintainable code.  It&rsquo;s a matter of opinion, to a certain extent, and there&rsquo;s plenty of disagreement, so take this for what it&rsquo;s worth.  Feedback is, of course, always welcome.</p>\n\n<!--more-->\n\n<h3>1. Don&rsquo;t be clever</h3>\n\n<p>We already know you&rsquo;re smart; prove it by writing code that monkeys can understand.  Programming should be approached like a haiku, not a riddle.  Make it simple, and don&rsquo;t make me have to think hard when I come by years later to fix or change or add something.</p>\n\n<p><a href=\"http://en.wikiquote.org/wiki/Brian_W._Kernighan\">Brian W. Kernighan</a> famously said, &ldquo;<q>Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.</q>&rdquo;  Try to find the balance between hard-coded and over-engineered.</p>\n\n<h3>2. Think clearly.</h3>\n\n<p>You can&rsquo;t teach someone to think in an organized fashion.  The best that you can do is find someone who does this already and convince them that they should do it when they write code.  Create objects that make sense for the task at hand.</p>\n\n<p>That makes it easy to:</p>\n\n<h3>3. Let the code describe itself</h3>\n\n<p>Comment your code, yes, yes, you hear it all the time. But don&rsquo;t write comments that say <em>how</em> something is done.  Write comments that say <em>why</em>, and let the code speak for itself.  The only thing worse than this:</p>\n\n<p><code class=\"block\">// increment i by 1\ni += 1;</code></p>\n\n<p>is this:</p>\n\n<p><code class=\"block\">// increment i by 1\ni += 2;</code></p>\n\n<p>When you write comments that describe how instead of describing why, over time you inevitably end up with comments that lie, because code is much more likely to change than comments.  Let the code say what it does.  You just have to say why it does what it does.</p>\n\n<h3>4. Hungarian notation is eviler than eval</h3>\n\n<p>I sometimes think that Hungarian Notation was surely developed by some kind of mad scientist with an extreme hatred of maintenance programmers*.  It&rsquo;s almost never consistent, it&rsquo;s hard to read, and it puts information where it doesn&rsquo;t belong.  It is a profoundly flagrant violation of the rule that comments should say why and not what.</p>\n\n<p>Consider the basic case of &ldquo;iCnt&rdquo; for an integer counter, or &lsquo;sType&rsquo; as a string, or 'oElement&rsquo; as an object.  If your code is so convoluted that a maintenance programmer doesn&rsquo;t know that your counter is an integer, or that the element reference is an object, or that &ldquo;type&rdquo; is a string, well, there&rsquo;s something deeply wrong with either your code or your hiring process.</p>\n\n<p>Avoid Hungarian notation like the plague.</p>\n\n<p><small>* This is a joke.  I&rsquo;m sure it was actually developed by very well-meaning programmers who were honestly trying to address this problem.  Nonetheless, it&rsquo;s a very bad solution that tends to compound the problem significantly.</small></p>\n\n<h3>5. Small pieces, loosely coupled</h3>\n\n<p>A lot of maintenance checklists and lint programs instruct at the expression or syntax level.  However, arguably the most important key to creating maintainable code is to build small pieces that interact with one another in loosely coupled ways.  This minimizes dependencies, reduces the amount of code that you have to write and maintain, and makes extension and re-use much simpler.</p>\n\n<p>Less code is almost always better.  Instead of having 1 object that implements 10 features, it&rsquo;s often better to have 10 small objects that implement one feature each, and just listen for and respond to the events that they need.  Using a <a href=\"http://developer.yahoo.com/yui/event/#customevent\">good event utility</a>, this is an extremely powerful pattern for user interface code, especially.  Widget-A just listens to an event from widget-B; when that event fires, it does its thing.  If the event never fires, then widget-A never gets activated.  This means that you can remove or change widget-B without fearing that you&rsquo;re going to cause massive regressions.</p>\n\n<p><a href=\"http://codinghorror.com\">Coding Horror</a> is one of my daily reads.  If you don&rsquo;t read it, you should.  Jeff Atwood put it quite well when he exhorted developers to <a href=\"http://www.codinghorror.com/blog/archives/000791.html\">Code Smaller</a>.  They he later <a href=\"http://www.codinghorror.com/blog/archives/000878.html\">wrote that the best code is no code at all</a>.  I couldn&rsquo;t agree more.</p>\n\n<h3>6. Use OO (and other patterns) Wisely</h3>\n\n<p>Object Oriented programming <em>can</em> help you follow these rules.  But, not everything <em>has</em> to inherit from something else.  There is such a thing as over-engineering.  &ldquo;Silver bullets&rdquo; approaches are common causes of this problem.</p>\n\n<p>Use an Object Oriented approach that makes sense.  Most of the time, in my experience, inheritance is not the best approach, unless you&rsquo;re going to have a lot of types of things, where the types have a lot in common.  This means that you&rsquo;re dealing with a huge number of objects, which is not the case in most applications.  Again, <em>most of the time</em>, &ldquo;has-a&rdquo; approaches are much simpler and more flexible than &ldquo;is-a&rdquo; approaches.</p>\n\n<p>Think of it with a real-world example.  &ldquo;Sandwich&rdquo; doesn&rsquo;t inherit from &ldquo;bread&rdquo;.  You wouldn&rsquo;t say, &ldquo;a sandwich <em>is a</em> type of bread that has stuff inside.&rdquo;  This might, arguably, be true.  But, the way that most people talk (and more importantly, how we think,) is that a sandwich is a &ldquo;thing&rdquo; that <em>has</em> bread with stuff inside.  Furthermore, a waiter is not a sandwich with legs; a waiter is a person who <em>has a</em> sandwich and brings it to you.  Since said waiter may also have a second job as an actor, it&rsquo;s not even right to say that the &ldquo;waiter&rdquo; class inherits from &ldquo;person.&rdquo;  A waiter is not a type of person, it&rsquo;s a person who <em>has a</em> job delivering food to tables.</p>\n\n<p>Some languages implement multiple inheritance and other things that seek to address the &ldquo;multiple hats&rdquo; problem using classic OO techniques.  If you ask me, don&rsquo;t buck the epistemological trends&mdash;use the methodology that we use for everything else, and extend using has-a instead of is-a.</p>\n\n<h3>7. Be harsh on the code, gentle on the coder</h3>\n\n<p>We&rsquo;re all human.  We make mistakes.  Even the best of us violate the rules sometimes, and most of us, by definition, are not &ldquo;the best of us.&rdquo;  However, there is no excuse for bad code.  It should be killed on sight.  Be your own harshest critic, and never shy away from criticism.  Seek it out.  Turn to your coworkers and say, &ldquo;Hm. You know, this thing I&rsquo;m working on just seems like I&rsquo;m making it too convoluted.  Can I run my approach by you and see if I&rsquo;m over-thinking this?&rdquo;</p>\n\n<p>Give honest criticism without any hesitation, but never <em>ever</em> say, imply, or even <em>think</em> that the programmer must have been dense.  Sure, maybe the programmer really <em>was</em> dense.  But if you&rsquo;re growing as a developer, hell, as a person, then you should think the same thing about the stuff you did last year.  Nothing is more humbling than having to support your own code a year later.  Pepper your criticism with a light-hearted attitude, and be generous in praising the parts that you think are good.  Keep your venting to yourself.  It will raise your status if you help someone else succeed; tearing down just hurts us all.</p>\n\n<p>Sure, this might be good advice, obvious, even.  But how does it help make maintainable code?  By fostering positivity, you&rsquo;ll help create an atmosphere where bad code is not tolerated, but where everyone is encouraged to grow and experiment.  The best way to avoid bad code is to make the programmers better.</p>\n\n<p>I personally think that a few interpersonal communication classes would be a good addition to any computer science curriculum.</p>\n\n<h3>8. Fail</h3>\n\n<p>You won&rsquo;t be able to create resilient systems unless you know how they&rsquo;ll break.  You won&rsquo;t know how they&rsquo;ll break until they do.</p>\n\n<p>Failure is a prerequisite for success.  So, get ready to do it.  A lot.  I&rsquo;ve written LOTS of very bad code.  (Some of it is even here on this website!)  Plan for an alpha and beta.  Do them as fast as possible. Bang on them.  Then throw them out and start over, taking what you learned into the next version.</p>\n\n<p>Share your failure.  Have a code review session where everyone brings in the worst code that they&rsquo;ve written for the project, and solicits ideas for what went wrong.  (It&rsquo;s kind of like an AA meeting: Hi, my name is Isaac, and I wrote bad code. <em>Hello, Isaac&hellip;</em>.)</p>\n\n<p>It&rsquo;s so often these days, especially in big corporations with lots of different teams, for each team to share their successes loudly, but sweep their failure under the rug.  We&rsquo;re all afraid of getting a bad review, but this virtually guarantees that all the <em>other</em> teams will fail in exactly the same way.  Even in a small company with only one or two teams, sharing failure can result in an exponential reduction in errors.</p>\n\n<p>Furthermore, sharing your own failures, and asking for criticism, makes it easier for others to take criticism when you point out bad code that they wrote.  It is very difficult to separate &ldquo;me&rdquo; from &ldquo;my code&rdquo;.  If you criticize one, the other might get hurt.  Sharing failure helps to sever this connection, and allows everyone to associate and connect with the success of the product as a whole.</p>\n\n<p>Building a few prototype/failure builds into your development process will also help to produce stable builds faster.  It allows for user-research sooner.  By planning a throw-away build, it helps get everyone focused on which features are actually important/necessary, and which are either too difficult or unimportant to bother building.  It gets product and engineering talking sooner.</p>\n\n<p>Failure (and handling it intelligently) is not just important, it&rsquo;s absolutely <em>vital</em> when it comes to building systems that are going to stick around for decades.</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2007-06-03 03:27:04 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 146671374,
    "is_blocks_post_format": false,
    "note_count": 0,
    "post_url": "http://blog.izs.me/post/146671374/the-most-important-things-they-dont-teach-in",
    "reblog": {
        "comment": "<p>I stumbled across a <a href=\"http://www.ibm.com/developerworks/linux/library/l-clear-code/?ca=dgr-FClnxw01linuxcodetips\">great article about clean code</a> from Jeff Vogel over at the IBM Developerworks blog site, via a <a href=\"http://developers.slashdot.org/article.pl?sid=07/05/30/1813247&amp;from=rss\">/. article</a>.  Even more valuable was the <a href=\"http://www.freevbcode.com/ShowCode.Asp?ID=2547\">How to write unmaintainable code</a> article, which appears to have grown considerably since I first saw a version of it back in college.</p>\n\n<p>A simple <a href=\"http://www.google.com/search?q=maintainable+code\">web search</a> can uncover a lot of articles about writing maintainable code.  There have been <a href=\"http://www.amazon.com/s/ref=nb_ss_gw/102-4912607-6304117?url=search-alias%3Daps&amp;field-keywords=maintainable+code&amp;tag=isaacschlcom-20\">several books written on the subject</a>.  And yet, I consistently find that code examples and tutorials, not to mention programming text books, very often break all or most of these rules.</p>\n\n<p>To a certain degree, what makes code “maintainable” is a matter of opinion.  However, it is pretty universally accepted that the vast majority of programmer-hours are spent debugging, fixing, and extending existing code.  It’s very rare, even when working on an entirely new project, that you open up a blank file in your text editor and start coding.  After the first few hours of the first day of a project, you’re working in an existing code ecosystem.  Is it a crazy jungle with vines and savage beasts?  Or a well-lit sidewalk with friendly pedestrians?</p>\n\n<p>I think these assumptions are pretty safe to make for any programmer in any language:</p>\n\n<ol><li>At least 80% of a programmer’s time is spent working with an existing code base (possibly one they just created).</li>\n    <li>Debugging code is more difficult than writing it. (Or, problems are harder to fix than to create.)</li>\n    <li>Extending code (adding features) is the riskiest thing that you can do (bug-wise.)</li>\n</ol><p>Nevertheless, no matter what code you’re working on, every programmer faces these demands:</p>\n\n<ol><li>Management allocates more time for development than for maintenance. (Usually <strong>after</strong> asking us for insight!)</li>\n    <li>Maintenance is sloughed off onto the least experienced developer in the team.</li>\n    <li>The existing feature set is looked at as a “base,” and new features are requested constantly.</li>\n</ol><p>It is thus impossible to overestimate the importance of writing code that is as easy as possible to fix, extend, and reconfigure, even if the person doing the fixing or extending has never seen the code before.  (Or, as is perhaps more common, was the code’s original author, but has forgotten what they were originally thinking when they wrote it.)  If you are a programmer or manager of programmers, look at it this way: at least 80% of your development budget depends on the maintainability of the code that you and your team produce.  The techniques that create maintainable code are mostly free, but not using them costs you big time.</p>\n\n<p>As a web developer, I tend to have a somewhat extended view of product lifetimes.  There is still code on the internet from 1993, and that was back when we didn’t know what we were doing.  Now that we’ve got all this experience, we should expect that the code we write will be around even longer.  The programmer who gets to maintain your code might not have been born yet.  Be kind to that poor soul.</p>\n\n<p>These are the tips that I think are the most important contributors to writing maintainable code.  It’s a matter of opinion, to a certain extent, and there’s plenty of disagreement, so take this for what it’s worth.  Feedback is, of course, always welcome.</p>\n\n<!--more-->\n\n<h3>1. Don’t be clever</h3>\n\n<p>We already know you’re smart; prove it by writing code that monkeys can understand.  Programming should be approached like a haiku, not a riddle.  Make it simple, and don’t make me have to think hard when I come by years later to fix or change or add something.</p>\n\n<p><a href=\"http://en.wikiquote.org/wiki/Brian_W._Kernighan\">Brian W. Kernighan</a> famously said, “<q>Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.</q>”  Try to find the balance between hard-coded and over-engineered.</p>\n\n<h3>2. Think clearly.</h3>\n\n<p>You can’t teach someone to think in an organized fashion.  The best that you can do is find someone who does this already and convince them that they should do it when they write code.  Create objects that make sense for the task at hand.</p>\n\n<p>That makes it easy to:</p>\n\n<h3>3. Let the code describe itself</h3>\n\n<p>Comment your code, yes, yes, you hear it all the time. But don’t write comments that say <em>how</em> something is done.  Write comments that say <em>why</em>, and let the code speak for itself.  The only thing worse than this:</p>\n\n<p><code class=\"block\">// increment i by 1\ni += 1;</code></p>\n\n<p>is this:</p>\n\n<p><code class=\"block\">// increment i by 1\ni += 2;</code></p>\n\n<p>When you write comments that describe how instead of describing why, over time you inevitably end up with comments that lie, because code is much more likely to change than comments.  Let the code say what it does.  You just have to say why it does what it does.</p>\n\n<h3>4. Hungarian notation is eviler than eval</h3>\n\n<p>I sometimes think that Hungarian Notation was surely developed by some kind of mad scientist with an extreme hatred of maintenance programmers*.  It’s almost never consistent, it’s hard to read, and it puts information where it doesn’t belong.  It is a profoundly flagrant violation of the rule that comments should say why and not what.</p>\n\n<p>Consider the basic case of “iCnt” for an integer counter, or ‘sType’ as a string, or 'oElement’ as an object.  If your code is so convoluted that a maintenance programmer doesn’t know that your counter is an integer, or that the element reference is an object, or that “type” is a string, well, there’s something deeply wrong with either your code or your hiring process.</p>\n\n<p>Avoid Hungarian notation like the plague.</p>\n\n<p><small>* This is a joke.  I’m sure it was actually developed by very well-meaning programmers who were honestly trying to address this problem.  Nonetheless, it’s a very bad solution that tends to compound the problem significantly.</small></p>\n\n<h3>5. Small pieces, loosely coupled</h3>\n\n<p>A lot of maintenance checklists and lint programs instruct at the expression or syntax level.  However, arguably the most important key to creating maintainable code is to build small pieces that interact with one another in loosely coupled ways.  This minimizes dependencies, reduces the amount of code that you have to write and maintain, and makes extension and re-use much simpler.</p>\n\n<p>Less code is almost always better.  Instead of having 1 object that implements 10 features, it’s often better to have 10 small objects that implement one feature each, and just listen for and respond to the events that they need.  Using a <a href=\"http://developer.yahoo.com/yui/event/#customevent\">good event utility</a>, this is an extremely powerful pattern for user interface code, especially.  Widget-A just listens to an event from widget-B; when that event fires, it does its thing.  If the event never fires, then widget-A never gets activated.  This means that you can remove or change widget-B without fearing that you’re going to cause massive regressions.</p>\n\n<p><a href=\"http://codinghorror.com\">Coding Horror</a> is one of my daily reads.  If you don’t read it, you should.  Jeff Atwood put it quite well when he exhorted developers to <a href=\"http://www.codinghorror.com/blog/archives/000791.html\">Code Smaller</a>.  They he later <a href=\"http://www.codinghorror.com/blog/archives/000878.html\">wrote that the best code is no code at all</a>.  I couldn’t agree more.</p>\n\n<h3>6. Use OO (and other patterns) Wisely</h3>\n\n<p>Object Oriented programming <em>can</em> help you follow these rules.  But, not everything <em>has</em> to inherit from something else.  There is such a thing as over-engineering.  “Silver bullets” approaches are common causes of this problem.</p>\n\n<p>Use an Object Oriented approach that makes sense.  Most of the time, in my experience, inheritance is not the best approach, unless you’re going to have a lot of types of things, where the types have a lot in common.  This means that you’re dealing with a huge number of objects, which is not the case in most applications.  Again, <em>most of the time</em>, “has-a” approaches are much simpler and more flexible than “is-a” approaches.</p>\n\n<p>Think of it with a real-world example.  “Sandwich” doesn’t inherit from “bread”.  You wouldn’t say, “a sandwich <em>is a</em> type of bread that has stuff inside.”  This might, arguably, be true.  But, the way that most people talk (and more importantly, how we think,) is that a sandwich is a “thing” that <em>has</em> bread with stuff inside.  Furthermore, a waiter is not a sandwich with legs; a waiter is a person who <em>has a</em> sandwich and brings it to you.  Since said waiter may also have a second job as an actor, it’s not even right to say that the “waiter” class inherits from “person.”  A waiter is not a type of person, it’s a person who <em>has a</em> job delivering food to tables.</p>\n\n<p>Some languages implement multiple inheritance and other things that seek to address the “multiple hats” problem using classic OO techniques.  If you ask me, don’t buck the epistemological trends—use the methodology that we use for everything else, and extend using has-a instead of is-a.</p>\n\n<h3>7. Be harsh on the code, gentle on the coder</h3>\n\n<p>We’re all human.  We make mistakes.  Even the best of us violate the rules sometimes, and most of us, by definition, are not “the best of us.”  However, there is no excuse for bad code.  It should be killed on sight.  Be your own harshest critic, and never shy away from criticism.  Seek it out.  Turn to your coworkers and say, “Hm. You know, this thing I’m working on just seems like I’m making it too convoluted.  Can I run my approach by you and see if I’m over-thinking this?”</p>\n\n<p>Give honest criticism without any hesitation, but never <em>ever</em> say, imply, or even <em>think</em> that the programmer must have been dense.  Sure, maybe the programmer really <em>was</em> dense.  But if you’re growing as a developer, hell, as a person, then you should think the same thing about the stuff you did last year.  Nothing is more humbling than having to support your own code a year later.  Pepper your criticism with a light-hearted attitude, and be generous in praising the parts that you think are good.  Keep your venting to yourself.  It will raise your status if you help someone else succeed; tearing down just hurts us all.</p>\n\n<p>Sure, this might be good advice, obvious, even.  But how does it help make maintainable code?  By fostering positivity, you’ll help create an atmosphere where bad code is not tolerated, but where everyone is encouraged to grow and experiment.  The best way to avoid bad code is to make the programmers better.</p>\n\n<p>I personally think that a few interpersonal communication classes would be a good addition to any computer science curriculum.</p>\n\n<h3>8. Fail</h3>\n\n<p>You won’t be able to create resilient systems unless you know how they’ll break.  You won’t know how they’ll break until they do.</p>\n\n<p>Failure is a prerequisite for success.  So, get ready to do it.  A lot.  I’ve written LOTS of very bad code.  (Some of it is even here on this website!)  Plan for an alpha and beta.  Do them as fast as possible. Bang on them.  Then throw them out and start over, taking what you learned into the next version.</p>\n\n<p>Share your failure.  Have a code review session where everyone brings in the worst code that they’ve written for the project, and solicits ideas for what went wrong.  (It’s kind of like an AA meeting: Hi, my name is Isaac, and I wrote bad code. <em>Hello, Isaac…</em>.)</p>\n\n<p>It’s so often these days, especially in big corporations with lots of different teams, for each team to share their successes loudly, but sweep their failure under the rug.  We’re all afraid of getting a bad review, but this virtually guarantees that all the <em>other</em> teams will fail in exactly the same way.  Even in a small company with only one or two teams, sharing failure can result in an exponential reduction in errors.</p>\n\n<p>Furthermore, sharing your own failures, and asking for criticism, makes it easier for others to take criticism when you point out bad code that they wrote.  It is very difficult to separate “me” from “my code”.  If you criticize one, the other might get hurt.  Sharing failure helps to sever this connection, and allows everyone to associate and connect with the success of the product as a whole.</p>\n\n<p>Building a few prototype/failure builds into your development process will also help to produce stable builds faster.  It allows for user-research sooner.  By planning a throw-away build, it helps get everyone focused on which features are actually important/necessary, and which are either too difficult or unimportant to bother building.  It gets product and engineering talking sooner.</p>\n\n<p>Failure (and handling it intelligently) is not just important, it’s absolutely <em>vital</em> when it comes to building systems that are going to stick around for decades.</p>",
        "tree_html": ""
    },
    "reblog_key": "7A2mheUn",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWy8lWSE",
    "slug": "the-most-important-things-they-dont-teach-in",
    "state": "published",
    "summary": "The Most Important Things They Don’t Teach in CompSci 101 (but should): Maintainability",
    "tags": [
        "Code Beauty",
        "Code Ecosystems"
    ],
    "timestamp": 1180841224,
    "title": "The Most Important Things They Don’t Teach in CompSci 101 (but should): Maintainability",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p>I stumbled across a <a href=\"http://www.ibm.com/developerworks/linux/library/l-clear-code/?ca=dgr-FClnxw01linuxcodetips\">great article about clean code</a> from Jeff Vogel over at the IBM Developerworks blog site, via a <a href=\"http://developers.slashdot.org/article.pl?sid=07/05/30/1813247&amp;from=rss\">/. article</a>.  Even more valuable was the <a href=\"http://www.freevbcode.com/ShowCode.Asp?ID=2547\">How to write unmaintainable code</a> article, which appears to have grown considerably since I first saw a version of it back in college.</p>\n\n<p>A simple <a href=\"http://www.google.com/search?q=maintainable+code\">web search</a> can uncover a lot of articles about writing maintainable code.  There have been <a href=\"http://www.amazon.com/s/ref=nb_ss_gw/102-4912607-6304117?url=search-alias%3Daps&amp;field-keywords=maintainable+code&amp;tag=isaacschlcom-20\">several books written on the subject</a>.  And yet, I consistently find that code examples and tutorials, not to mention programming text books, very often break all or most of these rules.</p>\n\n<p>To a certain degree, what makes code &ldquo;maintainable&rdquo; is a matter of opinion.  However, it is pretty universally accepted that the vast majority of programmer-hours are spent debugging, fixing, and extending existing code.  It&rsquo;s very rare, even when working on an entirely new project, that you open up a blank file in your text editor and start coding.  After the first few hours of the first day of a project, you&rsquo;re working in an existing code ecosystem.  Is it a crazy jungle with vines and savage beasts?  Or a well-lit sidewalk with friendly pedestrians?</p>\n\n<p>I think these assumptions are pretty safe to make for any programmer in any language:</p>\n\n<ol><li>At least 80% of a programmer&rsquo;s time is spent working with an existing code base (possibly one they just created).</li>\n    <li>Debugging code is more difficult than writing it. (Or, problems are harder to fix than to create.)</li>\n    <li>Extending code (adding features) is the riskiest thing that you can do (bug-wise.)</li>\n</ol><p>Nevertheless, no matter what code you&rsquo;re working on, every programmer faces these demands:</p>\n\n<ol><li>Management allocates more time for development than for maintenance. (Usually <strong>after</strong> asking us for insight!)</li>\n    <li>Maintenance is sloughed off onto the least experienced developer in the team.</li>\n    <li>The existing feature set is looked at as a &ldquo;base,&rdquo; and new features are requested constantly.</li>\n</ol><p>It is thus impossible to overestimate the importance of writing code that is as easy as possible to fix, extend, and reconfigure, even if the person doing the fixing or extending has never seen the code before.  (Or, as is perhaps more common, was the code&rsquo;s original author, but has forgotten what they were originally thinking when they wrote it.)  If you are a programmer or manager of programmers, look at it this way: at least 80% of your development budget depends on the maintainability of the code that you and your team produce.  The techniques that create maintainable code are mostly free, but not using them costs you big time.</p>\n\n<p>As a web developer, I tend to have a somewhat extended view of product lifetimes.  There is still code on the internet from 1993, and that was back when we didn&rsquo;t know what we were doing.  Now that we&rsquo;ve got all this experience, we should expect that the code we write will be around even longer.  The programmer who gets to maintain your code might not have been born yet.  Be kind to that poor soul.</p>\n\n<p>These are the tips that I think are the most important contributors to writing maintainable code.  It&rsquo;s a matter of opinion, to a certain extent, and there&rsquo;s plenty of disagreement, so take this for what it&rsquo;s worth.  Feedback is, of course, always welcome.</p>\n\n\n\n<h3>1. Don&rsquo;t be clever</h3>\n\n<p>We already know you&rsquo;re smart; prove it by writing code that monkeys can understand.  Programming should be approached like a haiku, not a riddle.  Make it simple, and don&rsquo;t make me have to think hard when I come by years later to fix or change or add something.</p>\n\n<p><a href=\"http://en.wikiquote.org/wiki/Brian_W._Kernighan\">Brian W. Kernighan</a> famously said, &ldquo;Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.&rdquo;  Try to find the balance between hard-coded and over-engineered.</p>\n\n<h3>2. Think clearly.</h3>\n\n<p>You can&rsquo;t teach someone to think in an organized fashion.  The best that you can do is find someone who does this already and convince them that they should do it when they write code.  Create objects that make sense for the task at hand.</p>\n\n<p>That makes it easy to:</p>\n\n<h3>3. Let the code describe itself</h3>\n\n<p>Comment your code, yes, yes, you hear it all the time. But don&rsquo;t write comments that say <em>how</em> something is done.  Write comments that say <em>why</em>, and let the code speak for itself.  The only thing worse than this:</p>\n\n<p><code>// increment i by 1\ni += 1;</code></p>\n\n<p>is this:</p>\n\n<p><code>// increment i by 1\ni += 2;</code></p>\n\n<p>When you write comments that describe how instead of describing why, over time you inevitably end up with comments that lie, because code is much more likely to change than comments.  Let the code say what it does.  You just have to say why it does what it does.</p>\n\n<h3>4. Hungarian notation is eviler than eval</h3>\n\n<p>I sometimes think that Hungarian Notation was surely developed by some kind of mad scientist with an extreme hatred of maintenance programmers*.  It&rsquo;s almost never consistent, it&rsquo;s hard to read, and it puts information where it doesn&rsquo;t belong.  It is a profoundly flagrant violation of the rule that comments should say why and not what.</p>\n\n<p>Consider the basic case of &ldquo;iCnt&rdquo; for an integer counter, or &lsquo;sType&rsquo; as a string, or 'oElement&rsquo; as an object.  If your code is so convoluted that a maintenance programmer doesn&rsquo;t know that your counter is an integer, or that the element reference is an object, or that &ldquo;type&rdquo; is a string, well, there&rsquo;s something deeply wrong with either your code or your hiring process.</p>\n\n<p>Avoid Hungarian notation like the plague.</p>\n\n<p><small>* This is a joke.  I&rsquo;m sure it was actually developed by very well-meaning programmers who were honestly trying to address this problem.  Nonetheless, it&rsquo;s a very bad solution that tends to compound the problem significantly.</small></p>\n\n<h3>5. Small pieces, loosely coupled</h3>\n\n<p>A lot of maintenance checklists and lint programs instruct at the expression or syntax level.  However, arguably the most important key to creating maintainable code is to build small pieces that interact with one another in loosely coupled ways.  This minimizes dependencies, reduces the amount of code that you have to write and maintain, and makes extension and re-use much simpler.</p>\n\n<p>Less code is almost always better.  Instead of having 1 object that implements 10 features, it&rsquo;s often better to have 10 small objects that implement one feature each, and just listen for and respond to the events that they need.  Using a <a href=\"http://developer.yahoo.com/yui/event/#customevent\">good event utility</a>, this is an extremely powerful pattern for user interface code, especially.  Widget-A just listens to an event from widget-B; when that event fires, it does its thing.  If the event never fires, then widget-A never gets activated.  This means that you can remove or change widget-B without fearing that you&rsquo;re going to cause massive regressions.</p>\n\n<p><a href=\"http://codinghorror.com\">Coding Horror</a> is one of my daily reads.  If you don&rsquo;t read it, you should.  Jeff Atwood put it quite well when he exhorted developers to <a href=\"http://www.codinghorror.com/blog/archives/000791.html\">Code Smaller</a>.  They he later <a href=\"http://www.codinghorror.com/blog/archives/000878.html\">wrote that the best code is no code at all</a>.  I couldn&rsquo;t agree more.</p>\n\n<h3>6. Use OO (and other patterns) Wisely</h3>\n\n<p>Object Oriented programming <em>can</em> help you follow these rules.  But, not everything <em>has</em> to inherit from something else.  There is such a thing as over-engineering.  &ldquo;Silver bullets&rdquo; approaches are common causes of this problem.</p>\n\n<p>Use an Object Oriented approach that makes sense.  Most of the time, in my experience, inheritance is not the best approach, unless you&rsquo;re going to have a lot of types of things, where the types have a lot in common.  This means that you&rsquo;re dealing with a huge number of objects, which is not the case in most applications.  Again, <em>most of the time</em>, &ldquo;has-a&rdquo; approaches are much simpler and more flexible than &ldquo;is-a&rdquo; approaches.</p>\n\n<p>Think of it with a real-world example.  &ldquo;Sandwich&rdquo; doesn&rsquo;t inherit from &ldquo;bread&rdquo;.  You wouldn&rsquo;t say, &ldquo;a sandwich <em>is a</em> type of bread that has stuff inside.&rdquo;  This might, arguably, be true.  But, the way that most people talk (and more importantly, how we think,) is that a sandwich is a &ldquo;thing&rdquo; that <em>has</em> bread with stuff inside.  Furthermore, a waiter is not a sandwich with legs; a waiter is a person who <em>has a</em> sandwich and brings it to you.  Since said waiter may also have a second job as an actor, it&rsquo;s not even right to say that the &ldquo;waiter&rdquo; class inherits from &ldquo;person.&rdquo;  A waiter is not a type of person, it&rsquo;s a person who <em>has a</em> job delivering food to tables.</p>\n\n<p>Some languages implement multiple inheritance and other things that seek to address the &ldquo;multiple hats&rdquo; problem using classic OO techniques.  If you ask me, don&rsquo;t buck the epistemological trends&mdash;use the methodology that we use for everything else, and extend using has-a instead of is-a.</p>\n\n<h3>7. Be harsh on the code, gentle on the coder</h3>\n\n<p>We&rsquo;re all human.  We make mistakes.  Even the best of us violate the rules sometimes, and most of us, by definition, are not &ldquo;the best of us.&rdquo;  However, there is no excuse for bad code.  It should be killed on sight.  Be your own harshest critic, and never shy away from criticism.  Seek it out.  Turn to your coworkers and say, &ldquo;Hm. You know, this thing I&rsquo;m working on just seems like I&rsquo;m making it too convoluted.  Can I run my approach by you and see if I&rsquo;m over-thinking this?&rdquo;</p>\n\n<p>Give honest criticism without any hesitation, but never <em>ever</em> say, imply, or even <em>think</em> that the programmer must have been dense.  Sure, maybe the programmer really <em>was</em> dense.  But if you&rsquo;re growing as a developer, hell, as a person, then you should think the same thing about the stuff you did last year.  Nothing is more humbling than having to support your own code a year later.  Pepper your criticism with a light-hearted attitude, and be generous in praising the parts that you think are good.  Keep your venting to yourself.  It will raise your status if you help someone else succeed; tearing down just hurts us all.</p>\n\n<p>Sure, this might be good advice, obvious, even.  But how does it help make maintainable code?  By fostering positivity, you&rsquo;ll help create an atmosphere where bad code is not tolerated, but where everyone is encouraged to grow and experiment.  The best way to avoid bad code is to make the programmers better.</p>\n\n<p>I personally think that a few interpersonal communication classes would be a good addition to any computer science curriculum.</p>\n\n<h3>8. Fail</h3>\n\n<p>You won&rsquo;t be able to create resilient systems unless you know how they&rsquo;ll break.  You won&rsquo;t know how they&rsquo;ll break until they do.</p>\n\n<p>Failure is a prerequisite for success.  So, get ready to do it.  A lot.  I&rsquo;ve written LOTS of very bad code.  (Some of it is even here on this website!)  Plan for an alpha and beta.  Do them as fast as possible. Bang on them.  Then throw them out and start over, taking what you learned into the next version.</p>\n\n<p>Share your failure.  Have a code review session where everyone brings in the worst code that they&rsquo;ve written for the project, and solicits ideas for what went wrong.  (It&rsquo;s kind of like an AA meeting: Hi, my name is Isaac, and I wrote bad code. <em>Hello, Isaac&hellip;</em>.)</p>\n\n<p>It&rsquo;s so often these days, especially in big corporations with lots of different teams, for each team to share their successes loudly, but sweep their failure under the rug.  We&rsquo;re all afraid of getting a bad review, but this virtually guarantees that all the <em>other</em> teams will fail in exactly the same way.  Even in a small company with only one or two teams, sharing failure can result in an exponential reduction in errors.</p>\n\n<p>Furthermore, sharing your own failures, and asking for criticism, makes it easier for others to take criticism when you point out bad code that they wrote.  It is very difficult to separate &ldquo;me&rdquo; from &ldquo;my code&rdquo;.  If you criticize one, the other might get hurt.  Sharing failure helps to sever this connection, and allows everyone to associate and connect with the success of the product as a whole.</p>\n\n<p>Building a few prototype/failure builds into your development process will also help to produce stable builds faster.  It allows for user-research sooner.  By planning a throw-away build, it helps get everyone focused on which features are actually important/necessary, and which are either too difficult or unimportant to bother building.  It gets product and engineering talking sooner.</p>\n\n<p>Failure (and handling it intelligently) is not just important, it&rsquo;s absolutely <em>vital</em> when it comes to building systems that are going to stick around for decades.</p>",
            "content_raw": "<p>I stumbled across a <a href=\"http://www.ibm.com/developerworks/linux/library/l-clear-code/?ca=dgr-FClnxw01linuxcodetips\">great article about clean code</a> from Jeff Vogel over at the IBM Developerworks blog site, via a <a href=\"http://developers.slashdot.org/article.pl?sid=07/05/30/1813247&amp;from=rss\">/. article</a>.  Even more valuable was the <a href=\"http://www.freevbcode.com/ShowCode.Asp?ID=2547\">How to write unmaintainable code</a> article, which appears to have grown considerably since I first saw a version of it back in college.</p>\n\n<p>A simple <a href=\"http://www.google.com/search?q=maintainable+code\">web search</a> can uncover a lot of articles about writing maintainable code.  There have been <a href=\"http://www.amazon.com/s/ref=nb_ss_gw/102-4912607-6304117?url=search-alias%3Daps&amp;field-keywords=maintainable+code&amp;tag=isaacschlcom-20\">several books written on the subject</a>.  And yet, I consistently find that code examples and tutorials, not to mention programming text books, very often break all or most of these rules.</p>\n\n<p>To a certain degree, what makes code “maintainable” is a matter of opinion.  However, it is pretty universally accepted that the vast majority of programmer-hours are spent debugging, fixing, and extending existing code.  It’s very rare, even when working on an entirely new project, that you open up a blank file in your text editor and start coding.  After the first few hours of the first day of a project, you’re working in an existing code ecosystem.  Is it a crazy jungle with vines and savage beasts?  Or a well-lit sidewalk with friendly pedestrians?</p>\n\n<p>I think these assumptions are pretty safe to make for any programmer in any language:</p>\n\n<ol><li>At least 80% of a programmer’s time is spent working with an existing code base (possibly one they just created).</li>\n    <li>Debugging code is more difficult than writing it. (Or, problems are harder to fix than to create.)</li>\n    <li>Extending code (adding features) is the riskiest thing that you can do (bug-wise.)</li>\n</ol><p>Nevertheless, no matter what code you’re working on, every programmer faces these demands:</p>\n\n<ol><li>Management allocates more time for development than for maintenance. (Usually <strong>after</strong> asking us for insight!)</li>\n    <li>Maintenance is sloughed off onto the least experienced developer in the team.</li>\n    <li>The existing feature set is looked at as a “base,” and new features are requested constantly.</li>\n</ol><p>It is thus impossible to overestimate the importance of writing code that is as easy as possible to fix, extend, and reconfigure, even if the person doing the fixing or extending has never seen the code before.  (Or, as is perhaps more common, was the code’s original author, but has forgotten what they were originally thinking when they wrote it.)  If you are a programmer or manager of programmers, look at it this way: at least 80% of your development budget depends on the maintainability of the code that you and your team produce.  The techniques that create maintainable code are mostly free, but not using them costs you big time.</p>\n\n<p>As a web developer, I tend to have a somewhat extended view of product lifetimes.  There is still code on the internet from 1993, and that was back when we didn’t know what we were doing.  Now that we’ve got all this experience, we should expect that the code we write will be around even longer.  The programmer who gets to maintain your code might not have been born yet.  Be kind to that poor soul.</p>\n\n<p>These are the tips that I think are the most important contributors to writing maintainable code.  It’s a matter of opinion, to a certain extent, and there’s plenty of disagreement, so take this for what it’s worth.  Feedback is, of course, always welcome.</p>\n\n<!--more-->\n\n<h3>1. Don’t be clever</h3>\n\n<p>We already know you’re smart; prove it by writing code that monkeys can understand.  Programming should be approached like a haiku, not a riddle.  Make it simple, and don’t make me have to think hard when I come by years later to fix or change or add something.</p>\n\n<p><a href=\"http://en.wikiquote.org/wiki/Brian_W._Kernighan\">Brian W. Kernighan</a> famously said, “<q>Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.</q>”  Try to find the balance between hard-coded and over-engineered.</p>\n\n<h3>2. Think clearly.</h3>\n\n<p>You can’t teach someone to think in an organized fashion.  The best that you can do is find someone who does this already and convince them that they should do it when they write code.  Create objects that make sense for the task at hand.</p>\n\n<p>That makes it easy to:</p>\n\n<h3>3. Let the code describe itself</h3>\n\n<p>Comment your code, yes, yes, you hear it all the time. But don’t write comments that say <em>how</em> something is done.  Write comments that say <em>why</em>, and let the code speak for itself.  The only thing worse than this:</p>\n\n<p><code class=\"block\">// increment i by 1\ni += 1;</code></p>\n\n<p>is this:</p>\n\n<p><code class=\"block\">// increment i by 1\ni += 2;</code></p>\n\n<p>When you write comments that describe how instead of describing why, over time you inevitably end up with comments that lie, because code is much more likely to change than comments.  Let the code say what it does.  You just have to say why it does what it does.</p>\n\n<h3>4. Hungarian notation is eviler than eval</h3>\n\n<p>I sometimes think that Hungarian Notation was surely developed by some kind of mad scientist with an extreme hatred of maintenance programmers*.  It’s almost never consistent, it’s hard to read, and it puts information where it doesn’t belong.  It is a profoundly flagrant violation of the rule that comments should say why and not what.</p>\n\n<p>Consider the basic case of “iCnt” for an integer counter, or ‘sType’ as a string, or 'oElement’ as an object.  If your code is so convoluted that a maintenance programmer doesn’t know that your counter is an integer, or that the element reference is an object, or that “type” is a string, well, there’s something deeply wrong with either your code or your hiring process.</p>\n\n<p>Avoid Hungarian notation like the plague.</p>\n\n<p><small>* This is a joke.  I’m sure it was actually developed by very well-meaning programmers who were honestly trying to address this problem.  Nonetheless, it’s a very bad solution that tends to compound the problem significantly.</small></p>\n\n<h3>5. Small pieces, loosely coupled</h3>\n\n<p>A lot of maintenance checklists and lint programs instruct at the expression or syntax level.  However, arguably the most important key to creating maintainable code is to build small pieces that interact with one another in loosely coupled ways.  This minimizes dependencies, reduces the amount of code that you have to write and maintain, and makes extension and re-use much simpler.</p>\n\n<p>Less code is almost always better.  Instead of having 1 object that implements 10 features, it’s often better to have 10 small objects that implement one feature each, and just listen for and respond to the events that they need.  Using a <a href=\"http://developer.yahoo.com/yui/event/#customevent\">good event utility</a>, this is an extremely powerful pattern for user interface code, especially.  Widget-A just listens to an event from widget-B; when that event fires, it does its thing.  If the event never fires, then widget-A never gets activated.  This means that you can remove or change widget-B without fearing that you’re going to cause massive regressions.</p>\n\n<p><a href=\"http://codinghorror.com\">Coding Horror</a> is one of my daily reads.  If you don’t read it, you should.  Jeff Atwood put it quite well when he exhorted developers to <a href=\"http://www.codinghorror.com/blog/archives/000791.html\">Code Smaller</a>.  They he later <a href=\"http://www.codinghorror.com/blog/archives/000878.html\">wrote that the best code is no code at all</a>.  I couldn’t agree more.</p>\n\n<h3>6. Use OO (and other patterns) Wisely</h3>\n\n<p>Object Oriented programming <em>can</em> help you follow these rules.  But, not everything <em>has</em> to inherit from something else.  There is such a thing as over-engineering.  “Silver bullets” approaches are common causes of this problem.</p>\n\n<p>Use an Object Oriented approach that makes sense.  Most of the time, in my experience, inheritance is not the best approach, unless you’re going to have a lot of types of things, where the types have a lot in common.  This means that you’re dealing with a huge number of objects, which is not the case in most applications.  Again, <em>most of the time</em>, “has-a” approaches are much simpler and more flexible than “is-a” approaches.</p>\n\n<p>Think of it with a real-world example.  “Sandwich” doesn’t inherit from “bread”.  You wouldn’t say, “a sandwich <em>is a</em> type of bread that has stuff inside.”  This might, arguably, be true.  But, the way that most people talk (and more importantly, how we think,) is that a sandwich is a “thing” that <em>has</em> bread with stuff inside.  Furthermore, a waiter is not a sandwich with legs; a waiter is a person who <em>has a</em> sandwich and brings it to you.  Since said waiter may also have a second job as an actor, it’s not even right to say that the “waiter” class inherits from “person.”  A waiter is not a type of person, it’s a person who <em>has a</em> job delivering food to tables.</p>\n\n<p>Some languages implement multiple inheritance and other things that seek to address the “multiple hats” problem using classic OO techniques.  If you ask me, don’t buck the epistemological trends—use the methodology that we use for everything else, and extend using has-a instead of is-a.</p>\n\n<h3>7. Be harsh on the code, gentle on the coder</h3>\n\n<p>We’re all human.  We make mistakes.  Even the best of us violate the rules sometimes, and most of us, by definition, are not “the best of us.”  However, there is no excuse for bad code.  It should be killed on sight.  Be your own harshest critic, and never shy away from criticism.  Seek it out.  Turn to your coworkers and say, “Hm. You know, this thing I’m working on just seems like I’m making it too convoluted.  Can I run my approach by you and see if I’m over-thinking this?”</p>\n\n<p>Give honest criticism without any hesitation, but never <em>ever</em> say, imply, or even <em>think</em> that the programmer must have been dense.  Sure, maybe the programmer really <em>was</em> dense.  But if you’re growing as a developer, hell, as a person, then you should think the same thing about the stuff you did last year.  Nothing is more humbling than having to support your own code a year later.  Pepper your criticism with a light-hearted attitude, and be generous in praising the parts that you think are good.  Keep your venting to yourself.  It will raise your status if you help someone else succeed; tearing down just hurts us all.</p>\n\n<p>Sure, this might be good advice, obvious, even.  But how does it help make maintainable code?  By fostering positivity, you’ll help create an atmosphere where bad code is not tolerated, but where everyone is encouraged to grow and experiment.  The best way to avoid bad code is to make the programmers better.</p>\n\n<p>I personally think that a few interpersonal communication classes would be a good addition to any computer science curriculum.</p>\n\n<h3>8. Fail</h3>\n\n<p>You won’t be able to create resilient systems unless you know how they’ll break.  You won’t know how they’ll break until they do.</p>\n\n<p>Failure is a prerequisite for success.  So, get ready to do it.  A lot.  I’ve written LOTS of very bad code.  (Some of it is even here on this website!)  Plan for an alpha and beta.  Do them as fast as possible. Bang on them.  Then throw them out and start over, taking what you learned into the next version.</p>\n\n<p>Share your failure.  Have a code review session where everyone brings in the worst code that they’ve written for the project, and solicits ideas for what went wrong.  (It’s kind of like an AA meeting: Hi, my name is Isaac, and I wrote bad code. <em>Hello, Isaac…</em>.)</p>\n\n<p>It’s so often these days, especially in big corporations with lots of different teams, for each team to share their successes loudly, but sweep their failure under the rug.  We’re all afraid of getting a bad review, but this virtually guarantees that all the <em>other</em> teams will fail in exactly the same way.  Even in a small company with only one or two teams, sharing failure can result in an exponential reduction in errors.</p>\n\n<p>Furthermore, sharing your own failures, and asking for criticism, makes it easier for others to take criticism when you point out bad code that they wrote.  It is very difficult to separate “me” from “my code”.  If you criticize one, the other might get hurt.  Sharing failure helps to sever this connection, and allows everyone to associate and connect with the success of the product as a whole.</p>\n\n<p>Building a few prototype/failure builds into your development process will also help to produce stable builds faster.  It allows for user-research sooner.  By planning a throw-away build, it helps get everyone focused on which features are actually important/necessary, and which are either too difficult or unimportant to bother building.  It gets product and engineering talking sooner.</p>\n\n<p>Failure (and handling it intelligently) is not just important, it’s absolutely <em>vital</em> when it comes to building systems that are going to stick around for decades.</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "146671374"
            }
        }
    ],
    "type": "text"
}