{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544578035,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>Go read this: <a href=\"http://storify.com/charlesarthur/oh-hai-sexism\">Oh Hai Sexism</a>.  (Aside: I&rsquo;m finding that more and more of the news stories I really like are on <a href=\"http://storify.com\">Storify</a>, which I first heard about as one of the earliest Node.js adopters.  Nice to see them doing well.)</p>\n\n<p>Some of the confusion on the part of bystanders to this flame war was, &ldquo;So, there&rsquo;s a model being objectified in an underwear commercial.  What&rsquo;s the big deal?&rdquo;</p>\n\n<p>However, a <em>very</em> important point here, I think, is that this video was not being used <em>solely</em> to sell underwear, and that&rsquo;s where it started going wrong.</p>\n\n<p>Design Like Whoa is a clothing company.  Clothing companies use models to sell clothing.  Models are chosen for their looks, and they are <em>literally</em> objectified, as part of their job.  They&rsquo;re also consenting, and reasonably well paid.  This method of selling clothes is used by just about every single clothing company, because it works.  I don&rsquo;t think there&rsquo;s a single thing wrong with the video as such, qua underwear commercial, or at least, nothing that isn&rsquo;t <em>also</em> wrong with the whole clothing industry and our irrational ape-brained methods of choosing clothing, but I don&rsquo;t think DLW can be expected to change that.  It&rsquo;s actually relatively un-sexy, compared to other underwear commercials.  <a href=\"http://www.youtube.com/results?search_query=victoria%27s+secret+commercial\">Quid veritas</a></p>\n\n<p>Add to this that Design Like Whoa markets their clothing by putting startup logos on them.  Not a terrible plan, I mean, if it moves clothes, why not, right?  People are passionate about the websites they use.  Lots of companies put various logos on things to sell them by associating with the brand.  <del>Allegedly, Geeklist gave DLW permission to use their logo, and then DLW made the video without Geeklist&rsquo;s involvement, and just happened to choose their branded apparel in the commercial.  I&rsquo;m willing to give them the benefit of the doubt there.</del></p>\n\n<p><i><ins id=\"edit-2012-03-23\">Edit: Geeklist was &ldquo;involved&rdquo; with the making of the video, somewhere between &ldquo;It was all their idea&rdquo; and &ldquo;They asked for photos, and got a video.&rdquo;  It&rsquo;s not very relevant to the points I&rsquo;m trying to make here, so I&rsquo;m not going to go into it any further.  <a href=\"http://designlikewhoa.tumblr.com/post/19791735980/response-to-geeklists-letter-after-reading\">Gemma says this.</a>  Christian disputes (via private email) some of what she wrote, but not all.  There&rsquo;s definitely some room for interpretation.  I&rsquo;m not really interested in the finer points of how this started, as much as where it ended up.  Bottom line: no one intended to offend anyone at the start, but that doesn&rsquo;t actually matter in the end.</ins></i></p>\n\n<p>The problem, however, came about when Geeklist decided to use a women&rsquo;s underwear commercial as a marketing technique for their own product, which is a social networking website for people in technology.</p>\n\n<p>This was the first line crossed.  I hadn&rsquo;t seen that marketing, since I never use geeklist and don&rsquo;t really care about their product except for the fact that it&rsquo;s written in node.  (That&rsquo;s not intended as a slight against Geeklist.  It seems like a fine enough product.  I am just set in my ways.  I use twitter and github and IRC, and that&rsquo;s about the extent of my social networking.  I don&rsquo;t really use Facebook much, either.)  Using a model in underwear to sell underwear is fine.  Using a model in underwear to sell an inclusive social network for technologists?  Sends the wrong message.</p>\n\n<p>So far, in my book, no major harm done.  Doing interesting things means taking risks, and taking risks means sometimes being wrong.  It&rsquo;s important to give people permission to make mistakes, or else nothing interesting happens.  <strong>The trade-off of that permission is the trust that they&rsquo;ll act appropriately when their mistakes are made known to them.</strong></p>\n\n<p><a href=\"https://twitter.com/harthvader/status/182982567220363265\">According to Heather Arthur</a>, at least one private complaint about the video was ignored.</p>\n\n<p>Heather&rsquo;s email should have been taken as a red flag.  Heather is exactly the sort of person that geeklist <em>should</em> be trying to target: She&rsquo;s young, prolific, and very actively involved with several happening developer communities.  She is a paradigm example of Geeklist&rsquo;s money demographic.  Any principles aside, if she felt put off by their marketing, then the marketing is broken, period.</p>\n\n<p>Shanley Kane complained about it publicly on Twitter.  Again, I can&rsquo;t really think of anyone more fitting the ideal Geeklist target demographic.  A product manager and marketeer at Basho (maker of Riak, one of the most relevant nosql databases), and also a Ruby coder and technical hobbyist.  Someone who goes to conferences and <strong>networks with technologists</strong> as her <strong>job</strong>.  Geeklist should be happy to get <em>any</em> feedback from her, and should take it extremely seriously if she&rsquo;s put off by their marketing.  Anything short of a brick through the window should have been accepted gratefully.</p>\n\n<p>This was an opportunity.  There is rarely a case where the right answer is so obvious.  Christian could have replied, &ldquo;Good point. I&rsquo;m on it. We don&rsquo;t own the video, I&rsquo;ll talk to the person who does. No offense was intended. Thanks.&rdquo; and actually walked away from this event perhaps not a hero, but certainly not a villain.</p>\n\n<p>Instead, he got defensive, and took offense at Shanley&rsquo;s &ldquo;insult&rdquo; to his &ldquo;brand&rdquo;.  News flash: you don&rsquo;t get to have a brand, or a project, or a company, or any public anything, without people insulting it.  People say &ldquo;fuck&rdquo; sometimes.  That&rsquo;s just how it works.</p>\n\n<p>From there, it spiraled WAY out of control.  However much Shanley&rsquo;s &ldquo;cursing&rdquo; may have offended geeklist&rsquo;s brand, Reuben&rsquo;s and Christian&rsquo;s response to it was much worse.  The veiled threats about talking to Shanley&rsquo;s employer were just so far beyond what is sensible or appropriate, I am at a loss for words.</p>\n\n<p>There was <a href=\"http://gklst.tumblr.com/post/19734620901/geeklist-and-a-public-apology\">an apology</a>, and the video is now gone, which I guess is good.  But my two worst nopology pet peeves are in there: &ldquo;We apologize <i><b>if</b></i>&hellip;&rdquo;, and justifications for the behavior that they&rsquo;re ostensibly apologizing about.  Don&rsquo;t tell me why I <strong>shouldn&rsquo;t</strong> be offended, and then apologize <strong>if</strong> it was offensive.  Tell me why I <strong>should</strong> be offended, and then apologize <strong>because</strong> it was offensive.</p>\n\n<p>As <a href=\"https://twitter.com/mikeal/status/182984512261734400\">Mikeal put it</a>, &ldquo;apologies that don&rsquo;t contain the words &quot;we fucked up&rdquo; aren&rsquo;t usually genuine.&ldquo;</p>\n\n<p>Put aside your immediate feelings and keep your eye on your choices and their likely results.  This isn&rsquo;t just <em>part</em> of being a grown up, it&rsquo;s basically the <em>definition</em> of being a grown up.  People won&rsquo;t remember that you valiantly defended your brand from the vicious assault of an outraged feminist.  They&rsquo;ll remember that you insulted and intimidated the exact sort of person you&rsquo;re claiming to cater to, and you&rsquo;ll lose their trust.</p>\n\n<p>Can we please go just a few weeks without some insecure startup founder pissing off a huge chunk of the technology community with macho antics?  And, really?  I don&rsquo;t care if you actually are a beer-chugging juggy-hooting misogynistic bro douchebag in the privacy of your own home.  Just please keep it out of twitter, the work place, conferences, and other public forums.  Just temporarily, in public, <em>pretend</em> to be grown ups.  Think about your words, and choose the ones most likely the have the effects you desire.</p>\n\n<p>There are smart talented women going into applied science and fucking <strong>academia</strong> because of you asshats.  Clean up your act.  We need more good programmers, and you&rsquo;re scaring off half of them.</p>\n\n<h2 id=\"addendum-2012-03-23\">Addendum</h2>\n\n<p>Just to clarify, I&rsquo;ve met Christian Sanz numerous times.  He seems like a really nice guy.  It&rsquo;s easy to get swept up in a flamewar and say stupid things, and a lot of us have done so.  They clearly realized much too late that the train was headed for crazy town, and fumbled awkwardly to try to change course.  I&rsquo;m more disappointed than angry about all this.  It&rsquo;s kind of sad, really.</p>\n\n<p>A person is not just one conversation, and a product is not just one person.  My hope is that Geeklist (particularly Christian and Reuben) will learn from this event and let it inform their actions the next time someone criticizes their marketing decisions, rather than be so scared off from the event that they stop taking risks at all.</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2012-03-23 16:40:00 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 19786163075,
    "is_blocks_post_format": false,
    "note_count": 7,
    "post_url": "http://blog.izs.me/post/19786163075/sexism-words-and-marketing",
    "reblog": {
        "comment": "<p>Go read this: <a href=\"http://storify.com/charlesarthur/oh-hai-sexism\">Oh Hai Sexism</a>.  (Aside: I’m finding that more and more of the news stories I really like are on <a href=\"http://storify.com\">Storify</a>, which I first heard about as one of the earliest Node.js adopters.  Nice to see them doing well.)</p>\n\n<p>Some of the confusion on the part of bystanders to this flame war was, “So, there’s a model being objectified in an underwear commercial.  What’s the big deal?”</p>\n\n<p>However, a <em>very</em> important point here, I think, is that this video was not being used <em>solely</em> to sell underwear, and that’s where it started going wrong.</p>\n\n<p>Design Like Whoa is a clothing company.  Clothing companies use models to sell clothing.  Models are chosen for their looks, and they are <em>literally</em> objectified, as part of their job.  They’re also consenting, and reasonably well paid.  This method of selling clothes is used by just about every single clothing company, because it works.  I don’t think there’s a single thing wrong with the video as such, qua underwear commercial, or at least, nothing that isn’t <em>also</em> wrong with the whole clothing industry and our irrational ape-brained methods of choosing clothing, but I don’t think DLW can be expected to change that.  It’s actually relatively un-sexy, compared to other underwear commercials.  <a href=\"http://www.youtube.com/results?search_query=victoria%27s+secret+commercial\">Quid veritas</a></p>\n\n<p>Add to this that Design Like Whoa markets their clothing by putting startup logos on them.  Not a terrible plan, I mean, if it moves clothes, why not, right?  People are passionate about the websites they use.  Lots of companies put various logos on things to sell them by associating with the brand.  <del>Allegedly, Geeklist gave DLW permission to use their logo, and then DLW made the video without Geeklist’s involvement, and just happened to choose their branded apparel in the commercial.  I’m willing to give them the benefit of the doubt there.</del></p>\n\n<p><i><ins id=\"edit-2012-03-23\">Edit: Geeklist was “involved” with the making of the video, somewhere between “It was all their idea” and “They asked for photos, and got a video.”  It’s not very relevant to the points I’m trying to make here, so I’m not going to go into it any further.  <a href=\"http://designlikewhoa.tumblr.com/post/19791735980/response-to-geeklists-letter-after-reading\">Gemma says this.</a>  Christian disputes (via private email) some of what she wrote, but not all.  There’s definitely some room for interpretation.  I’m not really interested in the finer points of how this started, as much as where it ended up.  Bottom line: no one intended to offend anyone at the start, but that doesn’t actually matter in the end.</ins></i></p>\n\n<p>The problem, however, came about when Geeklist decided to use a women’s underwear commercial as a marketing technique for their own product, which is a social networking website for people in technology.</p>\n\n<p>This was the first line crossed.  I hadn’t seen that marketing, since I never use geeklist and don’t really care about their product except for the fact that it’s written in node.  (That’s not intended as a slight against Geeklist.  It seems like a fine enough product.  I am just set in my ways.  I use twitter and github and IRC, and that’s about the extent of my social networking.  I don’t really use Facebook much, either.)  Using a model in underwear to sell underwear is fine.  Using a model in underwear to sell an inclusive social network for technologists?  Sends the wrong message.</p>\n\n<p>So far, in my book, no major harm done.  Doing interesting things means taking risks, and taking risks means sometimes being wrong.  It’s important to give people permission to make mistakes, or else nothing interesting happens.  <strong>The trade-off of that permission is the trust that they’ll act appropriately when their mistakes are made known to them.</strong></p>\n\n<p><a href=\"https://twitter.com/harthvader/status/182982567220363265\">According to Heather Arthur</a>, at least one private complaint about the video was ignored.</p>\n\n<p>Heather’s email should have been taken as a red flag.  Heather is exactly the sort of person that geeklist <em>should</em> be trying to target: She’s young, prolific, and very actively involved with several happening developer communities.  She is a paradigm example of Geeklist’s money demographic.  Any principles aside, if she felt put off by their marketing, then the marketing is broken, period.</p>\n\n<p>Shanley Kane complained about it publicly on Twitter.  Again, I can’t really think of anyone more fitting the ideal Geeklist target demographic.  A product manager and marketeer at Basho (maker of Riak, one of the most relevant nosql databases), and also a Ruby coder and technical hobbyist.  Someone who goes to conferences and <strong>networks with technologists</strong> as her <strong>job</strong>.  Geeklist should be happy to get <em>any</em> feedback from her, and should take it extremely seriously if she’s put off by their marketing.  Anything short of a brick through the window should have been accepted gratefully.</p>\n\n<p>This was an opportunity.  There is rarely a case where the right answer is so obvious.  Christian could have replied, “Good point. I’m on it. We don’t own the video, I’ll talk to the person who does. No offense was intended. Thanks.” and actually walked away from this event perhaps not a hero, but certainly not a villain.</p>\n\n<p>Instead, he got defensive, and took offense at Shanley’s “insult” to his “brand”.  News flash: you don’t get to have a brand, or a project, or a company, or any public anything, without people insulting it.  People say “fuck” sometimes.  That’s just how it works.</p>\n\n<p>From there, it spiraled WAY out of control.  However much Shanley’s “cursing” may have offended geeklist’s brand, Reuben’s and Christian’s response to it was much worse.  The veiled threats about talking to Shanley’s employer were just so far beyond what is sensible or appropriate, I am at a loss for words.</p>\n\n<p>There was <a href=\"http://gklst.tumblr.com/post/19734620901/geeklist-and-a-public-apology\">an apology</a>, and the video is now gone, which I guess is good.  But my two worst nopology pet peeves are in there: “We apologize <i><b>if</b></i>…”, and justifications for the behavior that they’re ostensibly apologizing about.  Don’t tell me why I <strong>shouldn’t</strong> be offended, and then apologize <strong>if</strong> it was offensive.  Tell me why I <strong>should</strong> be offended, and then apologize <strong>because</strong> it was offensive.</p>\n\n<p>As <a href=\"https://twitter.com/mikeal/status/182984512261734400\">Mikeal put it</a>, “apologies that don’t contain the words \"we fucked up” aren’t usually genuine.“</p>\n\n<p>Put aside your immediate feelings and keep your eye on your choices and their likely results.  This isn’t just <em>part</em> of being a grown up, it’s basically the <em>definition</em> of being a grown up.  People won’t remember that you valiantly defended your brand from the vicious assault of an outraged feminist.  They’ll remember that you insulted and intimidated the exact sort of person you’re claiming to cater to, and you’ll lose their trust.</p>\n\n<p>Can we please go just a few weeks without some insecure startup founder pissing off a huge chunk of the technology community with macho antics?  And, really?  I don’t care if you actually are a beer-chugging juggy-hooting misogynistic bro douchebag in the privacy of your own home.  Just please keep it out of twitter, the work place, conferences, and other public forums.  Just temporarily, in public, <em>pretend</em> to be grown ups.  Think about your words, and choose the ones most likely the have the effects you desire.</p>\n\n<p>There are smart talented women going into applied science and fucking <strong>academia</strong> because of you asshats.  Clean up your act.  We need more good programmers, and you’re scaring off half of them.</p>\n\n<h2 id=\"addendum-2012-03-23\">Addendum</h2>\n\n<p>Just to clarify, I’ve met Christian Sanz numerous times.  He seems like a really nice guy.  It’s easy to get swept up in a flamewar and say stupid things, and a lot of us have done so.  They clearly realized much too late that the train was headed for crazy town, and fumbled awkwardly to try to change course.  I’m more disappointed than angry about all this.  It’s kind of sad, really.</p>\n\n<p>A person is not just one conversation, and a product is not just one person.  My hope is that Geeklist (particularly Christian and Reuben) will learn from this event and let it inform their actions the next time someone criticizes their marketing decisions, rather than be so scared off from the event that they stop taking risks at all.</p>",
        "tree_html": ""
    },
    "reblog_key": "xBFtCkPP",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWyIRMEE3",
    "slug": "sexism-words-and-marketing",
    "state": "published",
    "summary": "Sexism, Words, and Marketing",
    "tags": [],
    "timestamp": 1332520800,
    "title": "Sexism, Words, and Marketing",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p>Go read this: <a href=\"http://storify.com/charlesarthur/oh-hai-sexism\">Oh Hai Sexism</a>.  (Aside: I&rsquo;m finding that more and more of the news stories I really like are on <a href=\"http://storify.com\">Storify</a>, which I first heard about as one of the earliest Node.js adopters.  Nice to see them doing well.)</p>\n\n<p>Some of the confusion on the part of bystanders to this flame war was, &ldquo;So, there&rsquo;s a model being objectified in an underwear commercial.  What&rsquo;s the big deal?&rdquo;</p>\n\n<p>However, a <em>very</em> important point here, I think, is that this video was not being used <em>solely</em> to sell underwear, and that&rsquo;s where it started going wrong.</p>\n\n<p>Design Like Whoa is a clothing company.  Clothing companies use models to sell clothing.  Models are chosen for their looks, and they are <em>literally</em> objectified, as part of their job.  They&rsquo;re also consenting, and reasonably well paid.  This method of selling clothes is used by just about every single clothing company, because it works.  I don&rsquo;t think there&rsquo;s a single thing wrong with the video as such, qua underwear commercial, or at least, nothing that isn&rsquo;t <em>also</em> wrong with the whole clothing industry and our irrational ape-brained methods of choosing clothing, but I don&rsquo;t think DLW can be expected to change that.  It&rsquo;s actually relatively un-sexy, compared to other underwear commercials.  <a href=\"http://www.youtube.com/results?search_query=victoria%27s+secret+commercial\">Quid veritas</a></p>\n\n<p>Add to this that Design Like Whoa markets their clothing by putting startup logos on them.  Not a terrible plan, I mean, if it moves clothes, why not, right?  People are passionate about the websites they use.  Lots of companies put various logos on things to sell them by associating with the brand.  <del>Allegedly, Geeklist gave DLW permission to use their logo, and then DLW made the video without Geeklist&rsquo;s involvement, and just happened to choose their branded apparel in the commercial.  I&rsquo;m willing to give them the benefit of the doubt there.</del></p>\n\n<p><i>Edit: Geeklist was &ldquo;involved&rdquo; with the making of the video, somewhere between &ldquo;It was all their idea&rdquo; and &ldquo;They asked for photos, and got a video.&rdquo;  It&rsquo;s not very relevant to the points I&rsquo;m trying to make here, so I&rsquo;m not going to go into it any further.  <a href=\"http://designlikewhoa.tumblr.com/post/19791735980/response-to-geeklists-letter-after-reading\">Gemma says this.</a>  Christian disputes (via private email) some of what she wrote, but not all.  There&rsquo;s definitely some room for interpretation.  I&rsquo;m not really interested in the finer points of how this started, as much as where it ended up.  Bottom line: no one intended to offend anyone at the start, but that doesn&rsquo;t actually matter in the end.</i></p>\n\n<p>The problem, however, came about when Geeklist decided to use a women&rsquo;s underwear commercial as a marketing technique for their own product, which is a social networking website for people in technology.</p>\n\n<p>This was the first line crossed.  I hadn&rsquo;t seen that marketing, since I never use geeklist and don&rsquo;t really care about their product except for the fact that it&rsquo;s written in node.  (That&rsquo;s not intended as a slight against Geeklist.  It seems like a fine enough product.  I am just set in my ways.  I use twitter and github and IRC, and that&rsquo;s about the extent of my social networking.  I don&rsquo;t really use Facebook much, either.)  Using a model in underwear to sell underwear is fine.  Using a model in underwear to sell an inclusive social network for technologists?  Sends the wrong message.</p>\n\n<p>So far, in my book, no major harm done.  Doing interesting things means taking risks, and taking risks means sometimes being wrong.  It&rsquo;s important to give people permission to make mistakes, or else nothing interesting happens.  <strong>The trade-off of that permission is the trust that they&rsquo;ll act appropriately when their mistakes are made known to them.</strong></p>\n\n<p><a href=\"https://twitter.com/harthvader/status/182982567220363265\">According to Heather Arthur</a>, at least one private complaint about the video was ignored.</p>\n\n<p>Heather&rsquo;s email should have been taken as a red flag.  Heather is exactly the sort of person that geeklist <em>should</em> be trying to target: She&rsquo;s young, prolific, and very actively involved with several happening developer communities.  She is a paradigm example of Geeklist&rsquo;s money demographic.  Any principles aside, if she felt put off by their marketing, then the marketing is broken, period.</p>\n\n<p>Shanley Kane complained about it publicly on Twitter.  Again, I can&rsquo;t really think of anyone more fitting the ideal Geeklist target demographic.  A product manager and marketeer at Basho (maker of Riak, one of the most relevant nosql databases), and also a Ruby coder and technical hobbyist.  Someone who goes to conferences and <strong>networks with technologists</strong> as her <strong>job</strong>.  Geeklist should be happy to get <em>any</em> feedback from her, and should take it extremely seriously if she&rsquo;s put off by their marketing.  Anything short of a brick through the window should have been accepted gratefully.</p>\n\n<p>This was an opportunity.  There is rarely a case where the right answer is so obvious.  Christian could have replied, &ldquo;Good point. I&rsquo;m on it. We don&rsquo;t own the video, I&rsquo;ll talk to the person who does. No offense was intended. Thanks.&rdquo; and actually walked away from this event perhaps not a hero, but certainly not a villain.</p>\n\n<p>Instead, he got defensive, and took offense at Shanley&rsquo;s &ldquo;insult&rdquo; to his &ldquo;brand&rdquo;.  News flash: you don&rsquo;t get to have a brand, or a project, or a company, or any public anything, without people insulting it.  People say &ldquo;fuck&rdquo; sometimes.  That&rsquo;s just how it works.</p>\n\n<p>From there, it spiraled WAY out of control.  However much Shanley&rsquo;s &ldquo;cursing&rdquo; may have offended geeklist&rsquo;s brand, Reuben&rsquo;s and Christian&rsquo;s response to it was much worse.  The veiled threats about talking to Shanley&rsquo;s employer were just so far beyond what is sensible or appropriate, I am at a loss for words.</p>\n\n<p>There was <a href=\"http://gklst.tumblr.com/post/19734620901/geeklist-and-a-public-apology\">an apology</a>, and the video is now gone, which I guess is good.  But my two worst nopology pet peeves are in there: &ldquo;We apologize <i><b>if</b></i>&hellip;&rdquo;, and justifications for the behavior that they&rsquo;re ostensibly apologizing about.  Don&rsquo;t tell me why I <strong>shouldn&rsquo;t</strong> be offended, and then apologize <strong>if</strong> it was offensive.  Tell me why I <strong>should</strong> be offended, and then apologize <strong>because</strong> it was offensive.</p>\n\n<p>As <a href=\"https://twitter.com/mikeal/status/182984512261734400\">Mikeal put it</a>, &ldquo;apologies that don&rsquo;t contain the words \"we fucked up&rdquo; aren&rsquo;t usually genuine.&ldquo;</p>\n\n<p>Put aside your immediate feelings and keep your eye on your choices and their likely results.  This isn&rsquo;t just <em>part</em> of being a grown up, it&rsquo;s basically the <em>definition</em> of being a grown up.  People won&rsquo;t remember that you valiantly defended your brand from the vicious assault of an outraged feminist.  They&rsquo;ll remember that you insulted and intimidated the exact sort of person you&rsquo;re claiming to cater to, and you&rsquo;ll lose their trust.</p>\n\n<p>Can we please go just a few weeks without some insecure startup founder pissing off a huge chunk of the technology community with macho antics?  And, really?  I don&rsquo;t care if you actually are a beer-chugging juggy-hooting misogynistic bro douchebag in the privacy of your own home.  Just please keep it out of twitter, the work place, conferences, and other public forums.  Just temporarily, in public, <em>pretend</em> to be grown ups.  Think about your words, and choose the ones most likely the have the effects you desire.</p>\n\n<p>There are smart talented women going into applied science and fucking <strong>academia</strong> because of you asshats.  Clean up your act.  We need more good programmers, and you&rsquo;re scaring off half of them.</p>\n\n<h2>Addendum</h2>\n\n<p>Just to clarify, I&rsquo;ve met Christian Sanz numerous times.  He seems like a really nice guy.  It&rsquo;s easy to get swept up in a flamewar and say stupid things, and a lot of us have done so.  They clearly realized much too late that the train was headed for crazy town, and fumbled awkwardly to try to change course.  I&rsquo;m more disappointed than angry about all this.  It&rsquo;s kind of sad, really.</p>\n\n<p>A person is not just one conversation, and a product is not just one person.  My hope is that Geeklist (particularly Christian and Reuben) will learn from this event and let it inform their actions the next time someone criticizes their marketing decisions, rather than be so scared off from the event that they stop taking risks at all.</p>",
            "content_raw": "<p>Go read this: <a href=\"http://storify.com/charlesarthur/oh-hai-sexism\">Oh Hai Sexism</a>.  (Aside: I’m finding that more and more of the news stories I really like are on <a href=\"http://storify.com\">Storify</a>, which I first heard about as one of the earliest Node.js adopters.  Nice to see them doing well.)</p>\n\n<p>Some of the confusion on the part of bystanders to this flame war was, “So, there’s a model being objectified in an underwear commercial.  What’s the big deal?”</p>\n\n<p>However, a <em>very</em> important point here, I think, is that this video was not being used <em>solely</em> to sell underwear, and that’s where it started going wrong.</p>\n\n<p>Design Like Whoa is a clothing company.  Clothing companies use models to sell clothing.  Models are chosen for their looks, and they are <em>literally</em> objectified, as part of their job.  They’re also consenting, and reasonably well paid.  This method of selling clothes is used by just about every single clothing company, because it works.  I don’t think there’s a single thing wrong with the video as such, qua underwear commercial, or at least, nothing that isn’t <em>also</em> wrong with the whole clothing industry and our irrational ape-brained methods of choosing clothing, but I don’t think DLW can be expected to change that.  It’s actually relatively un-sexy, compared to other underwear commercials.  <a href=\"http://www.youtube.com/results?search_query=victoria%27s+secret+commercial\">Quid veritas</a></p>\n\n<p>Add to this that Design Like Whoa markets their clothing by putting startup logos on them.  Not a terrible plan, I mean, if it moves clothes, why not, right?  People are passionate about the websites they use.  Lots of companies put various logos on things to sell them by associating with the brand.  <del>Allegedly, Geeklist gave DLW permission to use their logo, and then DLW made the video without Geeklist’s involvement, and just happened to choose their branded apparel in the commercial.  I’m willing to give them the benefit of the doubt there.</del></p>\n\n<p><i><ins id=\"edit-2012-03-23\">Edit: Geeklist was “involved” with the making of the video, somewhere between “It was all their idea” and “They asked for photos, and got a video.”  It’s not very relevant to the points I’m trying to make here, so I’m not going to go into it any further.  <a href=\"http://designlikewhoa.tumblr.com/post/19791735980/response-to-geeklists-letter-after-reading\">Gemma says this.</a>  Christian disputes (via private email) some of what she wrote, but not all.  There’s definitely some room for interpretation.  I’m not really interested in the finer points of how this started, as much as where it ended up.  Bottom line: no one intended to offend anyone at the start, but that doesn’t actually matter in the end.</ins></i></p>\n\n<p>The problem, however, came about when Geeklist decided to use a women’s underwear commercial as a marketing technique for their own product, which is a social networking website for people in technology.</p>\n\n<p>This was the first line crossed.  I hadn’t seen that marketing, since I never use geeklist and don’t really care about their product except for the fact that it’s written in node.  (That’s not intended as a slight against Geeklist.  It seems like a fine enough product.  I am just set in my ways.  I use twitter and github and IRC, and that’s about the extent of my social networking.  I don’t really use Facebook much, either.)  Using a model in underwear to sell underwear is fine.  Using a model in underwear to sell an inclusive social network for technologists?  Sends the wrong message.</p>\n\n<p>So far, in my book, no major harm done.  Doing interesting things means taking risks, and taking risks means sometimes being wrong.  It’s important to give people permission to make mistakes, or else nothing interesting happens.  <strong>The trade-off of that permission is the trust that they’ll act appropriately when their mistakes are made known to them.</strong></p>\n\n<p><a href=\"https://twitter.com/harthvader/status/182982567220363265\">According to Heather Arthur</a>, at least one private complaint about the video was ignored.</p>\n\n<p>Heather’s email should have been taken as a red flag.  Heather is exactly the sort of person that geeklist <em>should</em> be trying to target: She’s young, prolific, and very actively involved with several happening developer communities.  She is a paradigm example of Geeklist’s money demographic.  Any principles aside, if she felt put off by their marketing, then the marketing is broken, period.</p>\n\n<p>Shanley Kane complained about it publicly on Twitter.  Again, I can’t really think of anyone more fitting the ideal Geeklist target demographic.  A product manager and marketeer at Basho (maker of Riak, one of the most relevant nosql databases), and also a Ruby coder and technical hobbyist.  Someone who goes to conferences and <strong>networks with technologists</strong> as her <strong>job</strong>.  Geeklist should be happy to get <em>any</em> feedback from her, and should take it extremely seriously if she’s put off by their marketing.  Anything short of a brick through the window should have been accepted gratefully.</p>\n\n<p>This was an opportunity.  There is rarely a case where the right answer is so obvious.  Christian could have replied, “Good point. I’m on it. We don’t own the video, I’ll talk to the person who does. No offense was intended. Thanks.” and actually walked away from this event perhaps not a hero, but certainly not a villain.</p>\n\n<p>Instead, he got defensive, and took offense at Shanley’s “insult” to his “brand”.  News flash: you don’t get to have a brand, or a project, or a company, or any public anything, without people insulting it.  People say “fuck” sometimes.  That’s just how it works.</p>\n\n<p>From there, it spiraled WAY out of control.  However much Shanley’s “cursing” may have offended geeklist’s brand, Reuben’s and Christian’s response to it was much worse.  The veiled threats about talking to Shanley’s employer were just so far beyond what is sensible or appropriate, I am at a loss for words.</p>\n\n<p>There was <a href=\"http://gklst.tumblr.com/post/19734620901/geeklist-and-a-public-apology\">an apology</a>, and the video is now gone, which I guess is good.  But my two worst nopology pet peeves are in there: “We apologize <i><b>if</b></i>…”, and justifications for the behavior that they’re ostensibly apologizing about.  Don’t tell me why I <strong>shouldn’t</strong> be offended, and then apologize <strong>if</strong> it was offensive.  Tell me why I <strong>should</strong> be offended, and then apologize <strong>because</strong> it was offensive.</p>\n\n<p>As <a href=\"https://twitter.com/mikeal/status/182984512261734400\">Mikeal put it</a>, “apologies that don’t contain the words \"we fucked up” aren’t usually genuine.“</p>\n\n<p>Put aside your immediate feelings and keep your eye on your choices and their likely results.  This isn’t just <em>part</em> of being a grown up, it’s basically the <em>definition</em> of being a grown up.  People won’t remember that you valiantly defended your brand from the vicious assault of an outraged feminist.  They’ll remember that you insulted and intimidated the exact sort of person you’re claiming to cater to, and you’ll lose their trust.</p>\n\n<p>Can we please go just a few weeks without some insecure startup founder pissing off a huge chunk of the technology community with macho antics?  And, really?  I don’t care if you actually are a beer-chugging juggy-hooting misogynistic bro douchebag in the privacy of your own home.  Just please keep it out of twitter, the work place, conferences, and other public forums.  Just temporarily, in public, <em>pretend</em> to be grown ups.  Think about your words, and choose the ones most likely the have the effects you desire.</p>\n\n<p>There are smart talented women going into applied science and fucking <strong>academia</strong> because of you asshats.  Clean up your act.  We need more good programmers, and you’re scaring off half of them.</p>\n\n<h2 id=\"addendum-2012-03-23\">Addendum</h2>\n\n<p>Just to clarify, I’ve met Christian Sanz numerous times.  He seems like a really nice guy.  It’s easy to get swept up in a flamewar and say stupid things, and a lot of us have done so.  They clearly realized much too late that the train was headed for crazy town, and fumbled awkwardly to try to change course.  I’m more disappointed than angry about all this.  It’s kind of sad, really.</p>\n\n<p>A person is not just one conversation, and a product is not just one person.  My hope is that Geeklist (particularly Christian and Reuben) will learn from this event and let it inform their actions the next time someone criticizes their marketing decisions, rather than be so scared off from the event that they stop taking risks at all.</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "19786163075"
            }
        }
    ],
    "type": "text"
}