{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544578035,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2010-12-01 18:16:51 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 2061428668,
    "is_blocks_post_format": false,
    "note_count": 10601,
    "post_url": "http://blog.izs.me/post/2061428668/a-three-day-old-human-embryo-is-a-collection-of",
    "reblog": {
        "comment": "<p>Sam Harris, on stem cell research. (via <a href=\"http://cocknbull.tumblr.com/\">cocknbull</a>)</p>",
        "tree_html": ""
    },
    "reblog_key": "phYilrpd",
    "reblogged_from_can_message": true,
    "reblogged_from_id": "2060771995",
    "reblogged_from_name": "jonprins",
    "reblogged_from_title": "Digilog",
    "reblogged_from_url": "http://jonprins.tumblr.com/post/2060771995/a-three-day-old-human-embryo-is-a-collection-of",
    "reblogged_from_uuid": "t:k8jctRjVGbFtr8vmyBqUeg",
    "reblogged_root_can_message": false,
    "reblogged_root_id": "2058313731",
    "reblogged_root_name": "creatowdqwdqqdqown",
    "reblogged_root_title": "Hang in there",
    "reblogged_root_url": "https://creatowdqwdqqdqown.tumblr.com/post/2058313731/a-three-day-old-human-embryo-is-a-collection-of",
    "reblogged_root_uuid": "t:kYNqVhOkFjVMbhdb4mXoRQ",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWy1wtkUy",
    "slug": "a-three-day-old-human-embryo-is-a-collection-of",
    "source": "Sam Harris, on stem cell research. (via <a href=\"http://cocknbull.tumblr.com/\">cocknbull</a>)",
    "state": "published",
    "summary": "A three-day-old human embryo is a collection of 150 cells called a blastocyst. There are, for the sake of comparison, more than...",
    "tags": [],
    "text": "A three-day-old human embryo is a collection of 150 cells called a blastocyst. There are, for the sake of comparison, more than 100,000 cells in the brain of a fly. If our concern is about suffering in this universe, it is rather obvious that we should be more concerned about killing flies than about killing three-day-old human embryos… Many people will argue that the difference between a fly and a three-day-old human embryo is that a three-day-old human embryo is a potential human being. Every cell in your body, given the right manipulations, every cell with a nucleus is now a potential human being. Every time you scratch your nose, you’ve committed a holocaust of potential human beings… Let’s say we grant it that every three-day-old human embryo has a soul worthy of our moral concern. First of all, embryos at this stage can split into identical twins. Is this a case of one soul splitting into two souls? Embryos at this stage can fuse into a chimera. What has happened to the extra human soul in such a case? This is intellectually indefensible, but it’s morally indefensible given that these notions really are prolonging scarcely endurable misery of tens of millions of human beings, and because of the respect we accord religious faith, we can’t have this dialogue in the way that we should. I submit to you that if you think the interests of a three-day-old blastocyst trump the interests of a little girl with spinal cord injuries or a person with full-body burns, your moral intuitions have been obscured by religious metaphysics.",
    "timestamp": 1291227411,
    "type": "quote"
}