{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544051896,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>A resume is an advertisement.  You are selling your time and attention, and trying to get some potential employer (who is a <strong>buyer</strong>, and a potential <strong>customer</strong>) to purchase said time and attention at a competitive price.  Advertisements exist to make someone want something.</p>\n\n<p>Most engineers aren&rsquo;t all that savvy about the subtle art of advertising, and as a result, tend to view a resume as more like a letter than a print ad.  (Or, more like an email than an LRec, for those of you born after the digital revolution.) They learned in High School that the way to write a resume is:</p>\n\n<ol><li>Open up Microsoft Word (or OpenOffice, for the anti M$ types.)</li>\n    <li>Click File &gt; New&hellip;, and then select &ldquo;Resume Wizard&rdquo; as the type of document.</li>\n    <li>Select the style.</li>\n    <li>Enter your demographic and historical information.</li>\n    <li>Spellcheck (or don&rsquo;t), save, email to recruiter or upload to job site.</li>\n</ol><p>They probably also learned that it has to be one page, because recruiters &ldquo;look at a lot of resumes, and don&rsquo;t have time to deal with any that are more than one <em>sheet of paper</em>.&rdquo;</p>\n\n<p>This is a great way to ensure that your resume is completely like every other resume, and also show recruiters and hiring managers that you have a quaint attachment to the historical ways of yestercentury.</p>\n\n<p>A resume is not a letter.  It&rsquo;s not an email.  It&rsquo;s not a friendly chat.  It&rsquo;s an advertisement.  Telling is nice, but showing is better.  If I&rsquo;m buying, I want to know what I&rsquo;m getting.</p>\n\n<p>It&rsquo;s also not a high-school homework assignment.  And if you think &ldquo;oh, advertising isn&rsquo;t my bag, I&rsquo;ll just do what everyone else does,&rdquo; then why should a hiring manager take your career more seriously than you do?</p>\n\n<p>If you&rsquo;re a web developer, then your resume should be an active testament to your skills.  It&rsquo;s not enough to have links to stuff you&rsquo;ve done (although that&rsquo;s important, too.)  It should be in clean semantic HTML, and it should be styled with CSS.  Throw some Javascript in there to do a little something.  Test it in different browsers.  Put it online.  Link to it on your blog.  (You DO have a blog or personal website, don&rsquo;t you?)  This is especially important if you&rsquo;re a bit junior and don&rsquo;t have much of a portfolio yet, or if your portfolio contains a lot of behind-the-curtain intranet or login-only projects.</p>\n\n<p>These things communicate a lot without having to say anything, and the words-behind-the-words are usually what speak loudest.  Putting your resume in HTML that you write from scratch gives a potential employer a very clear view of your ability.  A personal website gives them a view into your personality, lets them hear your voice.  If I&rsquo;m in on the decision to hire someone, a resume built in HTML and CSS is significantly more important than a college degree.  You&rsquo;ve gotta be pretty good for me to vote &ldquo;yes&rdquo; if you wrote your resume in Word.  If you <em>must</em> send a non-HTML resume, send text, and provide the URL to your &ldquo;real&rdquo; resume that&rsquo;s online in HTML.  (The one you post online should have this url in it as well, in case it&rsquo;s downloaded and emailed.)</p>\n\n<p>Now is a great time for web developers.  Our talents are (finally!) starting to get respect as more than just an extension of software development or graphic design.  The dollars are speaking, the audiences are getting bigger, executives and stake holders are beginning to take this medium <em>very</em> seriously.  And, it moves so fast that schools and books can&rsquo;t seem to keep up very well.  If you know your stuff, then now is a great time to be a web developer, but it&rsquo;s only a matter of time before the competition is going to get very tough.  Separate yourself from the pack now.</p>\n\n<p>I recently updated my <a href=\"http://foohack.com/resume/\">resume</a>, since it had gotten rather dated and my skills had increased quite a bit.  I did it as a lark and a time-spending activity while I was high on drugs from oral surgery.  I thought, <q>Hey, ya know what? Let&rsquo;s see what happens if I update this and make the HTML a little more search-engine friendly, add some snazzy styles&hellip;</q>  Oh my god&hellip; I&rsquo;ve gotten at least 2 calls and/or emails per week since then.  I can safely say that I&rsquo;m working at Yahoo today because I truly love it here.</p>\n\n<p>If you are a web developer, and you&rsquo;re not happy with your current job, or even if you are, <em>and you&rsquo;re really <strong>really</strong> good at what you do</em>, create a resume in well-constructed HTML, make it look nice, and put it online.  Link to it on your blog, or in your signature if you participate in any web development-related forums.  You&rsquo;ll be glad you did, and you&rsquo;ll be helping the community of web developers in the long run by helping to keep our craft a highly valued commodity.</p>\n\n<p>Some tips:</p>\n\n<ul><li>It may be downloaded and emailed.  Try, if you can, to put all of your styles and scripts inline, and don&rsquo;t rely too heavily on images, if you use them at all.</li>\n    <li>Spell-check it.</li>\n    <li><strong>Do not plagiarize.</strong> It looks very bad.  If you use a library or a common technique in your code, then cite it, post the license agreement, whatever.  Using a widely-known technique (and citing the source) shows that you&rsquo;re in touch with the greater webdev community.  Stay legal, and be respectful of those who have shared with the community.  Violate this rule with serious risks&mdash;it can even get you fired by your shiny new employer.</li>\n    <li>Make it as long as it needs to be, but keep each piece short.</li>\n    <li>Put education near the bottom.  If you didn&rsquo;t go to college, then don&rsquo;t even put it.  It doesn&rsquo;t matter as much as experience, in this field.</li>\n</ul><p>Recruiters are sharks.  They are mercenaries stop at nothing for the referral bonus.  They scour <abbr title=\"Search Engine Results Pages\">SERPs</abbr> 50 pages deep looking for fresh meat.  They read web development blogs and forums looking for the gurus.  They will find you if you let them.</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2007-06-20 17:00:05 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 146671514,
    "is_blocks_post_format": false,
    "note_count": 0,
    "post_url": "http://blog.izs.me/post/146671514/the-art-of-the-resume-why-you-probably-shouldnt",
    "reblog": {
        "comment": "<p>A resume is an advertisement.  You are selling your time and attention, and trying to get some potential employer (who is a <strong>buyer</strong>, and a potential <strong>customer</strong>) to purchase said time and attention at a competitive price.  Advertisements exist to make someone want something.</p>\n\n<p>Most engineers aren’t all that savvy about the subtle art of advertising, and as a result, tend to view a resume as more like a letter than a print ad.  (Or, more like an email than an LRec, for those of you born after the digital revolution.) They learned in High School that the way to write a resume is:</p>\n\n<ol><li>Open up Microsoft Word (or OpenOffice, for the anti M$ types.)</li>\n    <li>Click File &gt; New…, and then select “Resume Wizard” as the type of document.</li>\n    <li>Select the style.</li>\n    <li>Enter your demographic and historical information.</li>\n    <li>Spellcheck (or don’t), save, email to recruiter or upload to job site.</li>\n</ol><p>They probably also learned that it has to be one page, because recruiters “look at a lot of resumes, and don’t have time to deal with any that are more than one <em>sheet of paper</em>.”</p>\n\n<p>This is a great way to ensure that your resume is completely like every other resume, and also show recruiters and hiring managers that you have a quaint attachment to the historical ways of yestercentury.</p>\n\n<p>A resume is not a letter.  It’s not an email.  It’s not a friendly chat.  It’s an advertisement.  Telling is nice, but showing is better.  If I’m buying, I want to know what I’m getting.</p>\n\n<p>It’s also not a high-school homework assignment.  And if you think “oh, advertising isn’t my bag, I’ll just do what everyone else does,” then why should a hiring manager take your career more seriously than you do?</p>\n\n<p>If you’re a web developer, then your resume should be an active testament to your skills.  It’s not enough to have links to stuff you’ve done (although that’s important, too.)  It should be in clean semantic HTML, and it should be styled with CSS.  Throw some Javascript in there to do a little something.  Test it in different browsers.  Put it online.  Link to it on your blog.  (You DO have a blog or personal website, don’t you?)  This is especially important if you’re a bit junior and don’t have much of a portfolio yet, or if your portfolio contains a lot of behind-the-curtain intranet or login-only projects.</p>\n\n<p>These things communicate a lot without having to say anything, and the words-behind-the-words are usually what speak loudest.  Putting your resume in HTML that you write from scratch gives a potential employer a very clear view of your ability.  A personal website gives them a view into your personality, lets them hear your voice.  If I’m in on the decision to hire someone, a resume built in HTML and CSS is significantly more important than a college degree.  You’ve gotta be pretty good for me to vote “yes” if you wrote your resume in Word.  If you <em>must</em> send a non-HTML resume, send text, and provide the URL to your “real” resume that’s online in HTML.  (The one you post online should have this url in it as well, in case it’s downloaded and emailed.)</p>\n\n<p>Now is a great time for web developers.  Our talents are (finally!) starting to get respect as more than just an extension of software development or graphic design.  The dollars are speaking, the audiences are getting bigger, executives and stake holders are beginning to take this medium <em>very</em> seriously.  And, it moves so fast that schools and books can’t seem to keep up very well.  If you know your stuff, then now is a great time to be a web developer, but it’s only a matter of time before the competition is going to get very tough.  Separate yourself from the pack now.</p>\n\n<p>I recently updated my <a href=\"http://foohack.com/resume/\">resume</a>, since it had gotten rather dated and my skills had increased quite a bit.  I did it as a lark and a time-spending activity while I was high on drugs from oral surgery.  I thought, <q>Hey, ya know what? Let’s see what happens if I update this and make the HTML a little more search-engine friendly, add some snazzy styles…</q>  Oh my god… I’ve gotten at least 2 calls and/or emails per week since then.  I can safely say that I’m working at Yahoo today because I truly love it here.</p>\n\n<p>If you are a web developer, and you’re not happy with your current job, or even if you are, <em>and you’re really <strong>really</strong> good at what you do</em>, create a resume in well-constructed HTML, make it look nice, and put it online.  Link to it on your blog, or in your signature if you participate in any web development-related forums.  You’ll be glad you did, and you’ll be helping the community of web developers in the long run by helping to keep our craft a highly valued commodity.</p>\n\n<p>Some tips:</p>\n\n<ul><li>It may be downloaded and emailed.  Try, if you can, to put all of your styles and scripts inline, and don’t rely too heavily on images, if you use them at all.</li>\n    <li>Spell-check it.</li>\n    <li><strong>Do not plagiarize.</strong> It looks very bad.  If you use a library or a common technique in your code, then cite it, post the license agreement, whatever.  Using a widely-known technique (and citing the source) shows that you’re in touch with the greater webdev community.  Stay legal, and be respectful of those who have shared with the community.  Violate this rule with serious risks—it can even get you fired by your shiny new employer.</li>\n    <li>Make it as long as it needs to be, but keep each piece short.</li>\n    <li>Put education near the bottom.  If you didn’t go to college, then don’t even put it.  It doesn’t matter as much as experience, in this field.</li>\n</ul><p>Recruiters are sharks.  They are mercenaries stop at nothing for the referral bonus.  They scour <abbr title=\"Search Engine Results Pages\">SERPs</abbr> 50 pages deep looking for fresh meat.  They read web development blogs and forums looking for the gurus.  They will find you if you let them.</p>",
        "tree_html": ""
    },
    "reblog_key": "pMJT3cNf",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWy8lWUQ",
    "slug": "the-art-of-the-resume-why-you-probably-shouldnt",
    "state": "published",
    "summary": "The Art of the Resume: Why You Probably Shouldn't Use MS Word",
    "tags": [
        "The Business"
    ],
    "timestamp": 1182358805,
    "title": "The Art of the Resume: Why You Probably Shouldn't Use MS Word ",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p>A resume is an advertisement.  You are selling your time and attention, and trying to get some potential employer (who is a <strong>buyer</strong>, and a potential <strong>customer</strong>) to purchase said time and attention at a competitive price.  Advertisements exist to make someone want something.</p>\n\n<p>Most engineers aren&rsquo;t all that savvy about the subtle art of advertising, and as a result, tend to view a resume as more like a letter than a print ad.  (Or, more like an email than an LRec, for those of you born after the digital revolution.) They learned in High School that the way to write a resume is:</p>\n\n<ol><li>Open up Microsoft Word (or OpenOffice, for the anti M$ types.)</li>\n    <li>Click File &gt; New&hellip;, and then select &ldquo;Resume Wizard&rdquo; as the type of document.</li>\n    <li>Select the style.</li>\n    <li>Enter your demographic and historical information.</li>\n    <li>Spellcheck (or don&rsquo;t), save, email to recruiter or upload to job site.</li>\n</ol><p>They probably also learned that it has to be one page, because recruiters &ldquo;look at a lot of resumes, and don&rsquo;t have time to deal with any that are more than one <em>sheet of paper</em>.&rdquo;</p>\n\n<p>This is a great way to ensure that your resume is completely like every other resume, and also show recruiters and hiring managers that you have a quaint attachment to the historical ways of yestercentury.</p>\n\n<p>A resume is not a letter.  It&rsquo;s not an email.  It&rsquo;s not a friendly chat.  It&rsquo;s an advertisement.  Telling is nice, but showing is better.  If I&rsquo;m buying, I want to know what I&rsquo;m getting.</p>\n\n<p>It&rsquo;s also not a high-school homework assignment.  And if you think &ldquo;oh, advertising isn&rsquo;t my bag, I&rsquo;ll just do what everyone else does,&rdquo; then why should a hiring manager take your career more seriously than you do?</p>\n\n<p>If you&rsquo;re a web developer, then your resume should be an active testament to your skills.  It&rsquo;s not enough to have links to stuff you&rsquo;ve done (although that&rsquo;s important, too.)  It should be in clean semantic HTML, and it should be styled with CSS.  Throw some Javascript in there to do a little something.  Test it in different browsers.  Put it online.  Link to it on your blog.  (You DO have a blog or personal website, don&rsquo;t you?)  This is especially important if you&rsquo;re a bit junior and don&rsquo;t have much of a portfolio yet, or if your portfolio contains a lot of behind-the-curtain intranet or login-only projects.</p>\n\n<p>These things communicate a lot without having to say anything, and the words-behind-the-words are usually what speak loudest.  Putting your resume in HTML that you write from scratch gives a potential employer a very clear view of your ability.  A personal website gives them a view into your personality, lets them hear your voice.  If I&rsquo;m in on the decision to hire someone, a resume built in HTML and CSS is significantly more important than a college degree.  You&rsquo;ve gotta be pretty good for me to vote &ldquo;yes&rdquo; if you wrote your resume in Word.  If you <em>must</em> send a non-HTML resume, send text, and provide the URL to your &ldquo;real&rdquo; resume that&rsquo;s online in HTML.  (The one you post online should have this url in it as well, in case it&rsquo;s downloaded and emailed.)</p>\n\n<p>Now is a great time for web developers.  Our talents are (finally!) starting to get respect as more than just an extension of software development or graphic design.  The dollars are speaking, the audiences are getting bigger, executives and stake holders are beginning to take this medium <em>very</em> seriously.  And, it moves so fast that schools and books can&rsquo;t seem to keep up very well.  If you know your stuff, then now is a great time to be a web developer, but it&rsquo;s only a matter of time before the competition is going to get very tough.  Separate yourself from the pack now.</p>\n\n<p>I recently updated my <a href=\"http://foohack.com/resume/\">resume</a>, since it had gotten rather dated and my skills had increased quite a bit.  I did it as a lark and a time-spending activity while I was high on drugs from oral surgery.  I thought, Hey, ya know what? Let&rsquo;s see what happens if I update this and make the HTML a little more search-engine friendly, add some snazzy styles&hellip;  Oh my god&hellip; I&rsquo;ve gotten at least 2 calls and/or emails per week since then.  I can safely say that I&rsquo;m working at Yahoo today because I truly love it here.</p>\n\n<p>If you are a web developer, and you&rsquo;re not happy with your current job, or even if you are, <em>and you&rsquo;re really <strong>really</strong> good at what you do</em>, create a resume in well-constructed HTML, make it look nice, and put it online.  Link to it on your blog, or in your signature if you participate in any web development-related forums.  You&rsquo;ll be glad you did, and you&rsquo;ll be helping the community of web developers in the long run by helping to keep our craft a highly valued commodity.</p>\n\n<p>Some tips:</p>\n\n<ul><li>It may be downloaded and emailed.  Try, if you can, to put all of your styles and scripts inline, and don&rsquo;t rely too heavily on images, if you use them at all.</li>\n    <li>Spell-check it.</li>\n    <li><strong>Do not plagiarize.</strong> It looks very bad.  If you use a library or a common technique in your code, then cite it, post the license agreement, whatever.  Using a widely-known technique (and citing the source) shows that you&rsquo;re in touch with the greater webdev community.  Stay legal, and be respectful of those who have shared with the community.  Violate this rule with serious risks&mdash;it can even get you fired by your shiny new employer.</li>\n    <li>Make it as long as it needs to be, but keep each piece short.</li>\n    <li>Put education near the bottom.  If you didn&rsquo;t go to college, then don&rsquo;t even put it.  It doesn&rsquo;t matter as much as experience, in this field.</li>\n</ul><p>Recruiters are sharks.  They are mercenaries stop at nothing for the referral bonus.  They scour SERPs 50 pages deep looking for fresh meat.  They read web development blogs and forums looking for the gurus.  They will find you if you let them.</p>",
            "content_raw": "<p>A resume is an advertisement.  You are selling your time and attention, and trying to get some potential employer (who is a <strong>buyer</strong>, and a potential <strong>customer</strong>) to purchase said time and attention at a competitive price.  Advertisements exist to make someone want something.</p>\n\n<p>Most engineers aren’t all that savvy about the subtle art of advertising, and as a result, tend to view a resume as more like a letter than a print ad.  (Or, more like an email than an LRec, for those of you born after the digital revolution.) They learned in High School that the way to write a resume is:</p>\n\n<ol><li>Open up Microsoft Word (or OpenOffice, for the anti M$ types.)</li>\n    <li>Click File &gt; New…, and then select “Resume Wizard” as the type of document.</li>\n    <li>Select the style.</li>\n    <li>Enter your demographic and historical information.</li>\n    <li>Spellcheck (or don’t), save, email to recruiter or upload to job site.</li>\n</ol><p>They probably also learned that it has to be one page, because recruiters “look at a lot of resumes, and don’t have time to deal with any that are more than one <em>sheet of paper</em>.”</p>\n\n<p>This is a great way to ensure that your resume is completely like every other resume, and also show recruiters and hiring managers that you have a quaint attachment to the historical ways of yestercentury.</p>\n\n<p>A resume is not a letter.  It’s not an email.  It’s not a friendly chat.  It’s an advertisement.  Telling is nice, but showing is better.  If I’m buying, I want to know what I’m getting.</p>\n\n<p>It’s also not a high-school homework assignment.  And if you think “oh, advertising isn’t my bag, I’ll just do what everyone else does,” then why should a hiring manager take your career more seriously than you do?</p>\n\n<p>If you’re a web developer, then your resume should be an active testament to your skills.  It’s not enough to have links to stuff you’ve done (although that’s important, too.)  It should be in clean semantic HTML, and it should be styled with CSS.  Throw some Javascript in there to do a little something.  Test it in different browsers.  Put it online.  Link to it on your blog.  (You DO have a blog or personal website, don’t you?)  This is especially important if you’re a bit junior and don’t have much of a portfolio yet, or if your portfolio contains a lot of behind-the-curtain intranet or login-only projects.</p>\n\n<p>These things communicate a lot without having to say anything, and the words-behind-the-words are usually what speak loudest.  Putting your resume in HTML that you write from scratch gives a potential employer a very clear view of your ability.  A personal website gives them a view into your personality, lets them hear your voice.  If I’m in on the decision to hire someone, a resume built in HTML and CSS is significantly more important than a college degree.  You’ve gotta be pretty good for me to vote “yes” if you wrote your resume in Word.  If you <em>must</em> send a non-HTML resume, send text, and provide the URL to your “real” resume that’s online in HTML.  (The one you post online should have this url in it as well, in case it’s downloaded and emailed.)</p>\n\n<p>Now is a great time for web developers.  Our talents are (finally!) starting to get respect as more than just an extension of software development or graphic design.  The dollars are speaking, the audiences are getting bigger, executives and stake holders are beginning to take this medium <em>very</em> seriously.  And, it moves so fast that schools and books can’t seem to keep up very well.  If you know your stuff, then now is a great time to be a web developer, but it’s only a matter of time before the competition is going to get very tough.  Separate yourself from the pack now.</p>\n\n<p>I recently updated my <a href=\"http://foohack.com/resume/\">resume</a>, since it had gotten rather dated and my skills had increased quite a bit.  I did it as a lark and a time-spending activity while I was high on drugs from oral surgery.  I thought, <q>Hey, ya know what? Let’s see what happens if I update this and make the HTML a little more search-engine friendly, add some snazzy styles…</q>  Oh my god… I’ve gotten at least 2 calls and/or emails per week since then.  I can safely say that I’m working at Yahoo today because I truly love it here.</p>\n\n<p>If you are a web developer, and you’re not happy with your current job, or even if you are, <em>and you’re really <strong>really</strong> good at what you do</em>, create a resume in well-constructed HTML, make it look nice, and put it online.  Link to it on your blog, or in your signature if you participate in any web development-related forums.  You’ll be glad you did, and you’ll be helping the community of web developers in the long run by helping to keep our craft a highly valued commodity.</p>\n\n<p>Some tips:</p>\n\n<ul><li>It may be downloaded and emailed.  Try, if you can, to put all of your styles and scripts inline, and don’t rely too heavily on images, if you use them at all.</li>\n    <li>Spell-check it.</li>\n    <li><strong>Do not plagiarize.</strong> It looks very bad.  If you use a library or a common technique in your code, then cite it, post the license agreement, whatever.  Using a widely-known technique (and citing the source) shows that you’re in touch with the greater webdev community.  Stay legal, and be respectful of those who have shared with the community.  Violate this rule with serious risks—it can even get you fired by your shiny new employer.</li>\n    <li>Make it as long as it needs to be, but keep each piece short.</li>\n    <li>Put education near the bottom.  If you didn’t go to college, then don’t even put it.  It doesn’t matter as much as experience, in this field.</li>\n</ul><p>Recruiters are sharks.  They are mercenaries stop at nothing for the referral bonus.  They scour <abbr title=\"Search Engine Results Pages\">SERPs</abbr> 50 pages deep looking for fresh meat.  They read web development blogs and forums looking for the gurus.  They will find you if you let them.</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "146671514"
            }
        }
    ],
    "type": "text"
}