{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544051896,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>If there had not been so much money to be so easily acquired in information technology, there&rsquo;s a good chance that I would have pursued a career in linguistics.  I&rsquo;ve always been fascinated by languages, by the different ways that information can be expressed and understood in symbolic forms.  Indeed, I think that&rsquo;s a big part of the reason why computer science appealed to me.</p>\n\n<p>This post is pretty off-topic for this blog, so it&rsquo;s hidden behind the jump.  You&rsquo;re invited to continue if you&rsquo;d like.</p>\n\n<!--more-->\n\n<p>I need to preface all of this with a huge disclaimer, lest any true linguist geeks see this and lose all respect for me.  I am a linguaphile, but not any kind of serious linguistic scholar.  Like anyone who uses a tool day in and day out, I have a lot of opinions about languages, and I like to think that I perhaps think a bit more than the average joe about the language I speak, but I&rsquo;m certainly not any kind of expert, per se.  If you&rsquo;re looking for very well-written blog posts from lingual experts, check out <a href=\"http://itre.cis.upenn.edu/~myl/languagelog/\">The Language Log</a>.  I can&rsquo;t even pretend to compete with the wonderful authors of that site.  I lose about 6 hours every time I check the bookmark.</p>\n\n<p>In high school, I studied Latin for 4 years.  In college, I studied Spanish for 2.  Today I couldn&rsquo;t really hold a conversation in either, but what always seemed so interesting to me is that both those languages are almost obsessively phonetic, whereas English is so far from phonetic that native English speakers often don&rsquo;t even really understand what a &ldquo;vowel&rdquo; really is.  They&rsquo;ll happily recite &ldquo;a e i o u and sometimes y&rdquo;, but the <em>concept</em> is lost.  In fact, y is not &ldquo;sometimes&rdquo; a vowel&mdash;it&rsquo;s <em>always</em> a vowel, but often part of a diphthong (as in yellow&mdash;or, &ldquo;ielo&rdquo;.)</p>\n\n<p>In a spoken language, sound is made by passing air over tightened vocal chords through a particularly shaped chamber.  The chamber can be opened and closed in various different ways, and can be shaped in different ways.  Consonants define the method by which the chamber is opened or closed (sound is started or stopped) while vowels define the shape of the chamber while sound is being created.  Nasals are sound that is passed through the nose, where air does not escape the mouth.  When the chamber is changed during the sound from one shape into another, that is a diphthong, or combination of vowels.  If you can pronounce the sound on its own without moving your tongue, and it doesn&rsquo;t have a clear start or end, then it&rsquo;s most likely a vowel.  (It could also be a nasal like n, m, and ng, or a sibilant consonant, like s or z.  Perhaps there are others, I&rsquo;m not sure.)</p>\n\n<p>I&rsquo;ve been thinking a lot the last few weeks about how English might be made phonetic.  The first step is identifying the vowels and diphthongs that we use in our spoken language, and forget everything we now know about spelling.  Where possible, I believe that it would make sense to use the Spanish vowels, since they are so widely known and seem to be fairly consistent in most languages:</p>\n\n<p>a = &ldquo;ah&rdquo; as in &ldquo;father&rdquo;\ne = &ldquo;eh&rdquo; as in &ldquo;bed&rdquo;\ni = &ldquo;ee&rdquo; as in &ldquo;feet&rdquo;\no = &ldquo;oh&rdquo; as in &ldquo;go&rdquo;\nu = &ldquo;oo&rdquo; as in &ldquo;boot&rdquo;</p>\n\n<p>The first thing that struck me is that we have a lot of other vowel sounds that simply don&rsquo;t exist in Spanish.  For example:</p>\n\n<p>&ldquo;r&rdquo; as in &ldquo;they&rsquo;re grrrrrrreat!&rdquo;\n&ldquo;a&rdquo; as in &ldquo;bat&rdquo;\n&ldquo;i&rdquo; as in &ldquo;bit&rdquo;</p>\n\n<p>There&rsquo;s already a letter for &ldquo;r&rdquo;, but the &ldquo;short a&rdquo; needs a new symbol.  Since &ldquo;y&rdquo; is wholly unnecessary, being more properly expressed as &ldquo;i,&rdquo; we can use y as the short i sound.  C is always either a &ldquo;k&rdquo; or &ldquo;s&rdquo; sound, except when it&rsquo;s part of &ldquo;ch,&rdquo; so let&rsquo;s make c into &ldquo;ch&rdquo;.  Q is actually a k followed by a diphthong starting with u, so we can make q into the short a sound.  (It&rsquo;s kind of like an a with a tail, anyway.)  The short &ldquo;oo&rdquo; sound is tricky, as well.  X is also just a &ldquo;ks&rdquo;, so we can use that.  The short &ldquo;u&rdquo; as in &ldquo;but&rdquo; is also missing.  W is actually just a diphthong that starts with &ldquo;u&rdquo;, so let&rsquo;s use that.  So:</p>\n\n<p>y = &ldquo;i&rdquo; as in &ldquo;bit&rdquo;\nq = &ldquo;a&rdquo; as in &ldquo;bat&rdquo;\nx = &ldquo;oo&rdquo; as in &ldquo;book&rdquo;\nw = &ldquo;u&rdquo; as in &ldquo;but&rdquo;\nc = &ldquo;ch&rdquo; as in &ldquo;chess&rdquo;</p>\n\n<p>A lot of the so-called vowels in English are actually diphthongs.  Spanish mostly gets these right  For example,</p>\n\n<p>&ldquo;i&rdquo; as in &ldquo;bite&rdquo; is actually ai\n&ldquo;ai&rdquo; as in &ldquo;wait&rdquo; is actually ei</p>\n\n<p>So, uat du ui faind hir?  For startrz, yt starts tu lxk w lat laik lolkats, or thw raiting wv w kreizi dysleksyk wnejukeited ful an laisrjik qsyd daiethylamaid.  Houevr, yt dwz get izir tu rid uons u hqv sin mor wv yt.  Thi er yz veri klir tudei, thi wethr meiks mi w hqpi boi.  Ai qm yn iur yntrnets, kloging iur tubz.  Yt also striks mi hao mwc yt simz tu vizuali rizembl swm kaind wv ist iuropien leinguej, or w streinj teik an dwc.</p>\n\n<p>Thi bygest prablem wyth thys speling yzynt thqt yts hard tu wndrstqnd, bwt rqthr thqt ui form hqbyts uyc ar hard tu breik.  Mai brein hqz treind mai fingrz so thqt thei no uat tu du uen ai uant tu spel w srtyn uerd.  Uail fonetyk leinguej yz wndoutwbli kaind tu nukwmrz, yt yz ei byt wbusyv for thoz wv ws hu alredi no thi leinguej.</p>\n\n<p>Also, srtyn uerdz bigyn tu sho wp thqt ar shr tu koaz prablemz.  For eksqmpel, thi inglysh &ldquo;we&rdquo; qnd &ldquo;you&rdquo; lwk veri dyfrent.  Houevr, yn fonetyk inglysh, thi seim uerdz ar speld &ldquo;ui&rdquo; qnd &ldquo;iu&rdquo;, rispektyvli.  Ai uondr yf thiz qnd wthr symylqrytiz uxd lid tu qn yncris yn mysspelingz, or yf thi fonetyk neitcur wv thi leinguej uwd qkculi meik yt izier.</p>\n\n<p>Ok, enough of that craziness&hellip;</p>\n\n<p>So, why not just use <a href=\"http://en.wikipedia.org/wiki/Kirshenbaum\">Kirshenbaum</a> or some other <a href=\"http://en.wikipedia.org/wiki/International_Phonetic_Alphabet\">IPA</a> for day-to-day writing?  After all, if you&rsquo;re going to be phonetic, why not <em>be</em> phonetic?</p>\n\n<p>The problem with that is that, while these alphabets are extremely useful in the analysis of speech and dialects, they are <em>too</em> precise to serve as a written language, as different dialects would then have completely different spellings.  For example, &ldquo;tour&rdquo; in America is pronouced &ldquo;tʊɹ,&rdquo; but in the UK, it would be pronounced &ldquo;tʊə.&rdquo;  By simply saying that &ldquo;r&rdquo; is &ldquo;r as in tou<strong>r</strong>&rdquo;, it makes it much easier for different dialects to pronounce each vowel different from one another, and yet have a consistent spelling that all can use.  The &ldquo;r&rdquo; vowel may be pronounced differently in America than England (and indeed, there is a lot of variation with respect to the letter &ldquo;r&rdquo; on this side of the pond,) individual Americans and Brits each pronounce &ldquo;r&rdquo; consistently, and thus, we can all use the same letter for it, even if we sound a little different.</p>\n\n<p>However, the IPA alphabets do get one thing very right: &ldquo;th&rdquo; should really be either &ldquo;θ&rdquo; (th as in <strong>th</strong>ing) or &ldquo;ð&rdquo; (th as in brea<strong>th</strong>e.)  Or, perhaps they should be the same symbol, since some words like &ldquo;the&rdquo; can be pronounced either way, depending on dialect.  Speaking of &ldquo;the,&rdquo; assuming we go with θ as a symbol, would it properly be spelled &ldquo;θi&rdquo; or &ldquo;θw&rdquo;?  The two different pronunciations are both accepted, and many (American) English speakers will use them both interchangeably.  When speaking quickly, as in the middle of this sentence, we tend to say θw.  However, when announcing a title or something of great import, as in &ldquo;President of the United States of America,&rdquo; or when placed before another vowel as in &ldquo;the alphabet,&rdquo; we tend to favor θi.  Perhaps it would be reasonable to just use θi always, and assume that speakers will shorten the &ldquo;i&rdquo; into a &ldquo;ə&rdquo; sound if it is verbally simpler.  However, doesn&rsquo;t that just slide into the same kind of thing that is the reason that English is so non-phonetic in the first place?  Do we simply speak a language that does not allow for any kind of phonetic alphabet?</p>\n\n<p>If you&rsquo;re at all interested in this topic, I highly recommend checking out these WikiPedia topics:</p>\n\n<ul><li><a href=\"http://en.wikipedia.org/wiki/Category:English_phonology\">English Phonology</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/List_of_phonetics_topics\">List of Phonetics Topics</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/Great_vowel_shift\">Great Vowel Shift</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/Category:History_of_the_English_language\">History of the English Language</a></li>\n</ul>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2007-08-05 17:00:38 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 146671793,
    "is_blocks_post_format": false,
    "note_count": 0,
    "post_url": "http://blog.izs.me/post/146671793/phonetic-english",
    "reblog": {
        "comment": "<p><p>If there had not been so much money to be so easily acquired in information technology, there’s a good chance that I would have pursued a career in linguistics.  I’ve always been fascinated by languages, by the different ways that information can be expressed and understood in symbolic forms.  Indeed, I think that’s a big part of the reason why computer science appealed to me.</p>\n\n<p>This post is pretty off-topic for this blog, so it’s hidden behind the jump.  You’re invited to continue if you’d like.</p>\n\n<!--more-->\n\n<p>I need to preface all of this with a huge disclaimer, lest any true linguist geeks see this and lose all respect for me.  I am a linguaphile, but not any kind of serious linguistic scholar.  Like anyone who uses a tool day in and day out, I have a lot of opinions about languages, and I like to think that I perhaps think a bit more than the average joe about the language I speak, but I’m certainly not any kind of expert, per se.  If you’re looking for very well-written blog posts from lingual experts, check out <a href=\"http://itre.cis.upenn.edu/~myl/languagelog/\">The Language Log</a>.  I can’t even pretend to compete with the wonderful authors of that site.  I lose about 6 hours every time I check the bookmark.</p>\n\n<p>In high school, I studied Latin for 4 years.  In college, I studied Spanish for 2.  Today I couldn’t really hold a conversation in either, but what always seemed so interesting to me is that both those languages are almost obsessively phonetic, whereas English is so far from phonetic that native English speakers often don’t even really understand what a “vowel” really is.  They’ll happily recite “a e i o u and sometimes y”, but the <em>concept</em> is lost.  In fact, y is not “sometimes” a vowel—it’s <em>always</em> a vowel, but often part of a diphthong (as in yellow—or, “ielo”.)</p>\n\n<p>In a spoken language, sound is made by passing air over tightened vocal chords through a particularly shaped chamber.  The chamber can be opened and closed in various different ways, and can be shaped in different ways.  Consonants define the method by which the chamber is opened or closed (sound is started or stopped) while vowels define the shape of the chamber while sound is being created.  Nasals are sound that is passed through the nose, where air does not escape the mouth.  When the chamber is changed during the sound from one shape into another, that is a diphthong, or combination of vowels.  If you can pronounce the sound on its own without moving your tongue, and it doesn’t have a clear start or end, then it’s most likely a vowel.  (It could also be a nasal like n, m, and ng, or a sibilant consonant, like s or z.  Perhaps there are others, I’m not sure.)</p>\n\n<p>I’ve been thinking a lot the last few weeks about how English might be made phonetic.  The first step is identifying the vowels and diphthongs that we use in our spoken language, and forget everything we now know about spelling.  Where possible, I believe that it would make sense to use the Spanish vowels, since they are so widely known and seem to be fairly consistent in most languages:</p>\n\n<p>a = “ah” as in “father”\ne = “eh” as in “bed”\ni = “ee” as in “feet”\no = “oh” as in “go”\nu = “oo” as in “boot”</p>\n\n<p>The first thing that struck me is that we have a lot of other vowel sounds that simply don’t exist in Spanish.  For example:</p>\n\n<p>“r” as in “they’re grrrrrrreat!”\n“a” as in “bat”\n“i” as in “bit”</p>\n\n<p>There’s already a letter for “r”, but the “short a” needs a new symbol.  Since “y” is wholly unnecessary, being more properly expressed as “i,” we can use y as the short i sound.  C is always either a “k” or “s” sound, except when it’s part of “ch,” so let’s make c into “ch”.  Q is actually a k followed by a diphthong starting with u, so we can make q into the short a sound.  (It’s kind of like an a with a tail, anyway.)  The short “oo” sound is tricky, as well.  X is also just a “ks”, so we can use that.  The short “u” as in “but” is also missing.  W is actually just a diphthong that starts with “u”, so let’s use that.  So:</p>\n\n<p>y = “i” as in “bit”\nq = “a” as in “bat”\nx = “oo” as in “book”\nw = “u” as in “but”\nc = “ch” as in “chess”</p>\n\n<p>A lot of the so-called vowels in English are actually diphthongs.  Spanish mostly gets these right  For example,</p>\n\n<p>“i” as in “bite” is actually ai\n“ai” as in “wait” is actually ei</p>\n\n<p>So, uat du ui faind hir?  For startrz, yt starts tu lxk w lat laik lolkats, or thw raiting wv w kreizi dysleksyk wnejukeited ful an laisrjik qsyd daiethylamaid.  Houevr, yt dwz get izir tu rid uons u hqv sin mor wv yt.  Thi er yz veri klir tudei, thi wethr meiks mi w hqpi boi.  Ai qm yn iur yntrnets, kloging iur tubz.  Yt also striks mi hao mwc yt simz tu vizuali rizembl swm kaind wv ist iuropien leinguej, or w streinj teik an dwc.</p>\n\n<p>Thi bygest prablem wyth thys speling yzynt thqt yts hard tu wndrstqnd, bwt rqthr thqt ui form hqbyts uyc ar hard tu breik.  Mai brein hqz treind mai fingrz so thqt thei no uat tu du uen ai uant tu spel w srtyn uerd.  Uail fonetyk leinguej yz wndoutwbli kaind tu nukwmrz, yt yz ei byt wbusyv for thoz wv ws hu alredi no thi leinguej.</p>\n\n<p>Also, srtyn uerdz bigyn tu sho wp thqt ar shr tu koaz prablemz.  For eksqmpel, thi inglysh “we” qnd “you” lwk veri dyfrent.  Houevr, yn fonetyk inglysh, thi seim uerdz ar speld “ui” qnd “iu”, rispektyvli.  Ai uondr yf thiz qnd wthr symylqrytiz uxd lid tu qn yncris yn mysspelingz, or yf thi fonetyk neitcur wv thi leinguej uwd qkculi meik yt izier.</p>\n\n<p>Ok, enough of that craziness…</p>\n\n<p>So, why not just use <a href=\"http://en.wikipedia.org/wiki/Kirshenbaum\">Kirshenbaum</a> or some other <a href=\"http://en.wikipedia.org/wiki/International_Phonetic_Alphabet\">IPA</a> for day-to-day writing?  After all, if you’re going to be phonetic, why not <em>be</em> phonetic?</p>\n\n<p>The problem with that is that, while these alphabets are extremely useful in the analysis of speech and dialects, they are <em>too</em> precise to serve as a written language, as different dialects would then have completely different spellings.  For example, “tour” in America is pronouced “tʊɹ,” but in the UK, it would be pronounced “tʊə.”  By simply saying that “r” is “r as in tou<strong>r</strong>”, it makes it much easier for different dialects to pronounce each vowel different from one another, and yet have a consistent spelling that all can use.  The “r” vowel may be pronounced differently in America than England (and indeed, there is a lot of variation with respect to the letter “r” on this side of the pond,) individual Americans and Brits each pronounce “r” consistently, and thus, we can all use the same letter for it, even if we sound a little different.</p>\n\n<p>However, the IPA alphabets do get one thing very right: “th” should really be either “θ” (th as in <strong>th</strong>ing) or “ð” (th as in brea<strong>th</strong>e.)  Or, perhaps they should be the same symbol, since some words like “the” can be pronounced either way, depending on dialect.  Speaking of “the,” assuming we go with θ as a symbol, would it properly be spelled “θi” or “θw”?  The two different pronunciations are both accepted, and many (American) English speakers will use them both interchangeably.  When speaking quickly, as in the middle of this sentence, we tend to say θw.  However, when announcing a title or something of great import, as in “President of the United States of America,” or when placed before another vowel as in “the alphabet,” we tend to favor θi.  Perhaps it would be reasonable to just use θi always, and assume that speakers will shorten the “i” into a “ə” sound if it is verbally simpler.  However, doesn’t that just slide into the same kind of thing that is the reason that English is so non-phonetic in the first place?  Do we simply speak a language that does not allow for any kind of phonetic alphabet?</p>\n\n<p>If you’re at all interested in this topic, I highly recommend checking out these WikiPedia topics:</p>\n\n<ul><li><a href=\"http://en.wikipedia.org/wiki/Category:English_phonology\">English Phonology</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/List_of_phonetics_topics\">List of Phonetics Topics</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/Great_vowel_shift\">Great Vowel Shift</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/Category:History_of_the_English_language\">History of the English Language</a></li>\n</ul></p>",
        "tree_html": ""
    },
    "reblog_key": "gqos33iU",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWy8lWYn",
    "slug": "phonetic-english",
    "state": "published",
    "summary": "Phonetic English",
    "tags": [
        "Off Topic"
    ],
    "timestamp": 1186333238,
    "title": "Phonetic English",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p><p>If there had not been so much money to be so easily acquired in information technology, there&rsquo;s a good chance that I would have pursued a career in linguistics.  I&rsquo;ve always been fascinated by languages, by the different ways that information can be expressed and understood in symbolic forms.  Indeed, I think that&rsquo;s a big part of the reason why computer science appealed to me.</p>\n\n<p>This post is pretty off-topic for this blog, so it&rsquo;s hidden behind the jump.  You&rsquo;re invited to continue if you&rsquo;d like.</p>\n\n\n\n<p>I need to preface all of this with a huge disclaimer, lest any true linguist geeks see this and lose all respect for me.  I am a linguaphile, but not any kind of serious linguistic scholar.  Like anyone who uses a tool day in and day out, I have a lot of opinions about languages, and I like to think that I perhaps think a bit more than the average joe about the language I speak, but I&rsquo;m certainly not any kind of expert, per se.  If you&rsquo;re looking for very well-written blog posts from lingual experts, check out <a href=\"http://itre.cis.upenn.edu/~myl/languagelog/\">The Language Log</a>.  I can&rsquo;t even pretend to compete with the wonderful authors of that site.  I lose about 6 hours every time I check the bookmark.</p>\n\n<p>In high school, I studied Latin for 4 years.  In college, I studied Spanish for 2.  Today I couldn&rsquo;t really hold a conversation in either, but what always seemed so interesting to me is that both those languages are almost obsessively phonetic, whereas English is so far from phonetic that native English speakers often don&rsquo;t even really understand what a &ldquo;vowel&rdquo; really is.  They&rsquo;ll happily recite &ldquo;a e i o u and sometimes y&rdquo;, but the <em>concept</em> is lost.  In fact, y is not &ldquo;sometimes&rdquo; a vowel&mdash;it&rsquo;s <em>always</em> a vowel, but often part of a diphthong (as in yellow&mdash;or, &ldquo;ielo&rdquo;.)</p>\n\n<p>In a spoken language, sound is made by passing air over tightened vocal chords through a particularly shaped chamber.  The chamber can be opened and closed in various different ways, and can be shaped in different ways.  Consonants define the method by which the chamber is opened or closed (sound is started or stopped) while vowels define the shape of the chamber while sound is being created.  Nasals are sound that is passed through the nose, where air does not escape the mouth.  When the chamber is changed during the sound from one shape into another, that is a diphthong, or combination of vowels.  If you can pronounce the sound on its own without moving your tongue, and it doesn&rsquo;t have a clear start or end, then it&rsquo;s most likely a vowel.  (It could also be a nasal like n, m, and ng, or a sibilant consonant, like s or z.  Perhaps there are others, I&rsquo;m not sure.)</p>\n\n<p>I&rsquo;ve been thinking a lot the last few weeks about how English might be made phonetic.  The first step is identifying the vowels and diphthongs that we use in our spoken language, and forget everything we now know about spelling.  Where possible, I believe that it would make sense to use the Spanish vowels, since they are so widely known and seem to be fairly consistent in most languages:</p>\n\n<p>a = &ldquo;ah&rdquo; as in &ldquo;father&rdquo;\ne = &ldquo;eh&rdquo; as in &ldquo;bed&rdquo;\ni = &ldquo;ee&rdquo; as in &ldquo;feet&rdquo;\no = &ldquo;oh&rdquo; as in &ldquo;go&rdquo;\nu = &ldquo;oo&rdquo; as in &ldquo;boot&rdquo;</p>\n\n<p>The first thing that struck me is that we have a lot of other vowel sounds that simply don&rsquo;t exist in Spanish.  For example:</p>\n\n<p>&ldquo;r&rdquo; as in &ldquo;they&rsquo;re grrrrrrreat!&rdquo;\n&ldquo;a&rdquo; as in &ldquo;bat&rdquo;\n&ldquo;i&rdquo; as in &ldquo;bit&rdquo;</p>\n\n<p>There&rsquo;s already a letter for &ldquo;r&rdquo;, but the &ldquo;short a&rdquo; needs a new symbol.  Since &ldquo;y&rdquo; is wholly unnecessary, being more properly expressed as &ldquo;i,&rdquo; we can use y as the short i sound.  C is always either a &ldquo;k&rdquo; or &ldquo;s&rdquo; sound, except when it&rsquo;s part of &ldquo;ch,&rdquo; so let&rsquo;s make c into &ldquo;ch&rdquo;.  Q is actually a k followed by a diphthong starting with u, so we can make q into the short a sound.  (It&rsquo;s kind of like an a with a tail, anyway.)  The short &ldquo;oo&rdquo; sound is tricky, as well.  X is also just a &ldquo;ks&rdquo;, so we can use that.  The short &ldquo;u&rdquo; as in &ldquo;but&rdquo; is also missing.  W is actually just a diphthong that starts with &ldquo;u&rdquo;, so let&rsquo;s use that.  So:</p>\n\n<p>y = &ldquo;i&rdquo; as in &ldquo;bit&rdquo;\nq = &ldquo;a&rdquo; as in &ldquo;bat&rdquo;\nx = &ldquo;oo&rdquo; as in &ldquo;book&rdquo;\nw = &ldquo;u&rdquo; as in &ldquo;but&rdquo;\nc = &ldquo;ch&rdquo; as in &ldquo;chess&rdquo;</p>\n\n<p>A lot of the so-called vowels in English are actually diphthongs.  Spanish mostly gets these right  For example,</p>\n\n<p>&ldquo;i&rdquo; as in &ldquo;bite&rdquo; is actually ai\n&ldquo;ai&rdquo; as in &ldquo;wait&rdquo; is actually ei</p>\n\n<p>So, uat du ui faind hir?  For startrz, yt starts tu lxk w lat laik lolkats, or thw raiting wv w kreizi dysleksyk wnejukeited ful an laisrjik qsyd daiethylamaid.  Houevr, yt dwz get izir tu rid uons u hqv sin mor wv yt.  Thi er yz veri klir tudei, thi wethr meiks mi w hqpi boi.  Ai qm yn iur yntrnets, kloging iur tubz.  Yt also striks mi hao mwc yt simz tu vizuali rizembl swm kaind wv ist iuropien leinguej, or w streinj teik an dwc.</p>\n\n<p>Thi bygest prablem wyth thys speling yzynt thqt yts hard tu wndrstqnd, bwt rqthr thqt ui form hqbyts uyc ar hard tu breik.  Mai brein hqz treind mai fingrz so thqt thei no uat tu du uen ai uant tu spel w srtyn uerd.  Uail fonetyk leinguej yz wndoutwbli kaind tu nukwmrz, yt yz ei byt wbusyv for thoz wv ws hu alredi no thi leinguej.</p>\n\n<p>Also, srtyn uerdz bigyn tu sho wp thqt ar shr tu koaz prablemz.  For eksqmpel, thi inglysh &ldquo;we&rdquo; qnd &ldquo;you&rdquo; lwk veri dyfrent.  Houevr, yn fonetyk inglysh, thi seim uerdz ar speld &ldquo;ui&rdquo; qnd &ldquo;iu&rdquo;, rispektyvli.  Ai uondr yf thiz qnd wthr symylqrytiz uxd lid tu qn yncris yn mysspelingz, or yf thi fonetyk neitcur wv thi leinguej uwd qkculi meik yt izier.</p>\n\n<p>Ok, enough of that craziness&hellip;</p>\n\n<p>So, why not just use <a href=\"http://en.wikipedia.org/wiki/Kirshenbaum\">Kirshenbaum</a> or some other <a href=\"http://en.wikipedia.org/wiki/International_Phonetic_Alphabet\">IPA</a> for day-to-day writing?  After all, if you&rsquo;re going to be phonetic, why not <em>be</em> phonetic?</p>\n\n<p>The problem with that is that, while these alphabets are extremely useful in the analysis of speech and dialects, they are <em>too</em> precise to serve as a written language, as different dialects would then have completely different spellings.  For example, &ldquo;tour&rdquo; in America is pronouced &ldquo;t&#650;&#633;,&rdquo; but in the UK, it would be pronounced &ldquo;t&#650;&#601;.&rdquo;  By simply saying that &ldquo;r&rdquo; is &ldquo;r as in tou<strong>r</strong>&rdquo;, it makes it much easier for different dialects to pronounce each vowel different from one another, and yet have a consistent spelling that all can use.  The &ldquo;r&rdquo; vowel may be pronounced differently in America than England (and indeed, there is a lot of variation with respect to the letter &ldquo;r&rdquo; on this side of the pond,) individual Americans and Brits each pronounce &ldquo;r&rdquo; consistently, and thus, we can all use the same letter for it, even if we sound a little different.</p>\n\n<p>However, the IPA alphabets do get one thing very right: &ldquo;th&rdquo; should really be either &ldquo;&theta;&rdquo; (th as in <strong>th</strong>ing) or &ldquo;&eth;&rdquo; (th as in brea<strong>th</strong>e.)  Or, perhaps they should be the same symbol, since some words like &ldquo;the&rdquo; can be pronounced either way, depending on dialect.  Speaking of &ldquo;the,&rdquo; assuming we go with &theta; as a symbol, would it properly be spelled &ldquo;&theta;i&rdquo; or &ldquo;&theta;w&rdquo;?  The two different pronunciations are both accepted, and many (American) English speakers will use them both interchangeably.  When speaking quickly, as in the middle of this sentence, we tend to say &theta;w.  However, when announcing a title or something of great import, as in &ldquo;President of the United States of America,&rdquo; or when placed before another vowel as in &ldquo;the alphabet,&rdquo; we tend to favor &theta;i.  Perhaps it would be reasonable to just use &theta;i always, and assume that speakers will shorten the &ldquo;i&rdquo; into a &ldquo;&#601;&rdquo; sound if it is verbally simpler.  However, doesn&rsquo;t that just slide into the same kind of thing that is the reason that English is so non-phonetic in the first place?  Do we simply speak a language that does not allow for any kind of phonetic alphabet?</p>\n\n<p>If you&rsquo;re at all interested in this topic, I highly recommend checking out these WikiPedia topics:</p>\n\n<ul><li><a href=\"http://en.wikipedia.org/wiki/Category:English_phonology\">English Phonology</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/List_of_phonetics_topics\">List of Phonetics Topics</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/Great_vowel_shift\">Great Vowel Shift</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/Category:History_of_the_English_language\">History of the English Language</a></li>\n</ul></p>",
            "content_raw": "<p><p>If there had not been so much money to be so easily acquired in information technology, there’s a good chance that I would have pursued a career in linguistics.  I’ve always been fascinated by languages, by the different ways that information can be expressed and understood in symbolic forms.  Indeed, I think that’s a big part of the reason why computer science appealed to me.</p>\n\n<p>This post is pretty off-topic for this blog, so it’s hidden behind the jump.  You’re invited to continue if you’d like.</p>\n\n<!--more-->\n\n<p>I need to preface all of this with a huge disclaimer, lest any true linguist geeks see this and lose all respect for me.  I am a linguaphile, but not any kind of serious linguistic scholar.  Like anyone who uses a tool day in and day out, I have a lot of opinions about languages, and I like to think that I perhaps think a bit more than the average joe about the language I speak, but I’m certainly not any kind of expert, per se.  If you’re looking for very well-written blog posts from lingual experts, check out <a href=\"http://itre.cis.upenn.edu/~myl/languagelog/\">The Language Log</a>.  I can’t even pretend to compete with the wonderful authors of that site.  I lose about 6 hours every time I check the bookmark.</p>\n\n<p>In high school, I studied Latin for 4 years.  In college, I studied Spanish for 2.  Today I couldn’t really hold a conversation in either, but what always seemed so interesting to me is that both those languages are almost obsessively phonetic, whereas English is so far from phonetic that native English speakers often don’t even really understand what a “vowel” really is.  They’ll happily recite “a e i o u and sometimes y”, but the <em>concept</em> is lost.  In fact, y is not “sometimes” a vowel—it’s <em>always</em> a vowel, but often part of a diphthong (as in yellow—or, “ielo”.)</p>\n\n<p>In a spoken language, sound is made by passing air over tightened vocal chords through a particularly shaped chamber.  The chamber can be opened and closed in various different ways, and can be shaped in different ways.  Consonants define the method by which the chamber is opened or closed (sound is started or stopped) while vowels define the shape of the chamber while sound is being created.  Nasals are sound that is passed through the nose, where air does not escape the mouth.  When the chamber is changed during the sound from one shape into another, that is a diphthong, or combination of vowels.  If you can pronounce the sound on its own without moving your tongue, and it doesn’t have a clear start or end, then it’s most likely a vowel.  (It could also be a nasal like n, m, and ng, or a sibilant consonant, like s or z.  Perhaps there are others, I’m not sure.)</p>\n\n<p>I’ve been thinking a lot the last few weeks about how English might be made phonetic.  The first step is identifying the vowels and diphthongs that we use in our spoken language, and forget everything we now know about spelling.  Where possible, I believe that it would make sense to use the Spanish vowels, since they are so widely known and seem to be fairly consistent in most languages:</p>\n\n<p>a = “ah” as in “father”\ne = “eh” as in “bed”\ni = “ee” as in “feet”\no = “oh” as in “go”\nu = “oo” as in “boot”</p>\n\n<p>The first thing that struck me is that we have a lot of other vowel sounds that simply don’t exist in Spanish.  For example:</p>\n\n<p>“r” as in “they’re grrrrrrreat!”\n“a” as in “bat”\n“i” as in “bit”</p>\n\n<p>There’s already a letter for “r”, but the “short a” needs a new symbol.  Since “y” is wholly unnecessary, being more properly expressed as “i,” we can use y as the short i sound.  C is always either a “k” or “s” sound, except when it’s part of “ch,” so let’s make c into “ch”.  Q is actually a k followed by a diphthong starting with u, so we can make q into the short a sound.  (It’s kind of like an a with a tail, anyway.)  The short “oo” sound is tricky, as well.  X is also just a “ks”, so we can use that.  The short “u” as in “but” is also missing.  W is actually just a diphthong that starts with “u”, so let’s use that.  So:</p>\n\n<p>y = “i” as in “bit”\nq = “a” as in “bat”\nx = “oo” as in “book”\nw = “u” as in “but”\nc = “ch” as in “chess”</p>\n\n<p>A lot of the so-called vowels in English are actually diphthongs.  Spanish mostly gets these right  For example,</p>\n\n<p>“i” as in “bite” is actually ai\n“ai” as in “wait” is actually ei</p>\n\n<p>So, uat du ui faind hir?  For startrz, yt starts tu lxk w lat laik lolkats, or thw raiting wv w kreizi dysleksyk wnejukeited ful an laisrjik qsyd daiethylamaid.  Houevr, yt dwz get izir tu rid uons u hqv sin mor wv yt.  Thi er yz veri klir tudei, thi wethr meiks mi w hqpi boi.  Ai qm yn iur yntrnets, kloging iur tubz.  Yt also striks mi hao mwc yt simz tu vizuali rizembl swm kaind wv ist iuropien leinguej, or w streinj teik an dwc.</p>\n\n<p>Thi bygest prablem wyth thys speling yzynt thqt yts hard tu wndrstqnd, bwt rqthr thqt ui form hqbyts uyc ar hard tu breik.  Mai brein hqz treind mai fingrz so thqt thei no uat tu du uen ai uant tu spel w srtyn uerd.  Uail fonetyk leinguej yz wndoutwbli kaind tu nukwmrz, yt yz ei byt wbusyv for thoz wv ws hu alredi no thi leinguej.</p>\n\n<p>Also, srtyn uerdz bigyn tu sho wp thqt ar shr tu koaz prablemz.  For eksqmpel, thi inglysh “we” qnd “you” lwk veri dyfrent.  Houevr, yn fonetyk inglysh, thi seim uerdz ar speld “ui” qnd “iu”, rispektyvli.  Ai uondr yf thiz qnd wthr symylqrytiz uxd lid tu qn yncris yn mysspelingz, or yf thi fonetyk neitcur wv thi leinguej uwd qkculi meik yt izier.</p>\n\n<p>Ok, enough of that craziness…</p>\n\n<p>So, why not just use <a href=\"http://en.wikipedia.org/wiki/Kirshenbaum\">Kirshenbaum</a> or some other <a href=\"http://en.wikipedia.org/wiki/International_Phonetic_Alphabet\">IPA</a> for day-to-day writing?  After all, if you’re going to be phonetic, why not <em>be</em> phonetic?</p>\n\n<p>The problem with that is that, while these alphabets are extremely useful in the analysis of speech and dialects, they are <em>too</em> precise to serve as a written language, as different dialects would then have completely different spellings.  For example, “tour” in America is pronouced “tʊɹ,” but in the UK, it would be pronounced “tʊə.”  By simply saying that “r” is “r as in tou<strong>r</strong>”, it makes it much easier for different dialects to pronounce each vowel different from one another, and yet have a consistent spelling that all can use.  The “r” vowel may be pronounced differently in America than England (and indeed, there is a lot of variation with respect to the letter “r” on this side of the pond,) individual Americans and Brits each pronounce “r” consistently, and thus, we can all use the same letter for it, even if we sound a little different.</p>\n\n<p>However, the IPA alphabets do get one thing very right: “th” should really be either “θ” (th as in <strong>th</strong>ing) or “ð” (th as in brea<strong>th</strong>e.)  Or, perhaps they should be the same symbol, since some words like “the” can be pronounced either way, depending on dialect.  Speaking of “the,” assuming we go with θ as a symbol, would it properly be spelled “θi” or “θw”?  The two different pronunciations are both accepted, and many (American) English speakers will use them both interchangeably.  When speaking quickly, as in the middle of this sentence, we tend to say θw.  However, when announcing a title or something of great import, as in “President of the United States of America,” or when placed before another vowel as in “the alphabet,” we tend to favor θi.  Perhaps it would be reasonable to just use θi always, and assume that speakers will shorten the “i” into a “ə” sound if it is verbally simpler.  However, doesn’t that just slide into the same kind of thing that is the reason that English is so non-phonetic in the first place?  Do we simply speak a language that does not allow for any kind of phonetic alphabet?</p>\n\n<p>If you’re at all interested in this topic, I highly recommend checking out these WikiPedia topics:</p>\n\n<ul><li><a href=\"http://en.wikipedia.org/wiki/Category:English_phonology\">English Phonology</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/List_of_phonetics_topics\">List of Phonetics Topics</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/Great_vowel_shift\">Great Vowel Shift</a></li>\n    <li><a href=\"http://en.wikipedia.org/wiki/Category:History_of_the_English_language\">History of the English Language</a></li>\n</ul></p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "146671793"
            }
        }
    ],
    "type": "text"
}