{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544051896,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>The web today is in its teenage years.</p>\n\n<p>When you were a baby, you had one name (if even that, as far as you were concerned), and a very small network of people that you knew and trusted completely.  Access equals trust for a baby.  Identity is not worth thinking about, because it&rsquo;s so simple.  Exploration is everything, and while every step is clumsy and every word garbled, it&rsquo;s all happening for the first time, so it&rsquo;s magnificent and beautiful.  Meaningful accomplishments happen almost daily, and every advance is huge.</p>\n\n<p>The advent of TCP/IP and the HTTP protocol; DNS protocols; the HTML language, and powerful browsers to interpret it; email; the migration of a bunch of different networks into a single over-arching network.  These were the internet&rsquo;s baby steps and first words.</p>\n\n<p>The web entered the &ldquo;I WANT&rdquo; phase of toddlerhood through the 90s.  Suddenly, the notion that you could actually BUY and SELL things on the web hit the fan. People made <strong style=\"color:green\">MONEY</strong>, and that opened up all these doors.  Everyone got crazy with the frenzy of it.  Venture capital poured into the valley, backed by the absolutely magical idea that advertisers&rsquo; budgets would grow as fast as online advertising space.  Instead, the simple and timeless rules of supply and demand kicked in, and the bubble burst.  The web got put on time-out, and pouted for a while about it.</p>\n\n<p>In the bubble, as in childhood, there were some fantasies crushed, and some lessons learned.  We got Yahoo and Google and Amazon out of that frenzy, and a bunch of other technologies and companies and insights that I&rsquo;m sure we&rsquo;re all really glad to have.  Pets.com didn&rsquo;t make it, but let&rsquo;s face it, Pets.com was pretty damn stupid.  <small>I pick on Pets.com unfairly, because it&rsquo;s one of the only failed bubble companies that I remember.  But I <strong>do</strong> remember Pets.com, and that&rsquo;s actually pretty respectable, compared to all the other failures that are completely forgotten.</small></p>\n\n<p>Between the bubble bursting and today, the web has been in Junior High.  Angsty, a bit more aware of the world, and just starting to make the first groping steps towards self-identification and social activity; but it&rsquo;s still essentially immature.  Friendster and Blogging and MySpace and Facebook got everyone realizing that the web really is a person-to-person thing, and not just a company-to-consumer thing.  And of course, there have been posers at the party, just trying to look and act like the popular kids to get attention.  You know the sites I mean.  <q>It&rsquo;s a revolutionary new site!  It&rsquo;s got badges, and you can build a friend list!  Upload your avatar!</q>  But you do that, and realize, <q>there&rsquo;s nothing here</q>.</p>\n\n<p>As in junior high, splitting the quality from the chaff is pretty tricky.  I didn&rsquo;t sign up for <a href=\"http://twitter.com\">Twitter</a> for a long while, just because I&rsquo;ve gotten burned by the early adopter tax too many times.  Yes, I know all these sites don&rsquo;t cost money, but they do cost time, and that&rsquo;s a limited resource.  If I sign up and enter my info and upload an avatar and find my friends, and then never use the site, I&rsquo;ve just wasted a lot of time.  And it&rsquo;s not fun enough to justify the expense.</p>\n\n<p>The High School years, and especially the &ldquo;tweens&rdquo; from about 9 to 13, are often marked by exactly this sort of constant self re-invention, but it&rsquo;s very superficial.  You identify with a tribe based on music, or hair styles, or clothing.  It&rsquo;s practice for the real world when no one will establish our identities for us.  Since they don&rsquo;t really understand yet who they are as people, or what kinds of people they really want to be around long-term, kids in this age tend to get by with trial and error.  Before this age, children don&rsquo;t really &ldquo;own&rdquo; their identity; they are what their parents say they are.  By the time they get to High School, they&rsquo;re driving the identity ship, even if they do sail it around in circles.</p>\n\n<p>The &ldquo;social networking&rdquo; sites, even the <a href=\"http://linkedin.com\">more</a> <a href=\"http://twitter.com\">useful</a> or <a href=\"http://myspace.com\">popular</a> <a href=\"http://facebook.com\">ones</a>, are essentially shallow.  There is a concept of a &ldquo;friend&rdquo;, and that&rsquo;s it.  Either we are friends, or we aren&rsquo;t; maybe there&rsquo;s 2 or 3 groups that I can put my friends in, but that&rsquo;s just 2 or 3 binary choices instead of 1&mdash;there&rsquo;s still very little richness.  We need to invent our identity and pick our clothes every time we want to use a website.  Without a lot of formal introductions, this group of friends knows nothing about my other groups.  And so on.</p>\n\n<p>Some people make a few life-long friends in High School, but that&rsquo;s pretty rare, I think.  More common are people who part ways, and then meet again after college, and find that they once again enjoy each others&rsquo; company.  Far more common than that, though, are people who branch off after high school, and never look back, (except when they get a friend request on Facebook, that is, and even then it&rsquo;s just a bit of <q>Oh, you&rsquo;re doing good?  Me, too.  You hear Joe had a kid? Yeah, I know.  Well, take care!</q> and then they go back to doing their own separate lives again.)</p>\n\n<p>In college, things generally change.  Some kids keep experimenting with different faces for a while, but at some point, they realize that they&rsquo;re going to have to be grown-ups, and they&rsquo;re hopefully faced with enough challenging work that the games get to be less relevant.  When you have to keep a C+ average to stay on the football team and keep your scholarship, it doesn&rsquo;t make much sense to be mean to nerds.  The adults around you gradually stop telling you what to do, and instead tell you to pick what <em>you</em> want to do.  The depth of our social interaction changes, as well.  People date in high school; in college, people get married and have kids.  (Not many of them any more, but we all probably knew someone who graduated pregnant.  I was born while my parents were both students at USD.)</p>\n\n<p>When you get out of college, they stop telling you to pick what you want to do.  If you don&rsquo;t want to do it, you don&rsquo;t.  The relationships are as deep or meaningless as you want them to be.  You&rsquo;re limited only by your own imagination.</p>\n\n<p>I think that, today, we&rsquo;re somewhere close to the highschool/college cusp.  If the web is a child, it&rsquo;s about 16; just got its drivers&rsquo; license, but still doesn&rsquo;t have anywhere really worthwhile to go.  The most interesting aspects of the web&rsquo;s maturation are, in my opinion:</p>\n\n<ol><li>\n\nConsistent, user-owned identity, which doesn&rsquo;t change from place to place.  I&rsquo;m talking about OpenID, but OpenID is just part of the solution.  OpenID is a name, but identity is also a whole brand.  We&rsquo;re not quite there yet, but the OpenSocial API specification and Facebook&rsquo;s opening up of their APIs promises to lead towards some portability.  And of course, there&rsquo;s <a href=\"http://www.ownyouridentity.com/\">Own Your Identity</a> and their yet-to-be released <a href=\"http://chi.mp\">Chi.mp</a> product, which looks very interesting.  I&rsquo;m definitely keeping my eye on that.\n\nThe challenge will be to eliminate the management overhead of multiple personas, without eliminating the expressive power it affords.  Your profile on LinkedIn might not be quite the same as your profile on bdsm-speed-dating.com.  Without user-controlled privacy, there&rsquo;s no ownership in any meaningful sense, and thus, limited relevance.  And, if it&rsquo;s not easy, it&rsquo;s not a solution.\n\n</li>\n    <li>\n\nMany shallow social networks merging into a single rich matrix.  While each site may only have one concept of &ldquo;friend&rdquo;, every one of their implications are a little different, and when I can link them all up to a single point of identification, it becomes very powerful and expressive.  Just as you can have coworkers, friends, and family, and some coworkers are friends, some friends are family, and so on; if identity was user-owned and consistent, I&rsquo;d be able to have twitter friends, some of whom I&rsquo;m also connected to on Flickr, or talk to on IM, and so on.  That social matrix exists today, but it&rsquo;s very difficult to leverage.\n\nIt&rsquo;s yet to be shown (or even, fully conceived) what kind of information and usefulness can be teased out of this matrix.  First, we need straightforward protocols to get at the data, and then I think we&rsquo;ll all be surprised at how it can be used to enrich our lives.\n\n</li>\n</ol><p>That&rsquo;s really what it&rsquo;s all about: enriching the quality of our lives.  People like to bitch about technology, but I think that&rsquo;s just because people like to bitch.  Remember in 1990, when you didn&rsquo;t have a cell phone?  What a compete and utter pain in the ass it was to meet someone at the movie theater?  Remember when, if you wanted to show someone a document, you had to print it out&mdash;or, worse yet, <em>photocopy</em> it&mdash;and physically bring it to them?  <small>These are my &ldquo;uphill both ways in the snow&rdquo; stories for future generations.</small></p>\n\n<p>The fact is, these things <em>do</em> make our lives better, overall, even with the new ways that we find to get annoyed by them.  I&rsquo;m very excited about what the Internet will look like when it&rsquo;s all grown up.</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2008-06-01 06:28:43 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 146672674,
    "is_blocks_post_format": false,
    "note_count": 0,
    "post_url": "http://blog.izs.me/post/146672674/the-internet-is-today-a-16-year-old-child",
    "reblog": {
        "comment": "<p>The web today is in its teenage years.</p>\n\n<p>When you were a baby, you had one name (if even that, as far as you were concerned), and a very small network of people that you knew and trusted completely.  Access equals trust for a baby.  Identity is not worth thinking about, because it’s so simple.  Exploration is everything, and while every step is clumsy and every word garbled, it’s all happening for the first time, so it’s magnificent and beautiful.  Meaningful accomplishments happen almost daily, and every advance is huge.</p>\n\n<p>The advent of TCP/IP and the HTTP protocol; DNS protocols; the HTML language, and powerful browsers to interpret it; email; the migration of a bunch of different networks into a single over-arching network.  These were the internet’s baby steps and first words.</p>\n\n<p>The web entered the “I WANT” phase of toddlerhood through the 90s.  Suddenly, the notion that you could actually BUY and SELL things on the web hit the fan. People made <strong style=\"color:green\">MONEY</strong>, and that opened up all these doors.  Everyone got crazy with the frenzy of it.  Venture capital poured into the valley, backed by the absolutely magical idea that advertisers’ budgets would grow as fast as online advertising space.  Instead, the simple and timeless rules of supply and demand kicked in, and the bubble burst.  The web got put on time-out, and pouted for a while about it.</p>\n\n<p>In the bubble, as in childhood, there were some fantasies crushed, and some lessons learned.  We got Yahoo and Google and Amazon out of that frenzy, and a bunch of other technologies and companies and insights that I’m sure we’re all really glad to have.  Pets.com didn’t make it, but let’s face it, Pets.com was pretty damn stupid.  <small>I pick on Pets.com unfairly, because it’s one of the only failed bubble companies that I remember.  But I <strong>do</strong> remember Pets.com, and that’s actually pretty respectable, compared to all the other failures that are completely forgotten.</small></p>\n\n<p>Between the bubble bursting and today, the web has been in Junior High.  Angsty, a bit more aware of the world, and just starting to make the first groping steps towards self-identification and social activity; but it’s still essentially immature.  Friendster and Blogging and MySpace and Facebook got everyone realizing that the web really is a person-to-person thing, and not just a company-to-consumer thing.  And of course, there have been posers at the party, just trying to look and act like the popular kids to get attention.  You know the sites I mean.  <q>It’s a revolutionary new site!  It’s got badges, and you can build a friend list!  Upload your avatar!</q>  But you do that, and realize, <q>there’s nothing here</q>.</p>\n\n<p>As in junior high, splitting the quality from the chaff is pretty tricky.  I didn’t sign up for <a href=\"http://twitter.com\">Twitter</a> for a long while, just because I’ve gotten burned by the early adopter tax too many times.  Yes, I know all these sites don’t cost money, but they do cost time, and that’s a limited resource.  If I sign up and enter my info and upload an avatar and find my friends, and then never use the site, I’ve just wasted a lot of time.  And it’s not fun enough to justify the expense.</p>\n\n<p>The High School years, and especially the “tweens” from about 9 to 13, are often marked by exactly this sort of constant self re-invention, but it’s very superficial.  You identify with a tribe based on music, or hair styles, or clothing.  It’s practice for the real world when no one will establish our identities for us.  Since they don’t really understand yet who they are as people, or what kinds of people they really want to be around long-term, kids in this age tend to get by with trial and error.  Before this age, children don’t really “own” their identity; they are what their parents say they are.  By the time they get to High School, they’re driving the identity ship, even if they do sail it around in circles.</p>\n\n<p>The “social networking” sites, even the <a href=\"http://linkedin.com\">more</a> <a href=\"http://twitter.com\">useful</a> or <a href=\"http://myspace.com\">popular</a> <a href=\"http://facebook.com\">ones</a>, are essentially shallow.  There is a concept of a “friend”, and that’s it.  Either we are friends, or we aren’t; maybe there’s 2 or 3 groups that I can put my friends in, but that’s just 2 or 3 binary choices instead of 1—there’s still very little richness.  We need to invent our identity and pick our clothes every time we want to use a website.  Without a lot of formal introductions, this group of friends knows nothing about my other groups.  And so on.</p>\n\n<p>Some people make a few life-long friends in High School, but that’s pretty rare, I think.  More common are people who part ways, and then meet again after college, and find that they once again enjoy each others’ company.  Far more common than that, though, are people who branch off after high school, and never look back, (except when they get a friend request on Facebook, that is, and even then it’s just a bit of <q>Oh, you’re doing good?  Me, too.  You hear Joe had a kid? Yeah, I know.  Well, take care!</q> and then they go back to doing their own separate lives again.)</p>\n\n<p>In college, things generally change.  Some kids keep experimenting with different faces for a while, but at some point, they realize that they’re going to have to be grown-ups, and they’re hopefully faced with enough challenging work that the games get to be less relevant.  When you have to keep a C+ average to stay on the football team and keep your scholarship, it doesn’t make much sense to be mean to nerds.  The adults around you gradually stop telling you what to do, and instead tell you to pick what <em>you</em> want to do.  The depth of our social interaction changes, as well.  People date in high school; in college, people get married and have kids.  (Not many of them any more, but we all probably knew someone who graduated pregnant.  I was born while my parents were both students at USD.)</p>\n\n<p>When you get out of college, they stop telling you to pick what you want to do.  If you don’t want to do it, you don’t.  The relationships are as deep or meaningless as you want them to be.  You’re limited only by your own imagination.</p>\n\n<p>I think that, today, we’re somewhere close to the highschool/college cusp.  If the web is a child, it’s about 16; just got its drivers’ license, but still doesn’t have anywhere really worthwhile to go.  The most interesting aspects of the web’s maturation are, in my opinion:</p>\n\n<ol><li>\n\nConsistent, user-owned identity, which doesn’t change from place to place.  I’m talking about OpenID, but OpenID is just part of the solution.  OpenID is a name, but identity is also a whole brand.  We’re not quite there yet, but the OpenSocial API specification and Facebook’s opening up of their APIs promises to lead towards some portability.  And of course, there’s <a href=\"http://www.ownyouridentity.com/\">Own Your Identity</a> and their yet-to-be released <a href=\"http://chi.mp\">Chi.mp</a> product, which looks very interesting.  I’m definitely keeping my eye on that.\n\nThe challenge will be to eliminate the management overhead of multiple personas, without eliminating the expressive power it affords.  Your profile on LinkedIn might not be quite the same as your profile on bdsm-speed-dating.com.  Without user-controlled privacy, there’s no ownership in any meaningful sense, and thus, limited relevance.  And, if it’s not easy, it’s not a solution.\n\n</li>\n    <li>\n\nMany shallow social networks merging into a single rich matrix.  While each site may only have one concept of “friend”, every one of their implications are a little different, and when I can link them all up to a single point of identification, it becomes very powerful and expressive.  Just as you can have coworkers, friends, and family, and some coworkers are friends, some friends are family, and so on; if identity was user-owned and consistent, I’d be able to have twitter friends, some of whom I’m also connected to on Flickr, or talk to on IM, and so on.  That social matrix exists today, but it’s very difficult to leverage.\n\nIt’s yet to be shown (or even, fully conceived) what kind of information and usefulness can be teased out of this matrix.  First, we need straightforward protocols to get at the data, and then I think we’ll all be surprised at how it can be used to enrich our lives.\n\n</li>\n</ol><p>That’s really what it’s all about: enriching the quality of our lives.  People like to bitch about technology, but I think that’s just because people like to bitch.  Remember in 1990, when you didn’t have a cell phone?  What a compete and utter pain in the ass it was to meet someone at the movie theater?  Remember when, if you wanted to show someone a document, you had to print it out—or, worse yet, <em>photocopy</em> it—and physically bring it to them?  <small>These are my “uphill both ways in the snow” stories for future generations.</small></p>\n\n<p>The fact is, these things <em>do</em> make our lives better, overall, even with the new ways that we find to get annoyed by them.  I’m very excited about what the Internet will look like when it’s all grown up.</p>",
        "tree_html": ""
    },
    "reblog_key": "DTvctW1Y",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWy8lWmY",
    "slug": "the-internet-is-today-a-16-year-old-child",
    "state": "published",
    "summary": "The Internet is (today) a 16 year old child",
    "tags": [
        "20/20 Hindsight",
        "Bright Ideas Not Yet Realized",
        "Identity"
    ],
    "timestamp": 1212301723,
    "title": "The Internet is (today) a 16 year old child",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p>The web today is in its teenage years.</p>\n\n<p>When you were a baby, you had one name (if even that, as far as you were concerned), and a very small network of people that you knew and trusted completely.  Access equals trust for a baby.  Identity is not worth thinking about, because it&rsquo;s so simple.  Exploration is everything, and while every step is clumsy and every word garbled, it&rsquo;s all happening for the first time, so it&rsquo;s magnificent and beautiful.  Meaningful accomplishments happen almost daily, and every advance is huge.</p>\n\n<p>The advent of TCP/IP and the HTTP protocol; DNS protocols; the HTML language, and powerful browsers to interpret it; email; the migration of a bunch of different networks into a single over-arching network.  These were the internet&rsquo;s baby steps and first words.</p>\n\n<p>The web entered the &ldquo;I WANT&rdquo; phase of toddlerhood through the 90s.  Suddenly, the notion that you could actually BUY and SELL things on the web hit the fan. People made <strong>MONEY</strong>, and that opened up all these doors.  Everyone got crazy with the frenzy of it.  Venture capital poured into the valley, backed by the absolutely magical idea that advertisers&rsquo; budgets would grow as fast as online advertising space.  Instead, the simple and timeless rules of supply and demand kicked in, and the bubble burst.  The web got put on time-out, and pouted for a while about it.</p>\n\n<p>In the bubble, as in childhood, there were some fantasies crushed, and some lessons learned.  We got Yahoo and Google and Amazon out of that frenzy, and a bunch of other technologies and companies and insights that I&rsquo;m sure we&rsquo;re all really glad to have.  Pets.com didn&rsquo;t make it, but let&rsquo;s face it, Pets.com was pretty damn stupid.  <small>I pick on Pets.com unfairly, because it&rsquo;s one of the only failed bubble companies that I remember.  But I <strong>do</strong> remember Pets.com, and that&rsquo;s actually pretty respectable, compared to all the other failures that are completely forgotten.</small></p>\n\n<p>Between the bubble bursting and today, the web has been in Junior High.  Angsty, a bit more aware of the world, and just starting to make the first groping steps towards self-identification and social activity; but it&rsquo;s still essentially immature.  Friendster and Blogging and MySpace and Facebook got everyone realizing that the web really is a person-to-person thing, and not just a company-to-consumer thing.  And of course, there have been posers at the party, just trying to look and act like the popular kids to get attention.  You know the sites I mean.  It&rsquo;s a revolutionary new site!  It&rsquo;s got badges, and you can build a friend list!  Upload your avatar!  But you do that, and realize, there&rsquo;s nothing here.</p>\n\n<p>As in junior high, splitting the quality from the chaff is pretty tricky.  I didn&rsquo;t sign up for <a href=\"http://twitter.com\">Twitter</a> for a long while, just because I&rsquo;ve gotten burned by the early adopter tax too many times.  Yes, I know all these sites don&rsquo;t cost money, but they do cost time, and that&rsquo;s a limited resource.  If I sign up and enter my info and upload an avatar and find my friends, and then never use the site, I&rsquo;ve just wasted a lot of time.  And it&rsquo;s not fun enough to justify the expense.</p>\n\n<p>The High School years, and especially the &ldquo;tweens&rdquo; from about 9 to 13, are often marked by exactly this sort of constant self re-invention, but it&rsquo;s very superficial.  You identify with a tribe based on music, or hair styles, or clothing.  It&rsquo;s practice for the real world when no one will establish our identities for us.  Since they don&rsquo;t really understand yet who they are as people, or what kinds of people they really want to be around long-term, kids in this age tend to get by with trial and error.  Before this age, children don&rsquo;t really &ldquo;own&rdquo; their identity; they are what their parents say they are.  By the time they get to High School, they&rsquo;re driving the identity ship, even if they do sail it around in circles.</p>\n\n<p>The &ldquo;social networking&rdquo; sites, even the <a href=\"http://linkedin.com\">more</a> <a href=\"http://twitter.com\">useful</a> or <a href=\"http://myspace.com\">popular</a> <a href=\"http://facebook.com\">ones</a>, are essentially shallow.  There is a concept of a &ldquo;friend&rdquo;, and that&rsquo;s it.  Either we are friends, or we aren&rsquo;t; maybe there&rsquo;s 2 or 3 groups that I can put my friends in, but that&rsquo;s just 2 or 3 binary choices instead of 1&mdash;there&rsquo;s still very little richness.  We need to invent our identity and pick our clothes every time we want to use a website.  Without a lot of formal introductions, this group of friends knows nothing about my other groups.  And so on.</p>\n\n<p>Some people make a few life-long friends in High School, but that&rsquo;s pretty rare, I think.  More common are people who part ways, and then meet again after college, and find that they once again enjoy each others&rsquo; company.  Far more common than that, though, are people who branch off after high school, and never look back, (except when they get a friend request on Facebook, that is, and even then it&rsquo;s just a bit of Oh, you&rsquo;re doing good?  Me, too.  You hear Joe had a kid? Yeah, I know.  Well, take care! and then they go back to doing their own separate lives again.)</p>\n\n<p>In college, things generally change.  Some kids keep experimenting with different faces for a while, but at some point, they realize that they&rsquo;re going to have to be grown-ups, and they&rsquo;re hopefully faced with enough challenging work that the games get to be less relevant.  When you have to keep a C+ average to stay on the football team and keep your scholarship, it doesn&rsquo;t make much sense to be mean to nerds.  The adults around you gradually stop telling you what to do, and instead tell you to pick what <em>you</em> want to do.  The depth of our social interaction changes, as well.  People date in high school; in college, people get married and have kids.  (Not many of them any more, but we all probably knew someone who graduated pregnant.  I was born while my parents were both students at USD.)</p>\n\n<p>When you get out of college, they stop telling you to pick what you want to do.  If you don&rsquo;t want to do it, you don&rsquo;t.  The relationships are as deep or meaningless as you want them to be.  You&rsquo;re limited only by your own imagination.</p>\n\n<p>I think that, today, we&rsquo;re somewhere close to the highschool/college cusp.  If the web is a child, it&rsquo;s about 16; just got its drivers&rsquo; license, but still doesn&rsquo;t have anywhere really worthwhile to go.  The most interesting aspects of the web&rsquo;s maturation are, in my opinion:</p>\n\n<ol><li>\n\nConsistent, user-owned identity, which doesn&rsquo;t change from place to place.  I&rsquo;m talking about OpenID, but OpenID is just part of the solution.  OpenID is a name, but identity is also a whole brand.  We&rsquo;re not quite there yet, but the OpenSocial API specification and Facebook&rsquo;s opening up of their APIs promises to lead towards some portability.  And of course, there&rsquo;s <a href=\"http://www.ownyouridentity.com/\">Own Your Identity</a> and their yet-to-be released <a href=\"http://chi.mp\">Chi.mp</a> product, which looks very interesting.  I&rsquo;m definitely keeping my eye on that.\n\nThe challenge will be to eliminate the management overhead of multiple personas, without eliminating the expressive power it affords.  Your profile on LinkedIn might not be quite the same as your profile on bdsm-speed-dating.com.  Without user-controlled privacy, there&rsquo;s no ownership in any meaningful sense, and thus, limited relevance.  And, if it&rsquo;s not easy, it&rsquo;s not a solution.\n\n</li>\n    <li>\n\nMany shallow social networks merging into a single rich matrix.  While each site may only have one concept of &ldquo;friend&rdquo;, every one of their implications are a little different, and when I can link them all up to a single point of identification, it becomes very powerful and expressive.  Just as you can have coworkers, friends, and family, and some coworkers are friends, some friends are family, and so on; if identity was user-owned and consistent, I&rsquo;d be able to have twitter friends, some of whom I&rsquo;m also connected to on Flickr, or talk to on IM, and so on.  That social matrix exists today, but it&rsquo;s very difficult to leverage.\n\nIt&rsquo;s yet to be shown (or even, fully conceived) what kind of information and usefulness can be teased out of this matrix.  First, we need straightforward protocols to get at the data, and then I think we&rsquo;ll all be surprised at how it can be used to enrich our lives.\n\n</li>\n</ol><p>That&rsquo;s really what it&rsquo;s all about: enriching the quality of our lives.  People like to bitch about technology, but I think that&rsquo;s just because people like to bitch.  Remember in 1990, when you didn&rsquo;t have a cell phone?  What a compete and utter pain in the ass it was to meet someone at the movie theater?  Remember when, if you wanted to show someone a document, you had to print it out&mdash;or, worse yet, <em>photocopy</em> it&mdash;and physically bring it to them?  <small>These are my &ldquo;uphill both ways in the snow&rdquo; stories for future generations.</small></p>\n\n<p>The fact is, these things <em>do</em> make our lives better, overall, even with the new ways that we find to get annoyed by them.  I&rsquo;m very excited about what the Internet will look like when it&rsquo;s all grown up.</p>",
            "content_raw": "<p>The web today is in its teenage years.</p>\n\n<p>When you were a baby, you had one name (if even that, as far as you were concerned), and a very small network of people that you knew and trusted completely.  Access equals trust for a baby.  Identity is not worth thinking about, because it’s so simple.  Exploration is everything, and while every step is clumsy and every word garbled, it’s all happening for the first time, so it’s magnificent and beautiful.  Meaningful accomplishments happen almost daily, and every advance is huge.</p>\n\n<p>The advent of TCP/IP and the HTTP protocol; DNS protocols; the HTML language, and powerful browsers to interpret it; email; the migration of a bunch of different networks into a single over-arching network.  These were the internet’s baby steps and first words.</p>\n\n<p>The web entered the “I WANT” phase of toddlerhood through the 90s.  Suddenly, the notion that you could actually BUY and SELL things on the web hit the fan. People made <strong style=\"color:green\">MONEY</strong>, and that opened up all these doors.  Everyone got crazy with the frenzy of it.  Venture capital poured into the valley, backed by the absolutely magical idea that advertisers’ budgets would grow as fast as online advertising space.  Instead, the simple and timeless rules of supply and demand kicked in, and the bubble burst.  The web got put on time-out, and pouted for a while about it.</p>\n\n<p>In the bubble, as in childhood, there were some fantasies crushed, and some lessons learned.  We got Yahoo and Google and Amazon out of that frenzy, and a bunch of other technologies and companies and insights that I’m sure we’re all really glad to have.  Pets.com didn’t make it, but let’s face it, Pets.com was pretty damn stupid.  <small>I pick on Pets.com unfairly, because it’s one of the only failed bubble companies that I remember.  But I <strong>do</strong> remember Pets.com, and that’s actually pretty respectable, compared to all the other failures that are completely forgotten.</small></p>\n\n<p>Between the bubble bursting and today, the web has been in Junior High.  Angsty, a bit more aware of the world, and just starting to make the first groping steps towards self-identification and social activity; but it’s still essentially immature.  Friendster and Blogging and MySpace and Facebook got everyone realizing that the web really is a person-to-person thing, and not just a company-to-consumer thing.  And of course, there have been posers at the party, just trying to look and act like the popular kids to get attention.  You know the sites I mean.  <q>It’s a revolutionary new site!  It’s got badges, and you can build a friend list!  Upload your avatar!</q>  But you do that, and realize, <q>there’s nothing here</q>.</p>\n\n<p>As in junior high, splitting the quality from the chaff is pretty tricky.  I didn’t sign up for <a href=\"http://twitter.com\">Twitter</a> for a long while, just because I’ve gotten burned by the early adopter tax too many times.  Yes, I know all these sites don’t cost money, but they do cost time, and that’s a limited resource.  If I sign up and enter my info and upload an avatar and find my friends, and then never use the site, I’ve just wasted a lot of time.  And it’s not fun enough to justify the expense.</p>\n\n<p>The High School years, and especially the “tweens” from about 9 to 13, are often marked by exactly this sort of constant self re-invention, but it’s very superficial.  You identify with a tribe based on music, or hair styles, or clothing.  It’s practice for the real world when no one will establish our identities for us.  Since they don’t really understand yet who they are as people, or what kinds of people they really want to be around long-term, kids in this age tend to get by with trial and error.  Before this age, children don’t really “own” their identity; they are what their parents say they are.  By the time they get to High School, they’re driving the identity ship, even if they do sail it around in circles.</p>\n\n<p>The “social networking” sites, even the <a href=\"http://linkedin.com\">more</a> <a href=\"http://twitter.com\">useful</a> or <a href=\"http://myspace.com\">popular</a> <a href=\"http://facebook.com\">ones</a>, are essentially shallow.  There is a concept of a “friend”, and that’s it.  Either we are friends, or we aren’t; maybe there’s 2 or 3 groups that I can put my friends in, but that’s just 2 or 3 binary choices instead of 1—there’s still very little richness.  We need to invent our identity and pick our clothes every time we want to use a website.  Without a lot of formal introductions, this group of friends knows nothing about my other groups.  And so on.</p>\n\n<p>Some people make a few life-long friends in High School, but that’s pretty rare, I think.  More common are people who part ways, and then meet again after college, and find that they once again enjoy each others’ company.  Far more common than that, though, are people who branch off after high school, and never look back, (except when they get a friend request on Facebook, that is, and even then it’s just a bit of <q>Oh, you’re doing good?  Me, too.  You hear Joe had a kid? Yeah, I know.  Well, take care!</q> and then they go back to doing their own separate lives again.)</p>\n\n<p>In college, things generally change.  Some kids keep experimenting with different faces for a while, but at some point, they realize that they’re going to have to be grown-ups, and they’re hopefully faced with enough challenging work that the games get to be less relevant.  When you have to keep a C+ average to stay on the football team and keep your scholarship, it doesn’t make much sense to be mean to nerds.  The adults around you gradually stop telling you what to do, and instead tell you to pick what <em>you</em> want to do.  The depth of our social interaction changes, as well.  People date in high school; in college, people get married and have kids.  (Not many of them any more, but we all probably knew someone who graduated pregnant.  I was born while my parents were both students at USD.)</p>\n\n<p>When you get out of college, they stop telling you to pick what you want to do.  If you don’t want to do it, you don’t.  The relationships are as deep or meaningless as you want them to be.  You’re limited only by your own imagination.</p>\n\n<p>I think that, today, we’re somewhere close to the highschool/college cusp.  If the web is a child, it’s about 16; just got its drivers’ license, but still doesn’t have anywhere really worthwhile to go.  The most interesting aspects of the web’s maturation are, in my opinion:</p>\n\n<ol><li>\n\nConsistent, user-owned identity, which doesn’t change from place to place.  I’m talking about OpenID, but OpenID is just part of the solution.  OpenID is a name, but identity is also a whole brand.  We’re not quite there yet, but the OpenSocial API specification and Facebook’s opening up of their APIs promises to lead towards some portability.  And of course, there’s <a href=\"http://www.ownyouridentity.com/\">Own Your Identity</a> and their yet-to-be released <a href=\"http://chi.mp\">Chi.mp</a> product, which looks very interesting.  I’m definitely keeping my eye on that.\n\nThe challenge will be to eliminate the management overhead of multiple personas, without eliminating the expressive power it affords.  Your profile on LinkedIn might not be quite the same as your profile on bdsm-speed-dating.com.  Without user-controlled privacy, there’s no ownership in any meaningful sense, and thus, limited relevance.  And, if it’s not easy, it’s not a solution.\n\n</li>\n    <li>\n\nMany shallow social networks merging into a single rich matrix.  While each site may only have one concept of “friend”, every one of their implications are a little different, and when I can link them all up to a single point of identification, it becomes very powerful and expressive.  Just as you can have coworkers, friends, and family, and some coworkers are friends, some friends are family, and so on; if identity was user-owned and consistent, I’d be able to have twitter friends, some of whom I’m also connected to on Flickr, or talk to on IM, and so on.  That social matrix exists today, but it’s very difficult to leverage.\n\nIt’s yet to be shown (or even, fully conceived) what kind of information and usefulness can be teased out of this matrix.  First, we need straightforward protocols to get at the data, and then I think we’ll all be surprised at how it can be used to enrich our lives.\n\n</li>\n</ol><p>That’s really what it’s all about: enriching the quality of our lives.  People like to bitch about technology, but I think that’s just because people like to bitch.  Remember in 1990, when you didn’t have a cell phone?  What a compete and utter pain in the ass it was to meet someone at the movie theater?  Remember when, if you wanted to show someone a document, you had to print it out—or, worse yet, <em>photocopy</em> it—and physically bring it to them?  <small>These are my “uphill both ways in the snow” stories for future generations.</small></p>\n\n<p>The fact is, these things <em>do</em> make our lives better, overall, even with the new ways that we find to get annoyed by them.  I’m very excited about what the Internet will look like when it’s all grown up.</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "146672674"
            }
        }
    ],
    "type": "text"
}