{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544051896,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>Get ready, I&rsquo;m about to offend almost everyone. (Except atheists.) Chasing the TeaL DeeR&hellip;</p>\n\n<p>Having a firm belief in a &ldquo;higher power&rdquo; smelled funny to me from a pretty early age. I could never find any non-contradictory evidence, and it seemed like a pretty fantastic set of ideas to buy into. I guess you could say that I was a soft atheist (aka agnostic) as early as 10 years old, and my acceptance of God gradually faded as I learned to distinguish reality from fiction.</p>\n\n<p>The thing that struck me as very odd around that time is that I started to realize that other people – adults – they <em>actually believed this shit</em>. When my grandmother told me that Santa lives in the North Pole, and when she told me that Jesus lives in Heaven, I heard two statements that were in roughly the same category. But for her, one was make-believe, and the other history. Between 10 and 12, this very strange cognitive dissonance started to dawn on me, and it troubled me greatly.</p>\n\n<p>Also around that time, I realized that people didn&rsquo;t just <em>believe</em> in God; they formed <em>teams</em> around what they believed about God, and they based their lives around it. I had friends who were Protestants, and they didn&rsquo;t have to go to Catechism after school. I had other friends who were Jewish, and they had Chanukah instead of Christmas. (Some of them had Christmas too, and Santa.)</p>\n\n<p>Luckily for me, my parents were kind of hippies, despite (or maybe because of) both being brought up Catholic. My dad is the kind of atheist that we&rsquo;d all be if there was no such thing as religion. He just doesn&rsquo;t think about it, doesn&rsquo;t talk about it, doesn&rsquo;t care about it. He is spiritual, but God isn&rsquo;t involved even a little. My mother calls herself a Christian, but doesn&rsquo;t affiliate herself with any particular denomination. She believes in &ldquo;some kind of higher power&rdquo;, but she thought it was important for us to &ldquo;find our own paths and learn about ourselves&rdquo; and all that jazz.</p>\n\n<p>Turns out, &ldquo;find your own path and form your own belief&rdquo; is a good way to ensure your kid is an atheist. If they&rsquo;re not in the fold by 21, they&rsquo;re probably lost for good.</p>\n\n<p>So, in middle school and high school, when kids normally start identifying with various teams and forming their sense of self around labels, I became very curious about religion. I knew that there was something deeply wrong with my grandmother&rsquo;s fervent Catholicism, but I really didn&rsquo;t get why someone would believe those things. I figured I must be missing something.</p>\n\n<p>I wasn&rsquo;t. It&rsquo;s stupid. That&rsquo;s really all there is to it. But religion&rsquo;s unique <em>kind</em> of stupid is important, and it wasn&rsquo;t until a few years later that I saw it.</p>\n\n<p>We are not solitary animals. A lone human is like a lone ant—not long for this world. Evolutionary biology has a funny way of imbuing us with instincts and ideas and feelings that help ensure survival and crush our rivals in the dangerous time of our near-extinction. However, in modern times, when those feelings no longer make sense, we still have them. Sex feels good, even when you&rsquo;re not procreating. Fat tastes good, even when you don&rsquo;t need to hoard calories. And so on.</p>\n\n<p>These ideas about God and Jesus and the Bible and whatnot, I realized, got into peoples&rsquo; heads just to keep them in the group. I realized this in high school, and it was a pretty pivotal point in my spiritual growth.</p>\n\n<p>I was at a concert when I had this revelation, for a local band in New Haven that wasn&rsquo;t very good, called the Venus Vixens. &ldquo;Wasn&rsquo;t very good&rdquo; is quite generous. I went outside because they were so unbearably terrible. I would have left if I&rsquo;d been old enough to have driven there. I started to wonder why I&rsquo;d come and paid money for this band I couldn&rsquo;t stand.</p>\n\n<p>I couldn&rsquo;t claim ignorance, either. I knew I couldn&rsquo;t stand them before I&rsquo;d agreed to go, because I&rsquo;d heard one of their tapes already! And when a friend of mine asked if I wanted to come with them, and if I liked the band, I <em>lied and said that I thought they were good!</em> I&rsquo;d heard the words coming out of my mouth, and had thought, &ldquo;No, I don&rsquo;t. They&rsquo;re terrible. What the fuck am I doing?&rdquo;</p>\n\n<p>(Interestingly enough, The Offspring were the opening band, and they were even worse back then than they are now. A few years later when I saw them on MTV, I couldn&rsquo;t believe it.)</p>\n\n<p>So there I was, standing on Center Street outside the Tune Inn, walking to the Dunkin&rsquo; Donuts on the corner to pass the time until the show was over, wondering about why I was such a damned putz. The humbling fact was apparent: I&rsquo;d claimed a fact that was untrue about myself solely to belong to a group of people. And we were the freaks and nerds, the outcasts! We were supposed to be ok with being different, for crying out loud!</p>\n\n<p>The second worst social attack that one teenager can use against another is to make them seem like they&rsquo;re not part of the group. &ldquo;You don&rsquo;t like the same zoodads that we like. You&rsquo;re not one of us.&rdquo; The pressure to like the same things that the group likes is powerful, subconscious, and instinctual. It is the most primal glue that bonds us, and as children, we aren&rsquo;t sophisticated to have any other kind.</p>\n\n<p>So, the <em>worst</em> insult that one teenager can lay on another is that of &ldquo;poser&rdquo;, someone who pretends to like something even though they don&rsquo;t really. That&rsquo;s like calling someone an outsider and a traitor all at once. This is such a damaging insult, such a vicious slur against one&rsquo;s character, that most kids would do almost anything to send the signals that they are genuine in their appreciation for the band, or the style, or whatever.</p>\n\n<p>When you pretend to believe something, and pretend diligently enough, you&rsquo;ll start to really believe it. Sitting there in Dunkin&rsquo; Donuts with some muttering crackhead in downtown New Haven outside an unlistenable punk show, I realized that the only argument for believing in God is that you&rsquo;ll have friends who believe the same things you do, just like my alleged appreciation for the Venus Vixens had brought me to a terrible punk show. It kinda grossed me out to see that in myself.</p>\n\n<p>Since then, I&rsquo;ve learned a lot of philosophy. I&rsquo;ve learned about the infinity paradoxes. I&rsquo;ve learned about the problems with the ontological &ldquo;proof&rdquo;. I&rsquo;ve learned about Pascal&rsquo;s Wager, and shown its failure in a variety of different ways. I&rsquo;ve learned about the formal and technical applications of Occam&rsquo;s Razer. I&rsquo;ve learned about spirituality and meditation. I&rsquo;ve taken a wide array of psychotropic drugs (and it wasn&rsquo;t experimentation most of the time, I knew <em>exactly</em> what would happen). I&rsquo;ve learned about the history of the Bible. I&rsquo;ve studied the space teacups and the flying spaghetti monsters. I&rsquo;ve read Dawkins and Harris and Rand and Russel. I&rsquo;ve learned about evolution and cosmology.</p>\n\n<p>There is no need for God. In fact, it raises a lot more problems that it solves. It is my belief that &ldquo;friends who believe&rdquo; remains the solitary compelling reason that people can and do convince themselves to believe in a higher power. There&rsquo;s more to it, of course. There&rsquo;s agent fixation, and the tendency of children to believe just about <em>anything</em> their elders tell them, and a bunch of other cognitive mistakes that are usually evolutionarily advantageous. But groupthink seems like the biggest contender.</p>\n\n<p>I can&rsquo;t accept a belief just because it&rsquo;s what the crowd believes. That kind of idea—and more importantly, that method of choosing ideas—while perhaps important for our ancestors, is dangerous, wrong, and <em>evil</em>. If anything, I tend to be especially suspicious of the things that &ldquo;everybody knows,&rdquo; precisely because they tend to get less criticism, so we need to make the extra effort.</p>\n\n<p>I&rsquo;m very confident that there is no God, no woowoo energies, no angels and fairies and devils, no afterlife, no unicorns, no super powers. That being said, I have a lot of respect for many different kinds of cognitive distortions. In a previous post, I wrote about the concept of &ldquo;energy&rdquo; or &ldquo;chi&rdquo; – sometimes the model might be wrong, but the phenomenon may still be worth investigating.</p>\n\n<p>Groupthink is never ok, and it is an insidious error. By comparison, I can definitely respect someone for stopping at agnosticism. I&rsquo;ve seen two common arguments for agnosticism; one is defensible in my opinion, the other is not.</p>\n\n<h2>1. It seems possible to me that &hellip;</h2>\n\n<p>A lot of things might seem possible that in fact aren&rsquo;t. &ldquo;Possibility&rdquo; is a statement about our mental model, not a statement about the universe. It &ldquo;seemed possible&rdquo; to the writers, cast, and many viewers of CSI that the line <a href=\"http://www.google.com/search?q=create+a+gui+interface+using+visual+basic%2C+see+if+i+can+track+an+IP+address\">&ldquo;I&rsquo;ll create a GUI interface using VisualBasic, see if I can track an IP address&rdquo;</a> was a reasonable thing that a computer hacker might say about tracking down a criminal. As a programmer, I laughed my ass off.</p>\n\n<p>Not everyone has time to burn on studying the arguments for and against. And expertise is hard to come by on this topic. Many apparent experts are clearly quacks, and many others disagree with one another, so who should you believe? And really, how much does it matter? Not having an opinion on the subject of God is rational, just as it&rsquo;s rational to not have an opinion on &ldquo;GUI interfaces using VisualBasic&rdquo; that are used to &ldquo;track an IP address&rdquo;. There are plenty of important topics that I have no opinion about, or where I&rsquo;ll freely admit that my opinion is mostly useless.</p>\n\n<h2>2. It&rsquo;s not a black and white issue.</h2>\n\n<p>That&rsquo;s a bit of malarky, if you ask me. Either there is a God or there isn&rsquo;t. I&rsquo;ve never gotten a straight answer on how this really could make sense, and I suspect that it&rsquo;s a softer form of social-think. In other words, it translates to &ldquo;God doesn&rsquo;t make sense to me, but I&rsquo;m not quite sure I want to anger the other apes, so I&rsquo;m taking a less controversial position.&rdquo;</p>\n\n<p>I&rsquo;ve seen this &ldquo;absolutes are bad&rdquo; ideology taken to extreme (and self-defeating!) zealotry. I&rsquo;ve been told that I&rsquo;m &ldquo;just as bad as religious fundamentalists&rdquo; because of my atheism. (Really? <em>Just as bad?</em> How many atheists kill their daughters for the &ldquo;crime&rdquo; of having been raped, or blow up abortion clinics, or prevent life-saving medical treatments for their children?)</p>\n\n<p>Gray-worship is deeply problematic. &ldquo;Undecided&rdquo; is the place to be when ignorant and without a trustworthy expert. But the avoidance of firm opinions because they are firm is foolish, and equating all firm opinions as equally wrong is a wild perversion of &ldquo;open mindedness&rdquo;. I usually try to point out the contradictory nature of this fundamentalist anti-fundamentalism. I don&rsquo;t buy the premise that &ldquo;all ideas are fuzzy except this one.&rdquo;</p>\n\n<p>This might strike some as improper or overly harsh: if you are religious, at least in the traditional western sense, and serious about it, then I could probably never date you, and even our level of friendship would be capped somewhere just above &ldquo;friendly acquaintance&rdquo; at best. It&rsquo;s not that I have any disdain for religious people. I try not to blame the victim, since many of these mistakes are so very easy to slip into. This is a prediction more than a prescription. We just won&rsquo;t click.</p>\n\n<p>It&rsquo;s not about having to agree; in fact, some of my best friends are agnostic, and many of them have very different ideas about a lot of things than I do. If anything, it&rsquo;s about being able to disagree. That&rsquo;s another problem with gray worship: if there are no absolutes, then we can&rsquo;t disagree, can we?</p>\n\n<p>Let&rsquo;s not &ldquo;agree to disagree&rdquo;; instead, let&rsquo;s <em>actually disagree</em>, and chew on it. If you&rsquo;re not willing and able to think &ldquo;wrong&rdquo; thoughts, to collide ideas against one another, then where&rsquo;s the growth? If some ideas are off-limits, then where&rsquo;s the innovation? If that&rsquo;s not your cup of tea, we probably just won&rsquo;t get along.</p>\n\n<p>We all occasionally hide from our true selves under the warm blanket of the hive mind. But as responsible rational animals, we ought to strive to be vigilant against this distortion, and eagerly cut through that blanket whenever we notice it. When we hide from our true selves, we are living less fully.</p>\n\n<p>Living less fully means being less alive.</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2009-08-17 17:00:52 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 164992519,
    "is_blocks_post_format": false,
    "note_count": 4,
    "post_url": "http://blog.izs.me/post/164992519/atheism-and-groupthink",
    "reblog": {
        "comment": "<p>Get ready, I’m about to offend almost everyone. (Except atheists.) Chasing the TeaL DeeR…</p>\n\n<p>Having a firm belief in a “higher power” smelled funny to me from a pretty early age. I could never find any non-contradictory evidence, and it seemed like a pretty fantastic set of ideas to buy into. I guess you could say that I was a soft atheist (aka agnostic) as early as 10 years old, and my acceptance of God gradually faded as I learned to distinguish reality from fiction.</p>\n\n<p>The thing that struck me as very odd around that time is that I started to realize that other people – adults – they <em>actually believed this shit</em>. When my grandmother told me that Santa lives in the North Pole, and when she told me that Jesus lives in Heaven, I heard two statements that were in roughly the same category. But for her, one was make-believe, and the other history. Between 10 and 12, this very strange cognitive dissonance started to dawn on me, and it troubled me greatly.</p>\n\n<p>Also around that time, I realized that people didn’t just <em>believe</em> in God; they formed <em>teams</em> around what they believed about God, and they based their lives around it. I had friends who were Protestants, and they didn’t have to go to Catechism after school. I had other friends who were Jewish, and they had Chanukah instead of Christmas. (Some of them had Christmas too, and Santa.)</p>\n\n<p>Luckily for me, my parents were kind of hippies, despite (or maybe because of) both being brought up Catholic. My dad is the kind of atheist that we’d all be if there was no such thing as religion. He just doesn’t think about it, doesn’t talk about it, doesn’t care about it. He is spiritual, but God isn’t involved even a little. My mother calls herself a Christian, but doesn’t affiliate herself with any particular denomination. She believes in “some kind of higher power”, but she thought it was important for us to “find our own paths and learn about ourselves” and all that jazz.</p>\n\n<p>Turns out, “find your own path and form your own belief” is a good way to ensure your kid is an atheist. If they’re not in the fold by 21, they’re probably lost for good.</p>\n\n<p>So, in middle school and high school, when kids normally start identifying with various teams and forming their sense of self around labels, I became very curious about religion. I knew that there was something deeply wrong with my grandmother’s fervent Catholicism, but I really didn’t get why someone would believe those things. I figured I must be missing something.</p>\n\n<p>I wasn’t. It’s stupid. That’s really all there is to it. But religion’s unique <em>kind</em> of stupid is important, and it wasn’t until a few years later that I saw it.</p>\n\n<p>We are not solitary animals. A lone human is like a lone ant—not long for this world. Evolutionary biology has a funny way of imbuing us with instincts and ideas and feelings that help ensure survival and crush our rivals in the dangerous time of our near-extinction. However, in modern times, when those feelings no longer make sense, we still have them. Sex feels good, even when you’re not procreating. Fat tastes good, even when you don’t need to hoard calories. And so on.</p>\n\n<p>These ideas about God and Jesus and the Bible and whatnot, I realized, got into peoples’ heads just to keep them in the group. I realized this in high school, and it was a pretty pivotal point in my spiritual growth.</p>\n\n<p>I was at a concert when I had this revelation, for a local band in New Haven that wasn’t very good, called the Venus Vixens. “Wasn’t very good” is quite generous. I went outside because they were so unbearably terrible. I would have left if I’d been old enough to have driven there. I started to wonder why I’d come and paid money for this band I couldn’t stand.</p>\n\n<p>I couldn’t claim ignorance, either. I knew I couldn’t stand them before I’d agreed to go, because I’d heard one of their tapes already! And when a friend of mine asked if I wanted to come with them, and if I liked the band, I <em>lied and said that I thought they were good!</em> I’d heard the words coming out of my mouth, and had thought, “No, I don’t. They’re terrible. What the fuck am I doing?”</p>\n\n<p>(Interestingly enough, The Offspring were the opening band, and they were even worse back then than they are now. A few years later when I saw them on MTV, I couldn’t believe it.)</p>\n\n<p>So there I was, standing on Center Street outside the Tune Inn, walking to the Dunkin’ Donuts on the corner to pass the time until the show was over, wondering about why I was such a damned putz. The humbling fact was apparent: I’d claimed a fact that was untrue about myself solely to belong to a group of people. And we were the freaks and nerds, the outcasts! We were supposed to be ok with being different, for crying out loud!</p>\n\n<p>The second worst social attack that one teenager can use against another is to make them seem like they’re not part of the group. “You don’t like the same zoodads that we like. You’re not one of us.” The pressure to like the same things that the group likes is powerful, subconscious, and instinctual. It is the most primal glue that bonds us, and as children, we aren’t sophisticated to have any other kind.</p>\n\n<p>So, the <em>worst</em> insult that one teenager can lay on another is that of “poser”, someone who pretends to like something even though they don’t really. That’s like calling someone an outsider and a traitor all at once. This is such a damaging insult, such a vicious slur against one’s character, that most kids would do almost anything to send the signals that they are genuine in their appreciation for the band, or the style, or whatever.</p>\n\n<p>When you pretend to believe something, and pretend diligently enough, you’ll start to really believe it. Sitting there in Dunkin’ Donuts with some muttering crackhead in downtown New Haven outside an unlistenable punk show, I realized that the only argument for believing in God is that you’ll have friends who believe the same things you do, just like my alleged appreciation for the Venus Vixens had brought me to a terrible punk show. It kinda grossed me out to see that in myself.</p>\n\n<p>Since then, I’ve learned a lot of philosophy. I’ve learned about the infinity paradoxes. I’ve learned about the problems with the ontological “proof”. I’ve learned about Pascal’s Wager, and shown its failure in a variety of different ways. I’ve learned about the formal and technical applications of Occam’s Razer. I’ve learned about spirituality and meditation. I’ve taken a wide array of psychotropic drugs (and it wasn’t experimentation most of the time, I knew <em>exactly</em> what would happen). I’ve learned about the history of the Bible. I’ve studied the space teacups and the flying spaghetti monsters. I’ve read Dawkins and Harris and Rand and Russel. I’ve learned about evolution and cosmology.</p>\n\n<p>There is no need for God. In fact, it raises a lot more problems that it solves. It is my belief that “friends who believe” remains the solitary compelling reason that people can and do convince themselves to believe in a higher power. There’s more to it, of course. There’s agent fixation, and the tendency of children to believe just about <em>anything</em> their elders tell them, and a bunch of other cognitive mistakes that are usually evolutionarily advantageous. But groupthink seems like the biggest contender.</p>\n\n<p>I can’t accept a belief just because it’s what the crowd believes. That kind of idea—and more importantly, that method of choosing ideas—while perhaps important for our ancestors, is dangerous, wrong, and <em>evil</em>. If anything, I tend to be especially suspicious of the things that “everybody knows,” precisely because they tend to get less criticism, so we need to make the extra effort.</p>\n\n<p>I’m very confident that there is no God, no woowoo energies, no angels and fairies and devils, no afterlife, no unicorns, no super powers. That being said, I have a lot of respect for many different kinds of cognitive distortions. In a previous post, I wrote about the concept of “energy” or “chi” – sometimes the model might be wrong, but the phenomenon may still be worth investigating.</p>\n\n<p>Groupthink is never ok, and it is an insidious error. By comparison, I can definitely respect someone for stopping at agnosticism. I’ve seen two common arguments for agnosticism; one is defensible in my opinion, the other is not.</p>\n\n<h2>1. It seems possible to me that …</h2>\n\n<p>A lot of things might seem possible that in fact aren’t. “Possibility” is a statement about our mental model, not a statement about the universe. It “seemed possible” to the writers, cast, and many viewers of CSI that the line <a href=\"http://www.google.com/search?q=create+a+gui+interface+using+visual+basic%2C+see+if+i+can+track+an+IP+address\">“I’ll create a GUI interface using VisualBasic, see if I can track an IP address”</a> was a reasonable thing that a computer hacker might say about tracking down a criminal. As a programmer, I laughed my ass off.</p>\n\n<p>Not everyone has time to burn on studying the arguments for and against. And expertise is hard to come by on this topic. Many apparent experts are clearly quacks, and many others disagree with one another, so who should you believe? And really, how much does it matter? Not having an opinion on the subject of God is rational, just as it’s rational to not have an opinion on “GUI interfaces using VisualBasic” that are used to “track an IP address”. There are plenty of important topics that I have no opinion about, or where I’ll freely admit that my opinion is mostly useless.</p>\n\n<h2>2. It’s not a black and white issue.</h2>\n\n<p>That’s a bit of malarky, if you ask me. Either there is a God or there isn’t. I’ve never gotten a straight answer on how this really could make sense, and I suspect that it’s a softer form of social-think. In other words, it translates to “God doesn’t make sense to me, but I’m not quite sure I want to anger the other apes, so I’m taking a less controversial position.”</p>\n\n<p>I’ve seen this “absolutes are bad” ideology taken to extreme (and self-defeating!) zealotry. I’ve been told that I’m “just as bad as religious fundamentalists” because of my atheism. (Really? <em>Just as bad?</em> How many atheists kill their daughters for the “crime” of having been raped, or blow up abortion clinics, or prevent life-saving medical treatments for their children?)</p>\n\n<p>Gray-worship is deeply problematic. “Undecided” is the place to be when ignorant and without a trustworthy expert. But the avoidance of firm opinions because they are firm is foolish, and equating all firm opinions as equally wrong is a wild perversion of “open mindedness”. I usually try to point out the contradictory nature of this fundamentalist anti-fundamentalism. I don’t buy the premise that “all ideas are fuzzy except this one.”</p>\n\n<p>This might strike some as improper or overly harsh: if you are religious, at least in the traditional western sense, and serious about it, then I could probably never date you, and even our level of friendship would be capped somewhere just above “friendly acquaintance” at best. It’s not that I have any disdain for religious people. I try not to blame the victim, since many of these mistakes are so very easy to slip into. This is a prediction more than a prescription. We just won’t click.</p>\n\n<p>It’s not about having to agree; in fact, some of my best friends are agnostic, and many of them have very different ideas about a lot of things than I do. If anything, it’s about being able to disagree. That’s another problem with gray worship: if there are no absolutes, then we can’t disagree, can we?</p>\n\n<p>Let’s not “agree to disagree”; instead, let’s <em>actually disagree</em>, and chew on it. If you’re not willing and able to think “wrong” thoughts, to collide ideas against one another, then where’s the growth? If some ideas are off-limits, then where’s the innovation? If that’s not your cup of tea, we probably just won’t get along.</p>\n\n<p>We all occasionally hide from our true selves under the warm blanket of the hive mind. But as responsible rational animals, we ought to strive to be vigilant against this distortion, and eagerly cut through that blanket whenever we notice it. When we hide from our true selves, we are living less fully.</p>\n\n<p>Living less fully means being less alive.</p>",
        "tree_html": ""
    },
    "reblog_key": "v9L5Nou8",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWy9rPO7",
    "slug": "atheism-and-groupthink",
    "state": "published",
    "summary": "Atheism and Groupthink",
    "tags": [
        "atheism"
    ],
    "timestamp": 1250528452,
    "title": "Atheism and Groupthink ",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p>Get ready, I&rsquo;m about to offend almost everyone. (Except atheists.) Chasing the TeaL DeeR&hellip;</p>\n\n<p>Having a firm belief in a &ldquo;higher power&rdquo; smelled funny to me from a pretty early age. I could never find any non-contradictory evidence, and it seemed like a pretty fantastic set of ideas to buy into. I guess you could say that I was a soft atheist (aka agnostic) as early as 10 years old, and my acceptance of God gradually faded as I learned to distinguish reality from fiction.</p>\n\n<p>The thing that struck me as very odd around that time is that I started to realize that other people &ndash; adults &ndash; they <em>actually believed this shit</em>. When my grandmother told me that Santa lives in the North Pole, and when she told me that Jesus lives in Heaven, I heard two statements that were in roughly the same category. But for her, one was make-believe, and the other history. Between 10 and 12, this very strange cognitive dissonance started to dawn on me, and it troubled me greatly.</p>\n\n<p>Also around that time, I realized that people didn&rsquo;t just <em>believe</em> in God; they formed <em>teams</em> around what they believed about God, and they based their lives around it. I had friends who were Protestants, and they didn&rsquo;t have to go to Catechism after school. I had other friends who were Jewish, and they had Chanukah instead of Christmas. (Some of them had Christmas too, and Santa.)</p>\n\n<p>Luckily for me, my parents were kind of hippies, despite (or maybe because of) both being brought up Catholic. My dad is the kind of atheist that we&rsquo;d all be if there was no such thing as religion. He just doesn&rsquo;t think about it, doesn&rsquo;t talk about it, doesn&rsquo;t care about it. He is spiritual, but God isn&rsquo;t involved even a little. My mother calls herself a Christian, but doesn&rsquo;t affiliate herself with any particular denomination. She believes in &ldquo;some kind of higher power&rdquo;, but she thought it was important for us to &ldquo;find our own paths and learn about ourselves&rdquo; and all that jazz.</p>\n\n<p>Turns out, &ldquo;find your own path and form your own belief&rdquo; is a good way to ensure your kid is an atheist. If they&rsquo;re not in the fold by 21, they&rsquo;re probably lost for good.</p>\n\n<p>So, in middle school and high school, when kids normally start identifying with various teams and forming their sense of self around labels, I became very curious about religion. I knew that there was something deeply wrong with my grandmother&rsquo;s fervent Catholicism, but I really didn&rsquo;t get why someone would believe those things. I figured I must be missing something.</p>\n\n<p>I wasn&rsquo;t. It&rsquo;s stupid. That&rsquo;s really all there is to it. But religion&rsquo;s unique <em>kind</em> of stupid is important, and it wasn&rsquo;t until a few years later that I saw it.</p>\n\n<p>We are not solitary animals. A lone human is like a lone ant&mdash;not long for this world. Evolutionary biology has a funny way of imbuing us with instincts and ideas and feelings that help ensure survival and crush our rivals in the dangerous time of our near-extinction. However, in modern times, when those feelings no longer make sense, we still have them. Sex feels good, even when you&rsquo;re not procreating. Fat tastes good, even when you don&rsquo;t need to hoard calories. And so on.</p>\n\n<p>These ideas about God and Jesus and the Bible and whatnot, I realized, got into peoples&rsquo; heads just to keep them in the group. I realized this in high school, and it was a pretty pivotal point in my spiritual growth.</p>\n\n<p>I was at a concert when I had this revelation, for a local band in New Haven that wasn&rsquo;t very good, called the Venus Vixens. &ldquo;Wasn&rsquo;t very good&rdquo; is quite generous. I went outside because they were so unbearably terrible. I would have left if I&rsquo;d been old enough to have driven there. I started to wonder why I&rsquo;d come and paid money for this band I couldn&rsquo;t stand.</p>\n\n<p>I couldn&rsquo;t claim ignorance, either. I knew I couldn&rsquo;t stand them before I&rsquo;d agreed to go, because I&rsquo;d heard one of their tapes already! And when a friend of mine asked if I wanted to come with them, and if I liked the band, I <em>lied and said that I thought they were good!</em> I&rsquo;d heard the words coming out of my mouth, and had thought, &ldquo;No, I don&rsquo;t. They&rsquo;re terrible. What the fuck am I doing?&rdquo;</p>\n\n<p>(Interestingly enough, The Offspring were the opening band, and they were even worse back then than they are now. A few years later when I saw them on MTV, I couldn&rsquo;t believe it.)</p>\n\n<p>So there I was, standing on Center Street outside the Tune Inn, walking to the Dunkin&rsquo; Donuts on the corner to pass the time until the show was over, wondering about why I was such a damned putz. The humbling fact was apparent: I&rsquo;d claimed a fact that was untrue about myself solely to belong to a group of people. And we were the freaks and nerds, the outcasts! We were supposed to be ok with being different, for crying out loud!</p>\n\n<p>The second worst social attack that one teenager can use against another is to make them seem like they&rsquo;re not part of the group. &ldquo;You don&rsquo;t like the same zoodads that we like. You&rsquo;re not one of us.&rdquo; The pressure to like the same things that the group likes is powerful, subconscious, and instinctual. It is the most primal glue that bonds us, and as children, we aren&rsquo;t sophisticated to have any other kind.</p>\n\n<p>So, the <em>worst</em> insult that one teenager can lay on another is that of &ldquo;poser&rdquo;, someone who pretends to like something even though they don&rsquo;t really. That&rsquo;s like calling someone an outsider and a traitor all at once. This is such a damaging insult, such a vicious slur against one&rsquo;s character, that most kids would do almost anything to send the signals that they are genuine in their appreciation for the band, or the style, or whatever.</p>\n\n<p>When you pretend to believe something, and pretend diligently enough, you&rsquo;ll start to really believe it. Sitting there in Dunkin&rsquo; Donuts with some muttering crackhead in downtown New Haven outside an unlistenable punk show, I realized that the only argument for believing in God is that you&rsquo;ll have friends who believe the same things you do, just like my alleged appreciation for the Venus Vixens had brought me to a terrible punk show. It kinda grossed me out to see that in myself.</p>\n\n<p>Since then, I&rsquo;ve learned a lot of philosophy. I&rsquo;ve learned about the infinity paradoxes. I&rsquo;ve learned about the problems with the ontological &ldquo;proof&rdquo;. I&rsquo;ve learned about Pascal&rsquo;s Wager, and shown its failure in a variety of different ways. I&rsquo;ve learned about the formal and technical applications of Occam&rsquo;s Razer. I&rsquo;ve learned about spirituality and meditation. I&rsquo;ve taken a wide array of psychotropic drugs (and it wasn&rsquo;t experimentation most of the time, I knew <em>exactly</em> what would happen). I&rsquo;ve learned about the history of the Bible. I&rsquo;ve studied the space teacups and the flying spaghetti monsters. I&rsquo;ve read Dawkins and Harris and Rand and Russel. I&rsquo;ve learned about evolution and cosmology.</p>\n\n<p>There is no need for God. In fact, it raises a lot more problems that it solves. It is my belief that &ldquo;friends who believe&rdquo; remains the solitary compelling reason that people can and do convince themselves to believe in a higher power. There&rsquo;s more to it, of course. There&rsquo;s agent fixation, and the tendency of children to believe just about <em>anything</em> their elders tell them, and a bunch of other cognitive mistakes that are usually evolutionarily advantageous. But groupthink seems like the biggest contender.</p>\n\n<p>I can&rsquo;t accept a belief just because it&rsquo;s what the crowd believes. That kind of idea&mdash;and more importantly, that method of choosing ideas&mdash;while perhaps important for our ancestors, is dangerous, wrong, and <em>evil</em>. If anything, I tend to be especially suspicious of the things that &ldquo;everybody knows,&rdquo; precisely because they tend to get less criticism, so we need to make the extra effort.</p>\n\n<p>I&rsquo;m very confident that there is no God, no woowoo energies, no angels and fairies and devils, no afterlife, no unicorns, no super powers. That being said, I have a lot of respect for many different kinds of cognitive distortions. In a previous post, I wrote about the concept of &ldquo;energy&rdquo; or &ldquo;chi&rdquo; &ndash; sometimes the model might be wrong, but the phenomenon may still be worth investigating.</p>\n\n<p>Groupthink is never ok, and it is an insidious error. By comparison, I can definitely respect someone for stopping at agnosticism. I&rsquo;ve seen two common arguments for agnosticism; one is defensible in my opinion, the other is not.</p>\n\n<h2>1. It seems possible to me that &hellip;</h2>\n\n<p>A lot of things might seem possible that in fact aren&rsquo;t. &ldquo;Possibility&rdquo; is a statement about our mental model, not a statement about the universe. It &ldquo;seemed possible&rdquo; to the writers, cast, and many viewers of CSI that the line <a href=\"http://www.google.com/search?q=create+a+gui+interface+using+visual+basic%2C+see+if+i+can+track+an+IP+address\">&ldquo;I&rsquo;ll create a GUI interface using VisualBasic, see if I can track an IP address&rdquo;</a> was a reasonable thing that a computer hacker might say about tracking down a criminal. As a programmer, I laughed my ass off.</p>\n\n<p>Not everyone has time to burn on studying the arguments for and against. And expertise is hard to come by on this topic. Many apparent experts are clearly quacks, and many others disagree with one another, so who should you believe? And really, how much does it matter? Not having an opinion on the subject of God is rational, just as it&rsquo;s rational to not have an opinion on &ldquo;GUI interfaces using VisualBasic&rdquo; that are used to &ldquo;track an IP address&rdquo;. There are plenty of important topics that I have no opinion about, or where I&rsquo;ll freely admit that my opinion is mostly useless.</p>\n\n<h2>2. It&rsquo;s not a black and white issue.</h2>\n\n<p>That&rsquo;s a bit of malarky, if you ask me. Either there is a God or there isn&rsquo;t. I&rsquo;ve never gotten a straight answer on how this really could make sense, and I suspect that it&rsquo;s a softer form of social-think. In other words, it translates to &ldquo;God doesn&rsquo;t make sense to me, but I&rsquo;m not quite sure I want to anger the other apes, so I&rsquo;m taking a less controversial position.&rdquo;</p>\n\n<p>I&rsquo;ve seen this &ldquo;absolutes are bad&rdquo; ideology taken to extreme (and self-defeating!) zealotry. I&rsquo;ve been told that I&rsquo;m &ldquo;just as bad as religious fundamentalists&rdquo; because of my atheism. (Really? <em>Just as bad?</em> How many atheists kill their daughters for the &ldquo;crime&rdquo; of having been raped, or blow up abortion clinics, or prevent life-saving medical treatments for their children?)</p>\n\n<p>Gray-worship is deeply problematic. &ldquo;Undecided&rdquo; is the place to be when ignorant and without a trustworthy expert. But the avoidance of firm opinions because they are firm is foolish, and equating all firm opinions as equally wrong is a wild perversion of &ldquo;open mindedness&rdquo;. I usually try to point out the contradictory nature of this fundamentalist anti-fundamentalism. I don&rsquo;t buy the premise that &ldquo;all ideas are fuzzy except this one.&rdquo;</p>\n\n<p>This might strike some as improper or overly harsh: if you are religious, at least in the traditional western sense, and serious about it, then I could probably never date you, and even our level of friendship would be capped somewhere just above &ldquo;friendly acquaintance&rdquo; at best. It&rsquo;s not that I have any disdain for religious people. I try not to blame the victim, since many of these mistakes are so very easy to slip into. This is a prediction more than a prescription. We just won&rsquo;t click.</p>\n\n<p>It&rsquo;s not about having to agree; in fact, some of my best friends are agnostic, and many of them have very different ideas about a lot of things than I do. If anything, it&rsquo;s about being able to disagree. That&rsquo;s another problem with gray worship: if there are no absolutes, then we can&rsquo;t disagree, can we?</p>\n\n<p>Let&rsquo;s not &ldquo;agree to disagree&rdquo;; instead, let&rsquo;s <em>actually disagree</em>, and chew on it. If you&rsquo;re not willing and able to think &ldquo;wrong&rdquo; thoughts, to collide ideas against one another, then where&rsquo;s the growth? If some ideas are off-limits, then where&rsquo;s the innovation? If that&rsquo;s not your cup of tea, we probably just won&rsquo;t get along.</p>\n\n<p>We all occasionally hide from our true selves under the warm blanket of the hive mind. But as responsible rational animals, we ought to strive to be vigilant against this distortion, and eagerly cut through that blanket whenever we notice it. When we hide from our true selves, we are living less fully.</p>\n\n<p>Living less fully means being less alive.</p>",
            "content_raw": "<p>Get ready, I’m about to offend almost everyone. (Except atheists.) Chasing the TeaL DeeR…</p>\n\n<p>Having a firm belief in a “higher power” smelled funny to me from a pretty early age. I could never find any non-contradictory evidence, and it seemed like a pretty fantastic set of ideas to buy into. I guess you could say that I was a soft atheist (aka agnostic) as early as 10 years old, and my acceptance of God gradually faded as I learned to distinguish reality from fiction.</p>\n\n<p>The thing that struck me as very odd around that time is that I started to realize that other people – adults – they <em>actually believed this shit</em>. When my grandmother told me that Santa lives in the North Pole, and when she told me that Jesus lives in Heaven, I heard two statements that were in roughly the same category. But for her, one was make-believe, and the other history. Between 10 and 12, this very strange cognitive dissonance started to dawn on me, and it troubled me greatly.</p>\n\n<p>Also around that time, I realized that people didn’t just <em>believe</em> in God; they formed <em>teams</em> around what they believed about God, and they based their lives around it. I had friends who were Protestants, and they didn’t have to go to Catechism after school. I had other friends who were Jewish, and they had Chanukah instead of Christmas. (Some of them had Christmas too, and Santa.)</p>\n\n<p>Luckily for me, my parents were kind of hippies, despite (or maybe because of) both being brought up Catholic. My dad is the kind of atheist that we’d all be if there was no such thing as religion. He just doesn’t think about it, doesn’t talk about it, doesn’t care about it. He is spiritual, but God isn’t involved even a little. My mother calls herself a Christian, but doesn’t affiliate herself with any particular denomination. She believes in “some kind of higher power”, but she thought it was important for us to “find our own paths and learn about ourselves” and all that jazz.</p>\n\n<p>Turns out, “find your own path and form your own belief” is a good way to ensure your kid is an atheist. If they’re not in the fold by 21, they’re probably lost for good.</p>\n\n<p>So, in middle school and high school, when kids normally start identifying with various teams and forming their sense of self around labels, I became very curious about religion. I knew that there was something deeply wrong with my grandmother’s fervent Catholicism, but I really didn’t get why someone would believe those things. I figured I must be missing something.</p>\n\n<p>I wasn’t. It’s stupid. That’s really all there is to it. But religion’s unique <em>kind</em> of stupid is important, and it wasn’t until a few years later that I saw it.</p>\n\n<p>We are not solitary animals. A lone human is like a lone ant—not long for this world. Evolutionary biology has a funny way of imbuing us with instincts and ideas and feelings that help ensure survival and crush our rivals in the dangerous time of our near-extinction. However, in modern times, when those feelings no longer make sense, we still have them. Sex feels good, even when you’re not procreating. Fat tastes good, even when you don’t need to hoard calories. And so on.</p>\n\n<p>These ideas about God and Jesus and the Bible and whatnot, I realized, got into peoples’ heads just to keep them in the group. I realized this in high school, and it was a pretty pivotal point in my spiritual growth.</p>\n\n<p>I was at a concert when I had this revelation, for a local band in New Haven that wasn’t very good, called the Venus Vixens. “Wasn’t very good” is quite generous. I went outside because they were so unbearably terrible. I would have left if I’d been old enough to have driven there. I started to wonder why I’d come and paid money for this band I couldn’t stand.</p>\n\n<p>I couldn’t claim ignorance, either. I knew I couldn’t stand them before I’d agreed to go, because I’d heard one of their tapes already! And when a friend of mine asked if I wanted to come with them, and if I liked the band, I <em>lied and said that I thought they were good!</em> I’d heard the words coming out of my mouth, and had thought, “No, I don’t. They’re terrible. What the fuck am I doing?”</p>\n\n<p>(Interestingly enough, The Offspring were the opening band, and they were even worse back then than they are now. A few years later when I saw them on MTV, I couldn’t believe it.)</p>\n\n<p>So there I was, standing on Center Street outside the Tune Inn, walking to the Dunkin’ Donuts on the corner to pass the time until the show was over, wondering about why I was such a damned putz. The humbling fact was apparent: I’d claimed a fact that was untrue about myself solely to belong to a group of people. And we were the freaks and nerds, the outcasts! We were supposed to be ok with being different, for crying out loud!</p>\n\n<p>The second worst social attack that one teenager can use against another is to make them seem like they’re not part of the group. “You don’t like the same zoodads that we like. You’re not one of us.” The pressure to like the same things that the group likes is powerful, subconscious, and instinctual. It is the most primal glue that bonds us, and as children, we aren’t sophisticated to have any other kind.</p>\n\n<p>So, the <em>worst</em> insult that one teenager can lay on another is that of “poser”, someone who pretends to like something even though they don’t really. That’s like calling someone an outsider and a traitor all at once. This is such a damaging insult, such a vicious slur against one’s character, that most kids would do almost anything to send the signals that they are genuine in their appreciation for the band, or the style, or whatever.</p>\n\n<p>When you pretend to believe something, and pretend diligently enough, you’ll start to really believe it. Sitting there in Dunkin’ Donuts with some muttering crackhead in downtown New Haven outside an unlistenable punk show, I realized that the only argument for believing in God is that you’ll have friends who believe the same things you do, just like my alleged appreciation for the Venus Vixens had brought me to a terrible punk show. It kinda grossed me out to see that in myself.</p>\n\n<p>Since then, I’ve learned a lot of philosophy. I’ve learned about the infinity paradoxes. I’ve learned about the problems with the ontological “proof”. I’ve learned about Pascal’s Wager, and shown its failure in a variety of different ways. I’ve learned about the formal and technical applications of Occam’s Razer. I’ve learned about spirituality and meditation. I’ve taken a wide array of psychotropic drugs (and it wasn’t experimentation most of the time, I knew <em>exactly</em> what would happen). I’ve learned about the history of the Bible. I’ve studied the space teacups and the flying spaghetti monsters. I’ve read Dawkins and Harris and Rand and Russel. I’ve learned about evolution and cosmology.</p>\n\n<p>There is no need for God. In fact, it raises a lot more problems that it solves. It is my belief that “friends who believe” remains the solitary compelling reason that people can and do convince themselves to believe in a higher power. There’s more to it, of course. There’s agent fixation, and the tendency of children to believe just about <em>anything</em> their elders tell them, and a bunch of other cognitive mistakes that are usually evolutionarily advantageous. But groupthink seems like the biggest contender.</p>\n\n<p>I can’t accept a belief just because it’s what the crowd believes. That kind of idea—and more importantly, that method of choosing ideas—while perhaps important for our ancestors, is dangerous, wrong, and <em>evil</em>. If anything, I tend to be especially suspicious of the things that “everybody knows,” precisely because they tend to get less criticism, so we need to make the extra effort.</p>\n\n<p>I’m very confident that there is no God, no woowoo energies, no angels and fairies and devils, no afterlife, no unicorns, no super powers. That being said, I have a lot of respect for many different kinds of cognitive distortions. In a previous post, I wrote about the concept of “energy” or “chi” – sometimes the model might be wrong, but the phenomenon may still be worth investigating.</p>\n\n<p>Groupthink is never ok, and it is an insidious error. By comparison, I can definitely respect someone for stopping at agnosticism. I’ve seen two common arguments for agnosticism; one is defensible in my opinion, the other is not.</p>\n\n<h2>1. It seems possible to me that …</h2>\n\n<p>A lot of things might seem possible that in fact aren’t. “Possibility” is a statement about our mental model, not a statement about the universe. It “seemed possible” to the writers, cast, and many viewers of CSI that the line <a href=\"http://www.google.com/search?q=create+a+gui+interface+using+visual+basic%2C+see+if+i+can+track+an+IP+address\">“I’ll create a GUI interface using VisualBasic, see if I can track an IP address”</a> was a reasonable thing that a computer hacker might say about tracking down a criminal. As a programmer, I laughed my ass off.</p>\n\n<p>Not everyone has time to burn on studying the arguments for and against. And expertise is hard to come by on this topic. Many apparent experts are clearly quacks, and many others disagree with one another, so who should you believe? And really, how much does it matter? Not having an opinion on the subject of God is rational, just as it’s rational to not have an opinion on “GUI interfaces using VisualBasic” that are used to “track an IP address”. There are plenty of important topics that I have no opinion about, or where I’ll freely admit that my opinion is mostly useless.</p>\n\n<h2>2. It’s not a black and white issue.</h2>\n\n<p>That’s a bit of malarky, if you ask me. Either there is a God or there isn’t. I’ve never gotten a straight answer on how this really could make sense, and I suspect that it’s a softer form of social-think. In other words, it translates to “God doesn’t make sense to me, but I’m not quite sure I want to anger the other apes, so I’m taking a less controversial position.”</p>\n\n<p>I’ve seen this “absolutes are bad” ideology taken to extreme (and self-defeating!) zealotry. I’ve been told that I’m “just as bad as religious fundamentalists” because of my atheism. (Really? <em>Just as bad?</em> How many atheists kill their daughters for the “crime” of having been raped, or blow up abortion clinics, or prevent life-saving medical treatments for their children?)</p>\n\n<p>Gray-worship is deeply problematic. “Undecided” is the place to be when ignorant and without a trustworthy expert. But the avoidance of firm opinions because they are firm is foolish, and equating all firm opinions as equally wrong is a wild perversion of “open mindedness”. I usually try to point out the contradictory nature of this fundamentalist anti-fundamentalism. I don’t buy the premise that “all ideas are fuzzy except this one.”</p>\n\n<p>This might strike some as improper or overly harsh: if you are religious, at least in the traditional western sense, and serious about it, then I could probably never date you, and even our level of friendship would be capped somewhere just above “friendly acquaintance” at best. It’s not that I have any disdain for religious people. I try not to blame the victim, since many of these mistakes are so very easy to slip into. This is a prediction more than a prescription. We just won’t click.</p>\n\n<p>It’s not about having to agree; in fact, some of my best friends are agnostic, and many of them have very different ideas about a lot of things than I do. If anything, it’s about being able to disagree. That’s another problem with gray worship: if there are no absolutes, then we can’t disagree, can we?</p>\n\n<p>Let’s not “agree to disagree”; instead, let’s <em>actually disagree</em>, and chew on it. If you’re not willing and able to think “wrong” thoughts, to collide ideas against one another, then where’s the growth? If some ideas are off-limits, then where’s the innovation? If that’s not your cup of tea, we probably just won’t get along.</p>\n\n<p>We all occasionally hide from our true selves under the warm blanket of the hive mind. But as responsible rational animals, we ought to strive to be vigilant against this distortion, and eagerly cut through that blanket whenever we notice it. When we hide from our true selves, we are living less fully.</p>\n\n<p>Living less fully means being less alive.</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "164992519"
            }
        }
    ],
    "type": "text"
}