{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544051896,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>Dear friends and relatives.  You knew about Napster, and Kazaa, and then they went away.  Now, you&rsquo;ve maybe heard about this &ldquo;bittorrent&rdquo; thing.  You tried to download it, but then it didn&rsquo;t do anything, and you got confused and frustrated.</p>\n\n<p>I&rsquo;m going to explain torrenting to you so that you can do it if you want.</p>\n\n<h2>Isn&rsquo;t torrenting illegal?</h2>\n\n<p>Sure.  So is jaywalking, speeding, and smoking pot.  Yet it&rsquo;s perfectly legal to treat children in subtly cruel ways until they develop into a neurotic unhappy adult.  The law is no substitute for a personal moral compass.  Make your own choices.</p>\n\n<h2>Terminology</h2>\n\n<p>A &ldquo;torrent&rdquo; is a collection of people sharing a file with each other.  You download the parts of the file that you don&rsquo;t have yet, and at the same time, you upload the parts of the file that you do have.  It&rsquo;s kind of like trading cards with other users until you&rsquo;ve got a complete deck.</p>\n\n<p>When you have all the parts of the file (all the cards in the deck), then you&rsquo;re a &ldquo;seeder&rdquo;.  That is, you are uploading, but you&rsquo;re not downloading anything, so you are just helping out the other people on the torrent.</p>\n\n<p>When you are just downloading, but not uploading, you&rsquo;re a &ldquo;leecher&rdquo;.  That is, you&rsquo;re taking, but not giving back.  Everyone starts out as a leecher, and as you download more of the file, you get closer and closer to being a seeder.</p>\n\n<p>Your &ldquo;ratio&rdquo; is the amount of data that you&rsquo;ve uploaded compared to the amount that you&rsquo;ve downloaded.  If your ratio is 1, then that means that you&rsquo;ve uploaded the same amount of bytes that you&rsquo;ve downloaded.  If it&rsquo;s less than one, then you haven&rsquo;t uploaded as much as you&rsquo;ve downloaded.  If it&rsquo;s greater than one, then that means that you&rsquo;ve given back more than you&rsquo;ve taken.</p>\n\n<h2>The .torrent File</h2>\n\n<p>The .torrent file is a small file that tells your computer how to find peers.  It provides the address to the stream, so to speak.</p>\n\n<p>When you download a .torrent file, you&rsquo;re not downloading the actual movie or music or software or whatever.  You&rsquo;re downloading an address card that tells your computer how to <em>find</em> the peers who have the bytes you&rsquo;re interested in.</p>\n\n<h2>The Torrent Client</h2>\n\n<p>In Order to Do This Whole Sharing Thing Using .Torrent Files, You Need a &ldquo;torrent client&rdquo;.  I Like <a href=\"http://www.utorrent.com/\">µTorrent</a>.  It&rsquo;s small, powerful, well-maintained, and works on Mac and PC natively.  If you use Linux, then you can run µTorrent under wine, or use <a href=\"http://qbittorrent.sourceforge.net/\">qBittorrent</a>.  (I haven&rsquo;t used qBittorrent, so I can&rsquo;t vouch for it, but it looks pretty similar to µTorrent from the screenshots.)</p>\n\n<p>Get one of these, and install it.</p>\n\n<h2>A Brief Note About Trust</h2>\n\n<p>Torrents are created by random folks.  They then share these things, and sometimes, it&rsquo;s just the name of the file that distinguishes its contents, since you have to download (and in the process <em>upload</em>) the file before you can see what it really contains.</p>\n\n<p>Be smart, and expect to be disappointed some of the time.  Here are some tips:</p>\n\n<ol><li>If the file is a .rar or .zip or some other kind of &ldquo;archive&rdquo; format, and there&rsquo;s no reason\nfor it to be archived in that manner, there&rsquo;s a good chance it doesn&rsquo;t\ncontain what you think it does.  (Sometimes these formats are smaller or better for transport,\nso this isn&rsquo;t a hard-and-fast rule, but .rar files are, in my experience, slightly less\ntrustworthy.)</li>\n<li>If the file is a TV episode, and it hasn&rsquo;t aired yet, then you can be 100% sure it&rsquo;s fake.</li>\n<li>If the file is an avi file, and when you open it, it says you need to install a codec, or enter\na password, it&rsquo;s most likely fake.  Never buy anything or give anyone your credit card number.</li>\n<li>If there are three copies of something, download them all.  Chances are, one of them will be bogus,\nand then at least you haven&rsquo;t wasted your time.  You can always just throw away the extra files\nwhen you find one that works.</li>\n</ol><h2>Getting a Torrent File</h2>\n\n<p>Next step is to find a .torrent file for the thing you&rsquo;re interested in.  Let&rsquo;s say that you wanted to download RadioHead&rsquo;s &ldquo;In Rainbows&rdquo; album.  <a href=\"http://thepiratebay.org\">The Pirate Bay</a> is a good search engine, since they show you the number of seeders and leeches on any given torrent, as well as a ranking for the user who uploaded it.</p>\n\n<p>Of course, if that doesn&rsquo;t work, then there&rsquo;s always google.  Just add &ldquo;filetype:torrent&rdquo; to any search, and google will return torrent files with the keywords you specify.  Here&rsquo;s what we&rsquo;d use to find In Rainbows: <a href=\"http://www.google.com/search?q=radiohead%20in%20rainbows%20filetype%3Atorrent\">radiohead in rainbows filetype:torrent</a>.</p>\n\n<p>You&rsquo;ll note on the search that there are a few options.  Like I said above, your best bet is usually to kick off a few downloads at once, so that you&rsquo;ll be more likely to get a good file out of it.</p>\n\n<p>If you are looking for video, it&rsquo;s a good idea to add &ldquo;720p&rdquo; or &ldquo;1080p&rdquo; to your search query to find high-definition copies.  A lot of torrents are labelled &ldquo;high def&rdquo; or &ldquo;HD&rdquo; when they&rsquo;re only 480p.</p>\n\n<p>You&rsquo;ll probably find that, at least for popular items, barring the caveats above, the titles are remarkably accurate.</p>\n\n<h2>Speed</h2>\n\n<p>Bittorrent is a peer-to-peer protocol.  That means that you&rsquo;re depending on the goodness of other peoples&rsquo; hearts to upload quality files, and to stay online while they seed.  If something is very popular, then there will naturally be more people sharing it, and it&rsquo;ll come in faster.  If it&rsquo;s rare or niche, then you might be downloading from 1-2 people at a time, and when they shut down their computers, you are sitting alone on that feed.</p>\n\n<p>Be patient.  It&rsquo;s free, after all.  And be a seeder.  Try to get your ratio up around 2-3 on average, and at least you&rsquo;ll know that you&rsquo;re one of the good guys.  If you have a computer that you can keep connected to the internet round the clock, then you&rsquo;ll be able to just start it going and check back in a few days when it&rsquo;s done.</p>\n\n<h2>Your ISP</h2>\n\n<p>Some internet service providers don&rsquo;t take kindly to users actually using the bandwidth that we pay for.  From my point of view, if I buy 50Mbit service, then I ought to be within my rights to expect 50Mbit service any time I want it, for as long as I want it, even round the clock.  Apparently, from the point of view of many cable and DSL providers, expecting to get what you buy is considered &ldquo;abusive&rdquo;.</p>\n\n<p>You may find that they throttle your bandwidth or do other unsavory tactics.  They&rsquo;ve come under heat for selling services they can&rsquo;t provide, and you&rsquo;re well within your rights to complain if you find you&rsquo;re not getting the speeds you signed up for.</p>\n\n<p>One way to work around this problem (or to just avoid <em>using up</em> what you&rsquo;ve paid for), is to use the throttling built into µTorrent.  If you go into the preferences, you can set up the maximum speeds for uploads, downloads, and the maximum ratio at which you want to stop seeding.</p>\n\n<h2>Enjoy!</h2>\n\n<p>Go have fun, and remember to support artists who create the things you like.  It&rsquo;ll almost always be more convenient, fast, and reliable to buy something than to get it from a peer-to-peer network.  Vote with your dollars.  Buy MP3s from Amazon and other DRM-free providers.  Cancel your cable TV and watch streaming shows on <a href=\"http://hulu.com/\">Hulu</a> and <a href=\"http://netflix.com\">Netflix</a> instead.</p>\n\n<p>Or maybe take the money saved on CDs and spend it going to a concert.  (I&rsquo;m told artists typically get a bigger cut of concert revenues than album sales, but TicketMaster is even more evil than the RIAA, so who knows.)</p>\n\n<p>There is no reason to subsidize institutions that don&rsquo;t support artists and fans.  The days of a corporate monopoly on the stream of content are coming to an end.</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2009-12-28 23:17:22 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 305092153,
    "is_blocks_post_format": false,
    "note_count": 8,
    "post_url": "http://blog.izs.me/post/305092153/torrents",
    "reblog": {
        "comment": "<p>Dear friends and relatives.  You knew about Napster, and Kazaa, and then they went away.  Now, you’ve maybe heard about this “bittorrent” thing.  You tried to download it, but then it didn’t do anything, and you got confused and frustrated.</p>\n\n<p>I’m going to explain torrenting to you so that you can do it if you want.</p>\n\n<h2>Isn’t torrenting illegal?</h2>\n\n<p>Sure.  So is jaywalking, speeding, and smoking pot.  Yet it’s perfectly legal to treat children in subtly cruel ways until they develop into a neurotic unhappy adult.  The law is no substitute for a personal moral compass.  Make your own choices.</p>\n\n<h2>Terminology</h2>\n\n<p>A “torrent” is a collection of people sharing a file with each other.  You download the parts of the file that you don’t have yet, and at the same time, you upload the parts of the file that you do have.  It’s kind of like trading cards with other users until you’ve got a complete deck.</p>\n\n<p>When you have all the parts of the file (all the cards in the deck), then you’re a “seeder”.  That is, you are uploading, but you’re not downloading anything, so you are just helping out the other people on the torrent.</p>\n\n<p>When you are just downloading, but not uploading, you’re a “leecher”.  That is, you’re taking, but not giving back.  Everyone starts out as a leecher, and as you download more of the file, you get closer and closer to being a seeder.</p>\n\n<p>Your “ratio” is the amount of data that you’ve uploaded compared to the amount that you’ve downloaded.  If your ratio is 1, then that means that you’ve uploaded the same amount of bytes that you’ve downloaded.  If it’s less than one, then you haven’t uploaded as much as you’ve downloaded.  If it’s greater than one, then that means that you’ve given back more than you’ve taken.</p>\n\n<h2>The .torrent File</h2>\n\n<p>The .torrent file is a small file that tells your computer how to find peers.  It provides the address to the stream, so to speak.</p>\n\n<p>When you download a .torrent file, you’re not downloading the actual movie or music or software or whatever.  You’re downloading an address card that tells your computer how to <em>find</em> the peers who have the bytes you’re interested in.</p>\n\n<h2>The Torrent Client</h2>\n\n<p>In Order to Do This Whole Sharing Thing Using .Torrent Files, You Need a “torrent client”.  I Like <a href=\"http://www.utorrent.com/\">µTorrent</a>.  It’s small, powerful, well-maintained, and works on Mac and PC natively.  If you use Linux, then you can run µTorrent under wine, or use <a href=\"http://qbittorrent.sourceforge.net/\">qBittorrent</a>.  (I haven’t used qBittorrent, so I can’t vouch for it, but it looks pretty similar to µTorrent from the screenshots.)</p>\n\n<p>Get one of these, and install it.</p>\n\n<h2>A Brief Note About Trust</h2>\n\n<p>Torrents are created by random folks.  They then share these things, and sometimes, it’s just the name of the file that distinguishes its contents, since you have to download (and in the process <em>upload</em>) the file before you can see what it really contains.</p>\n\n<p>Be smart, and expect to be disappointed some of the time.  Here are some tips:</p>\n\n<ol><li>If the file is a .rar or .zip or some other kind of “archive” format, and there’s no reason\nfor it to be archived in that manner, there’s a good chance it doesn’t\ncontain what you think it does.  (Sometimes these formats are smaller or better for transport,\nso this isn’t a hard-and-fast rule, but .rar files are, in my experience, slightly less\ntrustworthy.)</li>\n<li>If the file is a TV episode, and it hasn’t aired yet, then you can be 100% sure it’s fake.</li>\n<li>If the file is an avi file, and when you open it, it says you need to install a codec, or enter\na password, it’s most likely fake.  Never buy anything or give anyone your credit card number.</li>\n<li>If there are three copies of something, download them all.  Chances are, one of them will be bogus,\nand then at least you haven’t wasted your time.  You can always just throw away the extra files\nwhen you find one that works.</li>\n</ol><h2>Getting a Torrent File</h2>\n\n<p>Next step is to find a .torrent file for the thing you’re interested in.  Let’s say that you wanted to download RadioHead’s “In Rainbows” album.  <a href=\"http://thepiratebay.org\">The Pirate Bay</a> is a good search engine, since they show you the number of seeders and leeches on any given torrent, as well as a ranking for the user who uploaded it.</p>\n\n<p>Of course, if that doesn’t work, then there’s always google.  Just add “filetype:torrent” to any search, and google will return torrent files with the keywords you specify.  Here’s what we’d use to find In Rainbows: <a href=\"http://www.google.com/search?q=radiohead%20in%20rainbows%20filetype%3Atorrent\">radiohead in rainbows filetype:torrent</a>.</p>\n\n<p>You’ll note on the search that there are a few options.  Like I said above, your best bet is usually to kick off a few downloads at once, so that you’ll be more likely to get a good file out of it.</p>\n\n<p>If you are looking for video, it’s a good idea to add “720p” or “1080p” to your search query to find high-definition copies.  A lot of torrents are labelled “high def” or “HD” when they’re only 480p.</p>\n\n<p>You’ll probably find that, at least for popular items, barring the caveats above, the titles are remarkably accurate.</p>\n\n<h2>Speed</h2>\n\n<p>Bittorrent is a peer-to-peer protocol.  That means that you’re depending on the goodness of other peoples’ hearts to upload quality files, and to stay online while they seed.  If something is very popular, then there will naturally be more people sharing it, and it’ll come in faster.  If it’s rare or niche, then you might be downloading from 1-2 people at a time, and when they shut down their computers, you are sitting alone on that feed.</p>\n\n<p>Be patient.  It’s free, after all.  And be a seeder.  Try to get your ratio up around 2-3 on average, and at least you’ll know that you’re one of the good guys.  If you have a computer that you can keep connected to the internet round the clock, then you’ll be able to just start it going and check back in a few days when it’s done.</p>\n\n<h2>Your ISP</h2>\n\n<p>Some internet service providers don’t take kindly to users actually using the bandwidth that we pay for.  From my point of view, if I buy 50Mbit service, then I ought to be within my rights to expect 50Mbit service any time I want it, for as long as I want it, even round the clock.  Apparently, from the point of view of many cable and DSL providers, expecting to get what you buy is considered “abusive”.</p>\n\n<p>You may find that they throttle your bandwidth or do other unsavory tactics.  They’ve come under heat for selling services they can’t provide, and you’re well within your rights to complain if you find you’re not getting the speeds you signed up for.</p>\n\n<p>One way to work around this problem (or to just avoid <em>using up</em> what you’ve paid for), is to use the throttling built into µTorrent.  If you go into the preferences, you can set up the maximum speeds for uploads, downloads, and the maximum ratio at which you want to stop seeding.</p>\n\n<h2>Enjoy!</h2>\n\n<p>Go have fun, and remember to support artists who create the things you like.  It’ll almost always be more convenient, fast, and reliable to buy something than to get it from a peer-to-peer network.  Vote with your dollars.  Buy MP3s from Amazon and other DRM-free providers.  Cancel your cable TV and watch streaming shows on <a href=\"http://hulu.com/\">Hulu</a> and <a href=\"http://netflix.com\">Netflix</a> instead.</p>\n\n<p>Or maybe take the money saved on CDs and spend it going to a concert.  (I’m told artists typically get a bigger cut of concert revenues than album sales, but TicketMaster is even more evil than the RIAA, so who knows.)</p>\n\n<p>There is no reason to subsidize institutions that don’t support artists and fans.  The days of a corporate monopoly on the stream of content are coming to an end.</p>",
        "tree_html": ""
    },
    "reblog_key": "ypskGuV8",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWyIBrOv",
    "slug": "torrents",
    "state": "published",
    "summary": "Torrents",
    "tags": [
        "torrents",
        "bittorrent",
        "howto"
    ],
    "timestamp": 1262042242,
    "title": "Torrents",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p>Dear friends and relatives.  You knew about Napster, and Kazaa, and then they went away.  Now, you&rsquo;ve maybe heard about this &ldquo;bittorrent&rdquo; thing.  You tried to download it, but then it didn&rsquo;t do anything, and you got confused and frustrated.</p>\n\n<p>I&rsquo;m going to explain torrenting to you so that you can do it if you want.</p>\n\n<h2>Isn&rsquo;t torrenting illegal?</h2>\n\n<p>Sure.  So is jaywalking, speeding, and smoking pot.  Yet it&rsquo;s perfectly legal to treat children in subtly cruel ways until they develop into a neurotic unhappy adult.  The law is no substitute for a personal moral compass.  Make your own choices.</p>\n\n<h2>Terminology</h2>\n\n<p>A &ldquo;torrent&rdquo; is a collection of people sharing a file with each other.  You download the parts of the file that you don&rsquo;t have yet, and at the same time, you upload the parts of the file that you do have.  It&rsquo;s kind of like trading cards with other users until you&rsquo;ve got a complete deck.</p>\n\n<p>When you have all the parts of the file (all the cards in the deck), then you&rsquo;re a &ldquo;seeder&rdquo;.  That is, you are uploading, but you&rsquo;re not downloading anything, so you are just helping out the other people on the torrent.</p>\n\n<p>When you are just downloading, but not uploading, you&rsquo;re a &ldquo;leecher&rdquo;.  That is, you&rsquo;re taking, but not giving back.  Everyone starts out as a leecher, and as you download more of the file, you get closer and closer to being a seeder.</p>\n\n<p>Your &ldquo;ratio&rdquo; is the amount of data that you&rsquo;ve uploaded compared to the amount that you&rsquo;ve downloaded.  If your ratio is 1, then that means that you&rsquo;ve uploaded the same amount of bytes that you&rsquo;ve downloaded.  If it&rsquo;s less than one, then you haven&rsquo;t uploaded as much as you&rsquo;ve downloaded.  If it&rsquo;s greater than one, then that means that you&rsquo;ve given back more than you&rsquo;ve taken.</p>\n\n<h2>The .torrent File</h2>\n\n<p>The .torrent file is a small file that tells your computer how to find peers.  It provides the address to the stream, so to speak.</p>\n\n<p>When you download a .torrent file, you&rsquo;re not downloading the actual movie or music or software or whatever.  You&rsquo;re downloading an address card that tells your computer how to <em>find</em> the peers who have the bytes you&rsquo;re interested in.</p>\n\n<h2>The Torrent Client</h2>\n\n<p>In Order to Do This Whole Sharing Thing Using .Torrent Files, You Need a &ldquo;torrent client&rdquo;.  I Like <a href=\"http://www.utorrent.com/\">&micro;Torrent</a>.  It&rsquo;s small, powerful, well-maintained, and works on Mac and PC natively.  If you use Linux, then you can run &micro;Torrent under wine, or use <a href=\"http://qbittorrent.sourceforge.net/\">qBittorrent</a>.  (I haven&rsquo;t used qBittorrent, so I can&rsquo;t vouch for it, but it looks pretty similar to &micro;Torrent from the screenshots.)</p>\n\n<p>Get one of these, and install it.</p>\n\n<h2>A Brief Note About Trust</h2>\n\n<p>Torrents are created by random folks.  They then share these things, and sometimes, it&rsquo;s just the name of the file that distinguishes its contents, since you have to download (and in the process <em>upload</em>) the file before you can see what it really contains.</p>\n\n<p>Be smart, and expect to be disappointed some of the time.  Here are some tips:</p>\n\n<ol><li>If the file is a .rar or .zip or some other kind of &ldquo;archive&rdquo; format, and there&rsquo;s no reason\nfor it to be archived in that manner, there&rsquo;s a good chance it doesn&rsquo;t\ncontain what you think it does.  (Sometimes these formats are smaller or better for transport,\nso this isn&rsquo;t a hard-and-fast rule, but .rar files are, in my experience, slightly less\ntrustworthy.)</li>\n<li>If the file is a TV episode, and it hasn&rsquo;t aired yet, then you can be 100% sure it&rsquo;s fake.</li>\n<li>If the file is an avi file, and when you open it, it says you need to install a codec, or enter\na password, it&rsquo;s most likely fake.  Never buy anything or give anyone your credit card number.</li>\n<li>If there are three copies of something, download them all.  Chances are, one of them will be bogus,\nand then at least you haven&rsquo;t wasted your time.  You can always just throw away the extra files\nwhen you find one that works.</li>\n</ol><h2>Getting a Torrent File</h2>\n\n<p>Next step is to find a .torrent file for the thing you&rsquo;re interested in.  Let&rsquo;s say that you wanted to download RadioHead&rsquo;s &ldquo;In Rainbows&rdquo; album.  <a href=\"http://thepiratebay.org\">The Pirate Bay</a> is a good search engine, since they show you the number of seeders and leeches on any given torrent, as well as a ranking for the user who uploaded it.</p>\n\n<p>Of course, if that doesn&rsquo;t work, then there&rsquo;s always google.  Just add &ldquo;filetype:torrent&rdquo; to any search, and google will return torrent files with the keywords you specify.  Here&rsquo;s what we&rsquo;d use to find In Rainbows: <a href=\"http://www.google.com/search?q=radiohead%20in%20rainbows%20filetype%3Atorrent\">radiohead in rainbows filetype:torrent</a>.</p>\n\n<p>You&rsquo;ll note on the search that there are a few options.  Like I said above, your best bet is usually to kick off a few downloads at once, so that you&rsquo;ll be more likely to get a good file out of it.</p>\n\n<p>If you are looking for video, it&rsquo;s a good idea to add &ldquo;720p&rdquo; or &ldquo;1080p&rdquo; to your search query to find high-definition copies.  A lot of torrents are labelled &ldquo;high def&rdquo; or &ldquo;HD&rdquo; when they&rsquo;re only 480p.</p>\n\n<p>You&rsquo;ll probably find that, at least for popular items, barring the caveats above, the titles are remarkably accurate.</p>\n\n<h2>Speed</h2>\n\n<p>Bittorrent is a peer-to-peer protocol.  That means that you&rsquo;re depending on the goodness of other peoples&rsquo; hearts to upload quality files, and to stay online while they seed.  If something is very popular, then there will naturally be more people sharing it, and it&rsquo;ll come in faster.  If it&rsquo;s rare or niche, then you might be downloading from 1-2 people at a time, and when they shut down their computers, you are sitting alone on that feed.</p>\n\n<p>Be patient.  It&rsquo;s free, after all.  And be a seeder.  Try to get your ratio up around 2-3 on average, and at least you&rsquo;ll know that you&rsquo;re one of the good guys.  If you have a computer that you can keep connected to the internet round the clock, then you&rsquo;ll be able to just start it going and check back in a few days when it&rsquo;s done.</p>\n\n<h2>Your ISP</h2>\n\n<p>Some internet service providers don&rsquo;t take kindly to users actually using the bandwidth that we pay for.  From my point of view, if I buy 50Mbit service, then I ought to be within my rights to expect 50Mbit service any time I want it, for as long as I want it, even round the clock.  Apparently, from the point of view of many cable and DSL providers, expecting to get what you buy is considered &ldquo;abusive&rdquo;.</p>\n\n<p>You may find that they throttle your bandwidth or do other unsavory tactics.  They&rsquo;ve come under heat for selling services they can&rsquo;t provide, and you&rsquo;re well within your rights to complain if you find you&rsquo;re not getting the speeds you signed up for.</p>\n\n<p>One way to work around this problem (or to just avoid <em>using up</em> what you&rsquo;ve paid for), is to use the throttling built into &micro;Torrent.  If you go into the preferences, you can set up the maximum speeds for uploads, downloads, and the maximum ratio at which you want to stop seeding.</p>\n\n<h2>Enjoy!</h2>\n\n<p>Go have fun, and remember to support artists who create the things you like.  It&rsquo;ll almost always be more convenient, fast, and reliable to buy something than to get it from a peer-to-peer network.  Vote with your dollars.  Buy MP3s from Amazon and other DRM-free providers.  Cancel your cable TV and watch streaming shows on <a href=\"http://hulu.com/\">Hulu</a> and <a href=\"http://netflix.com\">Netflix</a> instead.</p>\n\n<p>Or maybe take the money saved on CDs and spend it going to a concert.  (I&rsquo;m told artists typically get a bigger cut of concert revenues than album sales, but TicketMaster is even more evil than the RIAA, so who knows.)</p>\n\n<p>There is no reason to subsidize institutions that don&rsquo;t support artists and fans.  The days of a corporate monopoly on the stream of content are coming to an end.</p>",
            "content_raw": "<p>Dear friends and relatives.  You knew about Napster, and Kazaa, and then they went away.  Now, you’ve maybe heard about this “bittorrent” thing.  You tried to download it, but then it didn’t do anything, and you got confused and frustrated.</p>\n\n<p>I’m going to explain torrenting to you so that you can do it if you want.</p>\n\n<h2>Isn’t torrenting illegal?</h2>\n\n<p>Sure.  So is jaywalking, speeding, and smoking pot.  Yet it’s perfectly legal to treat children in subtly cruel ways until they develop into a neurotic unhappy adult.  The law is no substitute for a personal moral compass.  Make your own choices.</p>\n\n<h2>Terminology</h2>\n\n<p>A “torrent” is a collection of people sharing a file with each other.  You download the parts of the file that you don’t have yet, and at the same time, you upload the parts of the file that you do have.  It’s kind of like trading cards with other users until you’ve got a complete deck.</p>\n\n<p>When you have all the parts of the file (all the cards in the deck), then you’re a “seeder”.  That is, you are uploading, but you’re not downloading anything, so you are just helping out the other people on the torrent.</p>\n\n<p>When you are just downloading, but not uploading, you’re a “leecher”.  That is, you’re taking, but not giving back.  Everyone starts out as a leecher, and as you download more of the file, you get closer and closer to being a seeder.</p>\n\n<p>Your “ratio” is the amount of data that you’ve uploaded compared to the amount that you’ve downloaded.  If your ratio is 1, then that means that you’ve uploaded the same amount of bytes that you’ve downloaded.  If it’s less than one, then you haven’t uploaded as much as you’ve downloaded.  If it’s greater than one, then that means that you’ve given back more than you’ve taken.</p>\n\n<h2>The .torrent File</h2>\n\n<p>The .torrent file is a small file that tells your computer how to find peers.  It provides the address to the stream, so to speak.</p>\n\n<p>When you download a .torrent file, you’re not downloading the actual movie or music or software or whatever.  You’re downloading an address card that tells your computer how to <em>find</em> the peers who have the bytes you’re interested in.</p>\n\n<h2>The Torrent Client</h2>\n\n<p>In Order to Do This Whole Sharing Thing Using .Torrent Files, You Need a “torrent client”.  I Like <a href=\"http://www.utorrent.com/\">µTorrent</a>.  It’s small, powerful, well-maintained, and works on Mac and PC natively.  If you use Linux, then you can run µTorrent under wine, or use <a href=\"http://qbittorrent.sourceforge.net/\">qBittorrent</a>.  (I haven’t used qBittorrent, so I can’t vouch for it, but it looks pretty similar to µTorrent from the screenshots.)</p>\n\n<p>Get one of these, and install it.</p>\n\n<h2>A Brief Note About Trust</h2>\n\n<p>Torrents are created by random folks.  They then share these things, and sometimes, it’s just the name of the file that distinguishes its contents, since you have to download (and in the process <em>upload</em>) the file before you can see what it really contains.</p>\n\n<p>Be smart, and expect to be disappointed some of the time.  Here are some tips:</p>\n\n<ol><li>If the file is a .rar or .zip or some other kind of “archive” format, and there’s no reason\nfor it to be archived in that manner, there’s a good chance it doesn’t\ncontain what you think it does.  (Sometimes these formats are smaller or better for transport,\nso this isn’t a hard-and-fast rule, but .rar files are, in my experience, slightly less\ntrustworthy.)</li>\n<li>If the file is a TV episode, and it hasn’t aired yet, then you can be 100% sure it’s fake.</li>\n<li>If the file is an avi file, and when you open it, it says you need to install a codec, or enter\na password, it’s most likely fake.  Never buy anything or give anyone your credit card number.</li>\n<li>If there are three copies of something, download them all.  Chances are, one of them will be bogus,\nand then at least you haven’t wasted your time.  You can always just throw away the extra files\nwhen you find one that works.</li>\n</ol><h2>Getting a Torrent File</h2>\n\n<p>Next step is to find a .torrent file for the thing you’re interested in.  Let’s say that you wanted to download RadioHead’s “In Rainbows” album.  <a href=\"http://thepiratebay.org\">The Pirate Bay</a> is a good search engine, since they show you the number of seeders and leeches on any given torrent, as well as a ranking for the user who uploaded it.</p>\n\n<p>Of course, if that doesn’t work, then there’s always google.  Just add “filetype:torrent” to any search, and google will return torrent files with the keywords you specify.  Here’s what we’d use to find In Rainbows: <a href=\"http://www.google.com/search?q=radiohead%20in%20rainbows%20filetype%3Atorrent\">radiohead in rainbows filetype:torrent</a>.</p>\n\n<p>You’ll note on the search that there are a few options.  Like I said above, your best bet is usually to kick off a few downloads at once, so that you’ll be more likely to get a good file out of it.</p>\n\n<p>If you are looking for video, it’s a good idea to add “720p” or “1080p” to your search query to find high-definition copies.  A lot of torrents are labelled “high def” or “HD” when they’re only 480p.</p>\n\n<p>You’ll probably find that, at least for popular items, barring the caveats above, the titles are remarkably accurate.</p>\n\n<h2>Speed</h2>\n\n<p>Bittorrent is a peer-to-peer protocol.  That means that you’re depending on the goodness of other peoples’ hearts to upload quality files, and to stay online while they seed.  If something is very popular, then there will naturally be more people sharing it, and it’ll come in faster.  If it’s rare or niche, then you might be downloading from 1-2 people at a time, and when they shut down their computers, you are sitting alone on that feed.</p>\n\n<p>Be patient.  It’s free, after all.  And be a seeder.  Try to get your ratio up around 2-3 on average, and at least you’ll know that you’re one of the good guys.  If you have a computer that you can keep connected to the internet round the clock, then you’ll be able to just start it going and check back in a few days when it’s done.</p>\n\n<h2>Your ISP</h2>\n\n<p>Some internet service providers don’t take kindly to users actually using the bandwidth that we pay for.  From my point of view, if I buy 50Mbit service, then I ought to be within my rights to expect 50Mbit service any time I want it, for as long as I want it, even round the clock.  Apparently, from the point of view of many cable and DSL providers, expecting to get what you buy is considered “abusive”.</p>\n\n<p>You may find that they throttle your bandwidth or do other unsavory tactics.  They’ve come under heat for selling services they can’t provide, and you’re well within your rights to complain if you find you’re not getting the speeds you signed up for.</p>\n\n<p>One way to work around this problem (or to just avoid <em>using up</em> what you’ve paid for), is to use the throttling built into µTorrent.  If you go into the preferences, you can set up the maximum speeds for uploads, downloads, and the maximum ratio at which you want to stop seeding.</p>\n\n<h2>Enjoy!</h2>\n\n<p>Go have fun, and remember to support artists who create the things you like.  It’ll almost always be more convenient, fast, and reliable to buy something than to get it from a peer-to-peer network.  Vote with your dollars.  Buy MP3s from Amazon and other DRM-free providers.  Cancel your cable TV and watch streaming shows on <a href=\"http://hulu.com/\">Hulu</a> and <a href=\"http://netflix.com\">Netflix</a> instead.</p>\n\n<p>Or maybe take the money saved on CDs and spend it going to a concert.  (I’m told artists typically get a bigger cut of concert revenues than album sales, but TicketMaster is even more evil than the RIAA, so who knows.)</p>\n\n<p>There is no reason to subsidize institutions that don’t support artists and fans.  The days of a corporate monopoly on the stream of content are coming to an end.</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "305092153"
            }
        }
    ],
    "type": "text"
}