{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544051896,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p>There&rsquo;s a thing that my yoga teacher says after each class.</p>\n\n<blockquote>\n  <p>We offer the benefit of our practice to all beings.  May they all be happy, free, and at peace.\n  Lokaah Samastaah Sukhino Bhavantu.</p>\n</blockquote>\n\n<p>At the start of class, she asks us to &ldquo;set the intention&rdquo; of our practice, a thing or person or idea that we want to focus our positive energy on throughout the exercises.</p>\n\n<p>When I first started doing yoga, I felt a lot of resistance to the &ldquo;woo woo&rdquo; aspects of it.  I thought, &ldquo;I&rsquo;m coming here to exercise, and it&rsquo;s a good work out, so putting up with a bit of hippie crap is not such a big deal, but really?  Not for me.&rdquo;</p>\n\n<p>We are not beings of light.  I can&rsquo;t fix your car by sending good vibrations.  In fact, I can&rsquo;t even send &ldquo;vibrations&rdquo; in any meaningful sense just by having thoughts.  Prayer doesn&rsquo;t heal the sick, and can even make them worse, if they know about it.  People make really bad decisions sometimes because they buy into what is, at its root, a fairy tale.  Why not just interact with reality as it is?</p>\n\n<p>However, there&rsquo;s a flaw in that approach.  We are not beings of light, sure, but neither are we innately rational.  The Practice is about stretching your entire being into a more powerful shape.  Minds work better when the body is fit, and bodies are highly responsive to the intention of their minds.</p>\n\n<p>Your brain is an organ.  Your mind is what this organ does.  Saying, &ldquo;I&rsquo;ll just do the exercise, but I&rsquo;m not going to believe it&rdquo; is like saying that you&rsquo;re going to do a cardio workout, but you want to keep your pulse rate down.  If you make that a restriction, it will limit how far you can push yourself, and ultimately limit the benefit.</p>\n\n<p>The &ldquo;woowoo&rdquo; beings-of-pure-light mentality, and the &ldquo;no woowoo&rdquo; I&rsquo;ll-just-do-the-physical-parts, are two sides of the same coin, a paradigm that the body and the mind are separate things that only interact over a modest communication channel, whereby the body gives information and the mind gives direction.  But these two different views of the human soul are much more intimately connected.  The body and the mind are not separate things that communicate, they are the <em>same</em> thing, seen from different points of view.</p>\n\n<p>This year has been incredible for me.  Rewarding in so many ways, professionally, socially, intellectually, romantically, the list goes on.  But with these rewards have come profound challenges as well.  I am definitely not shy, but I have always been quite introverted.  I tend to keep a small number of friends, and am much more comfortable in 1-on-1 interactions than in groups.  I can barely manage to write a line of code in an office, always preferring to work alone in isolation.  Once upon a time, I&rsquo;d dreamed of being nerd-famous, but I always thought it would be less&hellip; &ldquo;personal&rdquo;, in some way.  Like I&rsquo;d have a high-trafficked blog, and live in relative obscurity otherwise.</p>\n\n<p>Then Ryan left the helm of Node.js, and I find myself arbitering disputes and traveling to faraway countries where people want to tell me things and ask me things and watch me talk about things on a stage.  There&rsquo;s all these&hellip; <em>people</em> with their <em>thoughts</em> and <em>feelings</em> and much of the time, they completely confuse me.  There is a constant low-level anxiety that I&rsquo;m about to say the wrong thing, or forget the name of someone (who of course I know well online, and interact with easily via text!) or do some other thing that will insult everyone and let everyone see what a fraud I am, and how silly they all are to have put any stock in anything I have to say.</p>\n\n<p>This is why we Practice.  Breathe.  Stretch.  If it feels easy, push a little harder.  Breathe.  If it feels like too much, back off a little bit.  Breathe.  It&rsquo;s not supposed to be fun all the time.  Breathe.</p>\n\n<p>As the <a href=\"http://lesswrong.com\">LessWrongers</a> say, the times when you most need your skills are the times when you&rsquo;re most likely to lose them.  Part of the Practice is learning to recognize distress, and come back to a place of balance.</p>\n\n<p>I&rsquo;m not sure exactly when it happened, but I noticed today that I had changed my stance on the little prayer at the end of yoga class.  I actually say it along in my head now.  I do take a few moments to set my intention at the start of the class, and come back to it repeatedly.  Sometimes the intention is my partner, or a family member, or someone else that I am thinking about.  Sometimes it&rsquo;s an exciting event coming up.  Sometimes it&rsquo;s just a bug in Node that I know I&rsquo;ll have to fix.</p>\n\n<p>I don&rsquo;t care that Marisa will never be able to tell that I was &ldquo;setting my intention&rdquo; on her and our relationship while I was sweating in side-angle pose.  It won&rsquo;t make my flight to Australia any smoother that I was sending positive energy into the future.  And most of the beings everywhere will not be any happier, freer, peaceful, or at ease, by virtue of me doing yoga.</p>\n\n<p>But it&rsquo;s not about them.  Setting intention is like aligning the spine of your mind.  By focusing on <em>my</em> sense of compassion, I make myself more able to respond gracefully to challenges in life, no matter what they are.  It is an exercise that strengthens the mental ability to listen to someone spit venom, and instead of spitting it back, think about how you might be able to understand why they feel so threatened, and how you can help that wound heal.</p>\n\n<p>And the actual workout is better.  We are social creatures, and our instincts are mostly involuntary.  By telling myself that I&rsquo;m pushing my body for the benefit of all living beings, some primal sense of obligation wakes up muscles I didn&rsquo;t know I had, and gives me the fortitude to breathe through the intensity of the situation.  Grit is something you can build, but you have to have a reason.  Once built up, it&rsquo;s applicable all over.  It&rsquo;s easier to trudge through godawful legacy code in node to fix bugs, and other things where others actually <em>do</em> benefit from my desire to carry on.</p>\n\n<p>And this, ultimately, is what &ldquo;extending the benefit of our practice to all living beings&rdquo; really means, whether it&rsquo;s yoga or meditation or rationalist practice or just working to get better at your job.  It means that the work isn&rsquo;t just for ourselves.  It&rsquo;s for the effect that we have in the world.</p>\n\n<p>I don&rsquo;t know all the things the future will bring.  I hope it stays great for as long as possible.  I hope that someone somewhere can cure aging and we can all live forever and do away with war and disease and car accidents.  But hopes and reality are not the same thing.  My best guess is that the future will bring age and sickness and sadness interspersed with the good stuff.  Eventually it will probably bring death.  When you&rsquo;re in a knife fight, it&rsquo;s too late to learn how to defend yourself.  Now is the time to practice diligently.</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2012-11-09 23:44:00 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 35367673340,
    "is_blocks_post_format": false,
    "note_count": 10,
    "post_url": "http://blog.izs.me/post/35367673340/lokaah-samastaah-sukhino-bhavantu",
    "reblog": {
        "comment": "<p>There’s a thing that my yoga teacher says after each class.</p>\n\n<blockquote>\n  <p>We offer the benefit of our practice to all beings.  May they all be happy, free, and at peace.\n  Lokaah Samastaah Sukhino Bhavantu.</p>\n</blockquote>\n\n<p>At the start of class, she asks us to “set the intention” of our practice, a thing or person or idea that we want to focus our positive energy on throughout the exercises.</p>\n\n<p>When I first started doing yoga, I felt a lot of resistance to the “woo woo” aspects of it.  I thought, “I’m coming here to exercise, and it’s a good work out, so putting up with a bit of hippie crap is not such a big deal, but really?  Not for me.”</p>\n\n<p>We are not beings of light.  I can’t fix your car by sending good vibrations.  In fact, I can’t even send “vibrations” in any meaningful sense just by having thoughts.  Prayer doesn’t heal the sick, and can even make them worse, if they know about it.  People make really bad decisions sometimes because they buy into what is, at its root, a fairy tale.  Why not just interact with reality as it is?</p>\n\n<p>However, there’s a flaw in that approach.  We are not beings of light, sure, but neither are we innately rational.  The Practice is about stretching your entire being into a more powerful shape.  Minds work better when the body is fit, and bodies are highly responsive to the intention of their minds.</p>\n\n<p>Your brain is an organ.  Your mind is what this organ does.  Saying, “I’ll just do the exercise, but I’m not going to believe it” is like saying that you’re going to do a cardio workout, but you want to keep your pulse rate down.  If you make that a restriction, it will limit how far you can push yourself, and ultimately limit the benefit.</p>\n\n<p>The “woowoo” beings-of-pure-light mentality, and the “no woowoo” I’ll-just-do-the-physical-parts, are two sides of the same coin, a paradigm that the body and the mind are separate things that only interact over a modest communication channel, whereby the body gives information and the mind gives direction.  But these two different views of the human soul are much more intimately connected.  The body and the mind are not separate things that communicate, they are the <em>same</em> thing, seen from different points of view.</p>\n\n<p>This year has been incredible for me.  Rewarding in so many ways, professionally, socially, intellectually, romantically, the list goes on.  But with these rewards have come profound challenges as well.  I am definitely not shy, but I have always been quite introverted.  I tend to keep a small number of friends, and am much more comfortable in 1-on-1 interactions than in groups.  I can barely manage to write a line of code in an office, always preferring to work alone in isolation.  Once upon a time, I’d dreamed of being nerd-famous, but I always thought it would be less… “personal”, in some way.  Like I’d have a high-trafficked blog, and live in relative obscurity otherwise.</p>\n\n<p>Then Ryan left the helm of Node.js, and I find myself arbitering disputes and traveling to faraway countries where people want to tell me things and ask me things and watch me talk about things on a stage.  There’s all these… <em>people</em> with their <em>thoughts</em> and <em>feelings</em> and much of the time, they completely confuse me.  There is a constant low-level anxiety that I’m about to say the wrong thing, or forget the name of someone (who of course I know well online, and interact with easily via text!) or do some other thing that will insult everyone and let everyone see what a fraud I am, and how silly they all are to have put any stock in anything I have to say.</p>\n\n<p>This is why we Practice.  Breathe.  Stretch.  If it feels easy, push a little harder.  Breathe.  If it feels like too much, back off a little bit.  Breathe.  It’s not supposed to be fun all the time.  Breathe.</p>\n\n<p>As the <a href=\"http://lesswrong.com\">LessWrongers</a> say, the times when you most need your skills are the times when you’re most likely to lose them.  Part of the Practice is learning to recognize distress, and come back to a place of balance.</p>\n\n<p>I’m not sure exactly when it happened, but I noticed today that I had changed my stance on the little prayer at the end of yoga class.  I actually say it along in my head now.  I do take a few moments to set my intention at the start of the class, and come back to it repeatedly.  Sometimes the intention is my partner, or a family member, or someone else that I am thinking about.  Sometimes it’s an exciting event coming up.  Sometimes it’s just a bug in Node that I know I’ll have to fix.</p>\n\n<p>I don’t care that Marisa will never be able to tell that I was “setting my intention” on her and our relationship while I was sweating in side-angle pose.  It won’t make my flight to Australia any smoother that I was sending positive energy into the future.  And most of the beings everywhere will not be any happier, freer, peaceful, or at ease, by virtue of me doing yoga.</p>\n\n<p>But it’s not about them.  Setting intention is like aligning the spine of your mind.  By focusing on <em>my</em> sense of compassion, I make myself more able to respond gracefully to challenges in life, no matter what they are.  It is an exercise that strengthens the mental ability to listen to someone spit venom, and instead of spitting it back, think about how you might be able to understand why they feel so threatened, and how you can help that wound heal.</p>\n\n<p>And the actual workout is better.  We are social creatures, and our instincts are mostly involuntary.  By telling myself that I’m pushing my body for the benefit of all living beings, some primal sense of obligation wakes up muscles I didn’t know I had, and gives me the fortitude to breathe through the intensity of the situation.  Grit is something you can build, but you have to have a reason.  Once built up, it’s applicable all over.  It’s easier to trudge through godawful legacy code in node to fix bugs, and other things where others actually <em>do</em> benefit from my desire to carry on.</p>\n\n<p>And this, ultimately, is what “extending the benefit of our practice to all living beings” really means, whether it’s yoga or meditation or rationalist practice or just working to get better at your job.  It means that the work isn’t just for ourselves.  It’s for the effect that we have in the world.</p>\n\n<p>I don’t know all the things the future will bring.  I hope it stays great for as long as possible.  I hope that someone somewhere can cure aging and we can all live forever and do away with war and disease and car accidents.  But hopes and reality are not the same thing.  My best guess is that the future will bring age and sickness and sadness interspersed with the good stuff.  Eventually it will probably bring death.  When you’re in a knife fight, it’s too late to learn how to defend yourself.  Now is the time to practice diligently.</p>",
        "tree_html": ""
    },
    "reblog_key": "CZ6nSmQh",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWyWy4zty",
    "slug": "lokaah-samastaah-sukhino-bhavantu",
    "state": "published",
    "summary": "Lokaah Samastaah Sukhino Bhavantu",
    "tags": [],
    "timestamp": 1352504640,
    "title": "Lokaah Samastaah Sukhino Bhavantu",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p>There&rsquo;s a thing that my yoga teacher says after each class.</p>\n\n<blockquote>\n  <p>We offer the benefit of our practice to all beings.  May they all be happy, free, and at peace.\n  Lokaah Samastaah Sukhino Bhavantu.</p>\n</blockquote>\n\n<p>At the start of class, she asks us to &ldquo;set the intention&rdquo; of our practice, a thing or person or idea that we want to focus our positive energy on throughout the exercises.</p>\n\n<p>When I first started doing yoga, I felt a lot of resistance to the &ldquo;woo woo&rdquo; aspects of it.  I thought, &ldquo;I&rsquo;m coming here to exercise, and it&rsquo;s a good work out, so putting up with a bit of hippie crap is not such a big deal, but really?  Not for me.&rdquo;</p>\n\n<p>We are not beings of light.  I can&rsquo;t fix your car by sending good vibrations.  In fact, I can&rsquo;t even send &ldquo;vibrations&rdquo; in any meaningful sense just by having thoughts.  Prayer doesn&rsquo;t heal the sick, and can even make them worse, if they know about it.  People make really bad decisions sometimes because they buy into what is, at its root, a fairy tale.  Why not just interact with reality as it is?</p>\n\n<p>However, there&rsquo;s a flaw in that approach.  We are not beings of light, sure, but neither are we innately rational.  The Practice is about stretching your entire being into a more powerful shape.  Minds work better when the body is fit, and bodies are highly responsive to the intention of their minds.</p>\n\n<p>Your brain is an organ.  Your mind is what this organ does.  Saying, &ldquo;I&rsquo;ll just do the exercise, but I&rsquo;m not going to believe it&rdquo; is like saying that you&rsquo;re going to do a cardio workout, but you want to keep your pulse rate down.  If you make that a restriction, it will limit how far you can push yourself, and ultimately limit the benefit.</p>\n\n<p>The &ldquo;woowoo&rdquo; beings-of-pure-light mentality, and the &ldquo;no woowoo&rdquo; I&rsquo;ll-just-do-the-physical-parts, are two sides of the same coin, a paradigm that the body and the mind are separate things that only interact over a modest communication channel, whereby the body gives information and the mind gives direction.  But these two different views of the human soul are much more intimately connected.  The body and the mind are not separate things that communicate, they are the <em>same</em> thing, seen from different points of view.</p>\n\n<p>This year has been incredible for me.  Rewarding in so many ways, professionally, socially, intellectually, romantically, the list goes on.  But with these rewards have come profound challenges as well.  I am definitely not shy, but I have always been quite introverted.  I tend to keep a small number of friends, and am much more comfortable in 1-on-1 interactions than in groups.  I can barely manage to write a line of code in an office, always preferring to work alone in isolation.  Once upon a time, I&rsquo;d dreamed of being nerd-famous, but I always thought it would be less&hellip; &ldquo;personal&rdquo;, in some way.  Like I&rsquo;d have a high-trafficked blog, and live in relative obscurity otherwise.</p>\n\n<p>Then Ryan left the helm of Node.js, and I find myself arbitering disputes and traveling to faraway countries where people want to tell me things and ask me things and watch me talk about things on a stage.  There&rsquo;s all these&hellip; <em>people</em> with their <em>thoughts</em> and <em>feelings</em> and much of the time, they completely confuse me.  There is a constant low-level anxiety that I&rsquo;m about to say the wrong thing, or forget the name of someone (who of course I know well online, and interact with easily via text!) or do some other thing that will insult everyone and let everyone see what a fraud I am, and how silly they all are to have put any stock in anything I have to say.</p>\n\n<p>This is why we Practice.  Breathe.  Stretch.  If it feels easy, push a little harder.  Breathe.  If it feels like too much, back off a little bit.  Breathe.  It&rsquo;s not supposed to be fun all the time.  Breathe.</p>\n\n<p>As the <a href=\"http://lesswrong.com\">LessWrongers</a> say, the times when you most need your skills are the times when you&rsquo;re most likely to lose them.  Part of the Practice is learning to recognize distress, and come back to a place of balance.</p>\n\n<p>I&rsquo;m not sure exactly when it happened, but I noticed today that I had changed my stance on the little prayer at the end of yoga class.  I actually say it along in my head now.  I do take a few moments to set my intention at the start of the class, and come back to it repeatedly.  Sometimes the intention is my partner, or a family member, or someone else that I am thinking about.  Sometimes it&rsquo;s an exciting event coming up.  Sometimes it&rsquo;s just a bug in Node that I know I&rsquo;ll have to fix.</p>\n\n<p>I don&rsquo;t care that Marisa will never be able to tell that I was &ldquo;setting my intention&rdquo; on her and our relationship while I was sweating in side-angle pose.  It won&rsquo;t make my flight to Australia any smoother that I was sending positive energy into the future.  And most of the beings everywhere will not be any happier, freer, peaceful, or at ease, by virtue of me doing yoga.</p>\n\n<p>But it&rsquo;s not about them.  Setting intention is like aligning the spine of your mind.  By focusing on <em>my</em> sense of compassion, I make myself more able to respond gracefully to challenges in life, no matter what they are.  It is an exercise that strengthens the mental ability to listen to someone spit venom, and instead of spitting it back, think about how you might be able to understand why they feel so threatened, and how you can help that wound heal.</p>\n\n<p>And the actual workout is better.  We are social creatures, and our instincts are mostly involuntary.  By telling myself that I&rsquo;m pushing my body for the benefit of all living beings, some primal sense of obligation wakes up muscles I didn&rsquo;t know I had, and gives me the fortitude to breathe through the intensity of the situation.  Grit is something you can build, but you have to have a reason.  Once built up, it&rsquo;s applicable all over.  It&rsquo;s easier to trudge through godawful legacy code in node to fix bugs, and other things where others actually <em>do</em> benefit from my desire to carry on.</p>\n\n<p>And this, ultimately, is what &ldquo;extending the benefit of our practice to all living beings&rdquo; really means, whether it&rsquo;s yoga or meditation or rationalist practice or just working to get better at your job.  It means that the work isn&rsquo;t just for ourselves.  It&rsquo;s for the effect that we have in the world.</p>\n\n<p>I don&rsquo;t know all the things the future will bring.  I hope it stays great for as long as possible.  I hope that someone somewhere can cure aging and we can all live forever and do away with war and disease and car accidents.  But hopes and reality are not the same thing.  My best guess is that the future will bring age and sickness and sadness interspersed with the good stuff.  Eventually it will probably bring death.  When you&rsquo;re in a knife fight, it&rsquo;s too late to learn how to defend yourself.  Now is the time to practice diligently.</p>",
            "content_raw": "<p>There’s a thing that my yoga teacher says after each class.</p>\n\n<blockquote>\n  <p>We offer the benefit of our practice to all beings.  May they all be happy, free, and at peace.\n  Lokaah Samastaah Sukhino Bhavantu.</p>\n</blockquote>\n\n<p>At the start of class, she asks us to “set the intention” of our practice, a thing or person or idea that we want to focus our positive energy on throughout the exercises.</p>\n\n<p>When I first started doing yoga, I felt a lot of resistance to the “woo woo” aspects of it.  I thought, “I’m coming here to exercise, and it’s a good work out, so putting up with a bit of hippie crap is not such a big deal, but really?  Not for me.”</p>\n\n<p>We are not beings of light.  I can’t fix your car by sending good vibrations.  In fact, I can’t even send “vibrations” in any meaningful sense just by having thoughts.  Prayer doesn’t heal the sick, and can even make them worse, if they know about it.  People make really bad decisions sometimes because they buy into what is, at its root, a fairy tale.  Why not just interact with reality as it is?</p>\n\n<p>However, there’s a flaw in that approach.  We are not beings of light, sure, but neither are we innately rational.  The Practice is about stretching your entire being into a more powerful shape.  Minds work better when the body is fit, and bodies are highly responsive to the intention of their minds.</p>\n\n<p>Your brain is an organ.  Your mind is what this organ does.  Saying, “I’ll just do the exercise, but I’m not going to believe it” is like saying that you’re going to do a cardio workout, but you want to keep your pulse rate down.  If you make that a restriction, it will limit how far you can push yourself, and ultimately limit the benefit.</p>\n\n<p>The “woowoo” beings-of-pure-light mentality, and the “no woowoo” I’ll-just-do-the-physical-parts, are two sides of the same coin, a paradigm that the body and the mind are separate things that only interact over a modest communication channel, whereby the body gives information and the mind gives direction.  But these two different views of the human soul are much more intimately connected.  The body and the mind are not separate things that communicate, they are the <em>same</em> thing, seen from different points of view.</p>\n\n<p>This year has been incredible for me.  Rewarding in so many ways, professionally, socially, intellectually, romantically, the list goes on.  But with these rewards have come profound challenges as well.  I am definitely not shy, but I have always been quite introverted.  I tend to keep a small number of friends, and am much more comfortable in 1-on-1 interactions than in groups.  I can barely manage to write a line of code in an office, always preferring to work alone in isolation.  Once upon a time, I’d dreamed of being nerd-famous, but I always thought it would be less… “personal”, in some way.  Like I’d have a high-trafficked blog, and live in relative obscurity otherwise.</p>\n\n<p>Then Ryan left the helm of Node.js, and I find myself arbitering disputes and traveling to faraway countries where people want to tell me things and ask me things and watch me talk about things on a stage.  There’s all these… <em>people</em> with their <em>thoughts</em> and <em>feelings</em> and much of the time, they completely confuse me.  There is a constant low-level anxiety that I’m about to say the wrong thing, or forget the name of someone (who of course I know well online, and interact with easily via text!) or do some other thing that will insult everyone and let everyone see what a fraud I am, and how silly they all are to have put any stock in anything I have to say.</p>\n\n<p>This is why we Practice.  Breathe.  Stretch.  If it feels easy, push a little harder.  Breathe.  If it feels like too much, back off a little bit.  Breathe.  It’s not supposed to be fun all the time.  Breathe.</p>\n\n<p>As the <a href=\"http://lesswrong.com\">LessWrongers</a> say, the times when you most need your skills are the times when you’re most likely to lose them.  Part of the Practice is learning to recognize distress, and come back to a place of balance.</p>\n\n<p>I’m not sure exactly when it happened, but I noticed today that I had changed my stance on the little prayer at the end of yoga class.  I actually say it along in my head now.  I do take a few moments to set my intention at the start of the class, and come back to it repeatedly.  Sometimes the intention is my partner, or a family member, or someone else that I am thinking about.  Sometimes it’s an exciting event coming up.  Sometimes it’s just a bug in Node that I know I’ll have to fix.</p>\n\n<p>I don’t care that Marisa will never be able to tell that I was “setting my intention” on her and our relationship while I was sweating in side-angle pose.  It won’t make my flight to Australia any smoother that I was sending positive energy into the future.  And most of the beings everywhere will not be any happier, freer, peaceful, or at ease, by virtue of me doing yoga.</p>\n\n<p>But it’s not about them.  Setting intention is like aligning the spine of your mind.  By focusing on <em>my</em> sense of compassion, I make myself more able to respond gracefully to challenges in life, no matter what they are.  It is an exercise that strengthens the mental ability to listen to someone spit venom, and instead of spitting it back, think about how you might be able to understand why they feel so threatened, and how you can help that wound heal.</p>\n\n<p>And the actual workout is better.  We are social creatures, and our instincts are mostly involuntary.  By telling myself that I’m pushing my body for the benefit of all living beings, some primal sense of obligation wakes up muscles I didn’t know I had, and gives me the fortitude to breathe through the intensity of the situation.  Grit is something you can build, but you have to have a reason.  Once built up, it’s applicable all over.  It’s easier to trudge through godawful legacy code in node to fix bugs, and other things where others actually <em>do</em> benefit from my desire to carry on.</p>\n\n<p>And this, ultimately, is what “extending the benefit of our practice to all living beings” really means, whether it’s yoga or meditation or rationalist practice or just working to get better at your job.  It means that the work isn’t just for ourselves.  It’s for the effect that we have in the world.</p>\n\n<p>I don’t know all the things the future will bring.  I hope it stays great for as long as possible.  I hope that someone somewhere can cure aging and we can all live forever and do away with war and disease and car accidents.  But hopes and reality are not the same thing.  My best guess is that the future will bring age and sickness and sadness interspersed with the good stuff.  Eventually it will probably bring death.  When you’re in a knife fight, it’s too late to learn how to defend yourself.  Now is the time to practice diligently.</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "35367673340"
            }
        }
    ],
    "type": "text"
}