{
    "blog": {
        "description": "Writing and Stuff from Isaac Z. Schlueter",
        "name": "izs",
        "title": "blog.izs.me",
        "updated": 1544051896,
        "url": "http://blog.izs.me/",
        "uuid": "t:qZa3tMNNGjX7PQ45aXJ-jw"
    },
    "blog_name": "izs",
    "body": "<p><a href=\"http://en.wikipedia.org/wiki/Bisexual_erasure\">Erasure</a> is a complicated subject.</p>\n\n<p>I was born onto a bed of privilege.  I&rsquo;m of white European descent, and my immigrant ancestors came over the ocean long enough ago that my parents could speak the exact same dialect as the teachers at my well-funded suburban public school.  They both had graduate degrees, and our home was full of books.  I was encouraged towards intellectual pursuits.</p>\n\n<p>My dad ran his own company when I was growing up.  We weren&rsquo;t super rich, but we never went hungry.  By virtue of that business, I played with computers from an early age, and learned the basics of strategy and sales as far back as I can remember.</p>\n\n<p>I wasn&rsquo;t abused or disabled.  In fact, for an extremely nerdy kid, I didn&rsquo;t even get picked on all that much.</p>\n\n<p>On top of that, I&rsquo;m <a href=\"http://en.wikipedia.org/wiki/Cisgender\">cismale</a> and straight.</p>\n\n<hr><p>I knew that I was a straight boy, because I liked girls.  A lot.  Boy, oh, boy, girls were great.</p>\n\n<p>My TV education on human sexuality was clear.  There are 5 sharply defined categories.  Lesbians, straight girls, girls who liked to fool around with other girls sometimes but are actually straight (aka &ldquo;bi&rdquo; or &ldquo;AWESOME&rdquo;), gay men, and straight men.  Straight men go with women, and gay men don&rsquo;t.  So obviously, I was straight.</p>\n\n<p>And just as obvious as my straightness, I knew that some of our culture&rsquo;s beliefs about straight people were off base.  Straight men are also attracted to men.  As a straight guy, any argument to the contrary was obviously wrong, because I knew from my own experience.  I&rsquo;d had full-on crushes on male friends of mine, which was clearly a normal thing for normal straight people to do, as evidenced by me, a normal straight person doing it.</p>\n\n<p>They said in vicious teasing that boys who liked boys were gay, but I knew that I wasn&rsquo;t gay, because gay boys don&rsquo;t like girls.  Therefore straight boys also like boys sometimes, and the people doing the teasing are just misguided or something.  But I feared the teasing, so I didn&rsquo;t point out their error.</p>\n\n<p>I always felt like it would be an easy thing to &ldquo;switch teams&rdquo;, and be gay if I wanted to.  The fascination with the &ldquo;born this way&rdquo; meme in queer activism never made sense to me.  Of <em>course</em> we have a choice in the gender we pursue, doesn&rsquo;t everyone?  Isn&rsquo;t choice great?</p>\n\n<p>I never did switch, because I didn&rsquo;t want to be gay.  That would mean I&rsquo;d have to give up dating women, which I enjoyed.</p>\n\n<p>Heterosexuality carries the privilege of not having to explain why I&rsquo;m inviting someone out on a date.  You&rsquo;re a woman, I&rsquo;m a man, we just follow the script that society has handed us.</p>\n\n<p>It&rsquo;s easy to remain only partly visible.</p>\n\n<hr><p>It took an embarrassingly long time to stop erasing, and become ok with calling myself &ldquo;bisexual&rdquo;, even in my own mind.</p>\n\n<p>The realization didn&rsquo;t come in High School when my crush on another boy had me following him around like a weird giddy puppy.  Or in college, when I first kissed a boy. Or the second or third time that boy and I made out.</p>\n\n<p>The scales started to lift from my eyes when I had a conversation with a good friend about the movie &ldquo;Troy&rdquo;, well into my 20&rsquo;s.</p>\n\n<p>He said, &ldquo;That movie was kind of boring.&rdquo;</p>\n\n<p>I was shocked, and then I realized he was talking about the plot.</p>\n\n<p>&ldquo;Well&hellip; I didn&rsquo;t really pay attention to the plot, tbh.  That movie&rsquo;s just lots of Brad Pitt being gorgeous and half-naked.&rdquo;</p>\n\n<p>&ldquo;You&rsquo;re not as straight as you think you are.&rdquo;</p>\n\n<p>&ldquo;Yeah, like you&rsquo;re not attracted to guys sometimes.&rdquo;</p>\n\n<p>&ldquo;Nope.&rdquo;</p>\n\n<p>&ldquo;Not ever?&rdquo;</p>\n\n<p>&ldquo;Not ever.&rdquo;</p>\n\n<p>&ldquo;Not even Brad Pitt?&rdquo;</p>\n\n<p>&ldquo;Not even a little.  You&rsquo;re bi, dude.&rdquo;</p>\n\n<p>&ldquo;Huh.&rdquo;</p>\n\n<p>I figured he was fucking with me.  But a lot of things did start to make sense.</p>\n\n<hr><p>My life since then has been significantly more interesting.</p>\n\n<p>I tried on the label like a new pair of shoes, awkward, and uncertain.</p>\n\n<p>Like a good nerd, I dove into the research, but found it surprisingly lacking.  <a href=\"http://www.amazon.com/Bi-Men-Coming-Every-Which/dp/1560236159/\">Bi Men Coming Out Every Which Way</a> was a great read.  I learned about how pervasive the erasure of male bisexuality is, even among academic studies of LGBT culture.  It&rsquo;s as if the B isn&rsquo;t there.  A man who has sex with men is gay.  If he then has sex with a woman, he&rsquo;s &ldquo;closeted&rdquo;.</p>\n\n<p>But how can it be a closet if you go into it and out of it repeatedly, with lovers and families on both sides?  That&rsquo;s not a closet, it&rsquo;s a room with a revolving door.</p>\n\n<p>The idea that bisexuality might exist is news <a href=\"http://www.nytimes.com/2014/03/23/magazine/the-scientific-quest-to-prove-bisexuality-exists.html?_r=0\">worthy of the New York Times</a>, even.</p>\n\n<p>Privilege is hard to give up.  I can&rsquo;t overstate how <em>easy</em> it is being straight in public, just letting people think whatever they want.  But in the years since I&rsquo;ve come out to myself, this bugs me more and more.</p>\n\n<p>When meeting a new person, I try to say &ldquo;partner&rdquo; rather than &ldquo;girlfriend&rdquo;, and sometimes even &ldquo;they&rdquo; rather than &ldquo;she&rdquo;.  The shape of my lover&rsquo;s body is no business of theirs, after all.</p>\n\n<p>But when I slip, and drop her name, or use female pronouns (which, to be fair, she <em>does</em> use, female as she is), I can&rsquo;t help but wonder if they&rsquo;re relieved to find out that I&rsquo;m not gay, or perhaps just relieved to know which mold I fit into.</p>\n\n<p>I find myself resenting being cast in a mold at all.  Even if I say &ldquo;partner&rdquo;,\nand they assume I&rsquo;m gay, part of me feels so put upon by that idea.  And then here I am making assumptions about what assumptions someone else might be making.  It&rsquo;s a vicious cycle, and there is no escape from the hypocrisy.</p>\n\n<p>I&rsquo;ve tried since then not to make assumptions about others&rsquo; sexual preferences.  Yet despite my best intentions, I consistently find myself mentally putting people in the &ldquo;straight&rdquo; or &ldquo;gay&rdquo; buckets once I find out the gender of their significant other.</p>\n\n<p>The habit of bi erasure is silent and pervasive.</p>\n\n<hr><p>The first time I kissed a boy was almost a dare.  In a dorm room, sitting around drinking, as you do.  The two girls, roommates, said to the 5 of us boys that they&rsquo;d both wondered what it would be like to kiss a girl.  But, they said, they&rsquo;re not lesbians, so they wanted to do it in front of people, so that it wouldn&rsquo;t get too serious, or go too far.</p>\n\n<p>You can imagine the reaction.</p>\n\n<p><strong>YES, LADIES, YOU HAVE OUR ATTENTION, PLEASE PROCEED</strong></p>\n\n<p>Afterwards, one of them remarked, &ldquo;See, that&rsquo;s why women are better.  Guys would never be secure enough to do something like that.&rdquo;</p>\n\n<p>He and I both replied, &ldquo;Bullshit,&rdquo; and before I knew it, sparks were flying.  The other 3 boys in the room were shocked, making the socially required homophobic anguish sounds.  I barely remember them being there.  I&rsquo;d been looking all day for an excuse to touch him.  It ended too fast, but endures in my mind to this day.</p>\n\n<p>What a shock it was when I learned, 14 years later, that he has a boyfriend now!  I don&rsquo;t know why it should&rsquo;ve been a surprise.  Back then, making out just seemed like a thing straight friends did with each other once in a while.</p>\n\n<p>Again and again, I catch myself being surprised like that.  I try to remember that, in fact, a significant portion of men are bisexual, perhaps even a majority, depending on how we decide to define things.  I try to yank my thinking out of the mold, but it frequently slips back.</p>\n\n<p>You don&rsquo;t notice erasure until you stop doing it.<br/>\nAnd then you don&rsquo;t notice when you start again.</p>\n\n<hr><p>I&rsquo;ve been told by people in the LGBT community that &ldquo;bisexual isn&rsquo;t a real thing&rdquo;, that I&rsquo;m &ldquo;actually straight&rdquo; because I&rsquo;m with a woman, or even, &ldquo;men aren&rsquo;t bisexual, just closeted.&rdquo;  Bi-curious is code for &ldquo;about to leave the closet&rdquo;.  &ldquo;Bi now, gay later.&rdquo;</p>\n\n<p>I have taken to referring to gay and straight people as &ldquo;monosexuals&rdquo;.  I respond by explaining that they&rsquo;re just going through a phase.  Once they meet the right <em>person not of their stated preferred gender</em>, they&rsquo;ll grow out of it and realize that they&rsquo;re <em>actually</em> bi.</p>\n\n<p>But I know, that old &ldquo;everyone&rsquo;s bi&rdquo; story is just another way to push us into the background. If we&rsquo;re not nonexistent, we&rsquo;re unremarkable. Either way, nothing to see here. Move along. </p>\n\n<p>Or worse, if we are visible, we&rsquo;re sex objects. Dating gay men confirmed every awful thing I&rsquo;ve heard (and, let&rsquo;s be honest, perpetuated) about how straight men treat bi women.  Qv the &ldquo;bi for male pleasure&rdquo; meme implicit in my first gay kiss experience.  They&rsquo;re happy to fuck the <abbr title=\"straight-acting gay\">SAG</abbr>, but anything more than sex is off the table.  We can&rsquo;t be trusted, after all.  We&rsquo;re tourists.  Unicorns.  We don&rsquo;t exist.</p>\n\n<p><abbr title=\"lesbian gay something trans\">LG_T</abbr></p>\n\n<hr><p>Maybe the strangest part about growing up a closeted bisexual is that I&rsquo;ve been practicing dating girls since puberty.  I&rsquo;m <em>very</em> good at it.  Confident.  Respectful.  Sensitive.  Witty.  Hungry and giving.  It&rsquo;s not talent or PUA bullshit, and there isn&rsquo;t any one weird trick.  It&rsquo;s the result of many years of conscientious practice, with loving patient teachers who were learning from me as well; the occasional broken heart that didn&rsquo;t kill me, even when I felt like it was trying to.</p>\n\n<p>But my experience with men is still so elementary.  Men and women are different!  Turns. Out.  I am 13 all over again, confused and stumbling, sending the wrong signals, and reading every situation backwards.  And they are grown men with adult expectations who very reasonably want a peer, not an apprentice.  So that&rsquo;s been tricky.</p>\n\n<p>I don&rsquo;t have it nearly so rough as the newly-out &ldquo;baby gays&rdquo;, celibate well into adulthood. At least I&rsquo;ve had <em>some</em> relationships, enough to learn that the emotional bruises heal. My heart goes out to them.</p>\n\n<p>At first, I was very careful about who I told. I didn&rsquo;t want to draw scandal or trolling to my online communities.  I didn&rsquo;t want the drama.  I still fear the schoolyard teasing.</p>\n\n<p>Mostly, I didn&rsquo;t want anyone else telling me how to feel about something I was only beginning to accept myself.</p>\n\n<hr><p>Eventually, I&rsquo;ve come to see my queerness less as a &ldquo;thing&rdquo; to be disclosed, and more as just another part of my private life.  Something that friends probably know, and strangers probably don&rsquo;t, no more scandalous or secret than my address or my allergy to shellfish.</p>\n\n<p>I envy kids growing up today, as the sharp lines between straight and gay finally begin to blur in the cultural consciousness. Straight boys in love today might explore that feeling, without suffering an identity crisis.  I wish those lines would blur faster.  I wish it was a big deal because love is awesome, instead of being a big deal because of the genders and stated identities of the actors.</p>\n\n<p>My home is technology.  This is My Culture, rotten though it can be at times.  As a privileged and visible person in it, I feel obligated to try to make it a little better in the ways I can.  That&rsquo;s why I&rsquo;ve decided to publicly tell this story, so that my presence can add weight to the claim that bisexual men exist.</p>\n\n<p>Maybe this can also be a reminder of the multitude of other things we casually erase from the people around us.  There are so many ways we make our friends invisible, unwittingly nudging them into a corner that denies important parts of their identities, by perpetuating memes we don&rsquo;t even notice.</p>\n\n<p>Erasure isn&rsquo;t healthy.  And we are all unaware that we do it.</p>",
    "can_like": false,
    "can_reblog": false,
    "can_reply": false,
    "can_send_in_message": true,
    "date": "2014-06-11 17:28:00 GMT",
    "display_avatar": true,
    "format": "markdown",
    "id": 88487057983,
    "is_blocks_post_format": false,
    "note_count": 159,
    "post_url": "http://blog.izs.me/post/88487057983/lgt",
    "reblog": {
        "comment": "<p><a href=\"http://en.wikipedia.org/wiki/Bisexual_erasure\">Erasure</a> is a complicated subject.</p>\n\n<p>I was born onto a bed of privilege.  I’m of white European descent, and my immigrant ancestors came over the ocean long enough ago that my parents could speak the exact same dialect as the teachers at my well-funded suburban public school.  They both had graduate degrees, and our home was full of books.  I was encouraged towards intellectual pursuits.</p>\n\n<p>My dad ran his own company when I was growing up.  We weren’t super rich, but we never went hungry.  By virtue of that business, I played with computers from an early age, and learned the basics of strategy and sales as far back as I can remember.</p>\n\n<p>I wasn’t abused or disabled.  In fact, for an extremely nerdy kid, I didn’t even get picked on all that much.</p>\n\n<p>On top of that, I’m <a href=\"http://en.wikipedia.org/wiki/Cisgender\">cismale</a> and straight.</p>\n\n<hr><p>I knew that I was a straight boy, because I liked girls.  A lot.  Boy, oh, boy, girls were great.</p>\n\n<p>My TV education on human sexuality was clear.  There are 5 sharply defined categories.  Lesbians, straight girls, girls who liked to fool around with other girls sometimes but are actually straight (aka “bi” or “AWESOME”), gay men, and straight men.  Straight men go with women, and gay men don’t.  So obviously, I was straight.</p>\n\n<p>And just as obvious as my straightness, I knew that some of our culture’s beliefs about straight people were off base.  Straight men are also attracted to men.  As a straight guy, any argument to the contrary was obviously wrong, because I knew from my own experience.  I’d had full-on crushes on male friends of mine, which was clearly a normal thing for normal straight people to do, as evidenced by me, a normal straight person doing it.</p>\n\n<p>They said in vicious teasing that boys who liked boys were gay, but I knew that I wasn’t gay, because gay boys don’t like girls.  Therefore straight boys also like boys sometimes, and the people doing the teasing are just misguided or something.  But I feared the teasing, so I didn’t point out their error.</p>\n\n<p>I always felt like it would be an easy thing to “switch teams”, and be gay if I wanted to.  The fascination with the “born this way” meme in queer activism never made sense to me.  Of <em>course</em> we have a choice in the gender we pursue, doesn’t everyone?  Isn’t choice great?</p>\n\n<p>I never did switch, because I didn’t want to be gay.  That would mean I’d have to give up dating women, which I enjoyed.</p>\n\n<p>Heterosexuality carries the privilege of not having to explain why I’m inviting someone out on a date.  You’re a woman, I’m a man, we just follow the script that society has handed us.</p>\n\n<p>It’s easy to remain only partly visible.</p>\n\n<hr><p>It took an embarrassingly long time to stop erasing, and become ok with calling myself “bisexual”, even in my own mind.</p>\n\n<p>The realization didn’t come in High School when my crush on another boy had me following him around like a weird giddy puppy.  Or in college, when I first kissed a boy. Or the second or third time that boy and I made out.</p>\n\n<p>The scales started to lift from my eyes when I had a conversation with a good friend about the movie “Troy”, well into my 20’s.</p>\n\n<p>He said, “That movie was kind of boring.”</p>\n\n<p>I was shocked, and then I realized he was talking about the plot.</p>\n\n<p>“Well… I didn’t really pay attention to the plot, tbh.  That movie’s just lots of Brad Pitt being gorgeous and half-naked.”</p>\n\n<p>“You’re not as straight as you think you are.”</p>\n\n<p>“Yeah, like you’re not attracted to guys sometimes.”</p>\n\n<p>“Nope.”</p>\n\n<p>“Not ever?”</p>\n\n<p>“Not ever.”</p>\n\n<p>“Not even Brad Pitt?”</p>\n\n<p>“Not even a little.  You’re bi, dude.”</p>\n\n<p>“Huh.”</p>\n\n<p>I figured he was fucking with me.  But a lot of things did start to make sense.</p>\n\n<hr><p>My life since then has been significantly more interesting.</p>\n\n<p>I tried on the label like a new pair of shoes, awkward, and uncertain.</p>\n\n<p>Like a good nerd, I dove into the research, but found it surprisingly lacking.  <a href=\"http://www.amazon.com/Bi-Men-Coming-Every-Which/dp/1560236159/\">Bi Men Coming Out Every Which Way</a> was a great read.  I learned about how pervasive the erasure of male bisexuality is, even among academic studies of LGBT culture.  It’s as if the B isn’t there.  A man who has sex with men is gay.  If he then has sex with a woman, he’s “closeted”.</p>\n\n<p>But how can it be a closet if you go into it and out of it repeatedly, with lovers and families on both sides?  That’s not a closet, it’s a room with a revolving door.</p>\n\n<p>The idea that bisexuality might exist is news <a href=\"http://www.nytimes.com/2014/03/23/magazine/the-scientific-quest-to-prove-bisexuality-exists.html?_r=0\">worthy of the New York Times</a>, even.</p>\n\n<p>Privilege is hard to give up.  I can’t overstate how <em>easy</em> it is being straight in public, just letting people think whatever they want.  But in the years since I’ve come out to myself, this bugs me more and more.</p>\n\n<p>When meeting a new person, I try to say “partner” rather than “girlfriend”, and sometimes even “they” rather than “she”.  The shape of my lover’s body is no business of theirs, after all.</p>\n\n<p>But when I slip, and drop her name, or use female pronouns (which, to be fair, she <em>does</em> use, female as she is), I can’t help but wonder if they’re relieved to find out that I’m not gay, or perhaps just relieved to know which mold I fit into.</p>\n\n<p>I find myself resenting being cast in a mold at all.  Even if I say “partner”,\nand they assume I’m gay, part of me feels so put upon by that idea.  And then here I am making assumptions about what assumptions someone else might be making.  It’s a vicious cycle, and there is no escape from the hypocrisy.</p>\n\n<p>I’ve tried since then not to make assumptions about others’ sexual preferences.  Yet despite my best intentions, I consistently find myself mentally putting people in the “straight” or “gay” buckets once I find out the gender of their significant other.</p>\n\n<p>The habit of bi erasure is silent and pervasive.</p>\n\n<hr><p>The first time I kissed a boy was almost a dare.  In a dorm room, sitting around drinking, as you do.  The two girls, roommates, said to the 5 of us boys that they’d both wondered what it would be like to kiss a girl.  But, they said, they’re not lesbians, so they wanted to do it in front of people, so that it wouldn’t get too serious, or go too far.</p>\n\n<p>You can imagine the reaction.</p>\n\n<p><strong>YES, LADIES, YOU HAVE OUR ATTENTION, PLEASE PROCEED</strong></p>\n\n<p>Afterwards, one of them remarked, “See, that’s why women are better.  Guys would never be secure enough to do something like that.”</p>\n\n<p>He and I both replied, “Bullshit,” and before I knew it, sparks were flying.  The other 3 boys in the room were shocked, making the socially required homophobic anguish sounds.  I barely remember them being there.  I’d been looking all day for an excuse to touch him.  It ended too fast, but endures in my mind to this day.</p>\n\n<p>What a shock it was when I learned, 14 years later, that he has a boyfriend now!  I don’t know why it should’ve been a surprise.  Back then, making out just seemed like a thing straight friends did with each other once in a while.</p>\n\n<p>Again and again, I catch myself being surprised like that.  I try to remember that, in fact, a significant portion of men are bisexual, perhaps even a majority, depending on how we decide to define things.  I try to yank my thinking out of the mold, but it frequently slips back.</p>\n\n<p>You don’t notice erasure until you stop doing it.<br>\nAnd then you don’t notice when you start again.</p>\n\n<hr><p>I’ve been told by people in the LGBT community that “bisexual isn’t a real thing”, that I’m “actually straight” because I’m with a woman, or even, “men aren’t bisexual, just closeted.”  Bi-curious is code for “about to leave the closet”.  “Bi now, gay later.”</p>\n\n<p>I have taken to referring to gay and straight people as “monosexuals”.  I respond by explaining that they’re just going through a phase.  Once they meet the right <em>person not of their stated preferred gender</em>, they’ll grow out of it and realize that they’re <em>actually</em> bi.</p>\n\n<p>But I know, that old “everyone’s bi” story is just another way to push us into the background. If we’re not nonexistent, we’re unremarkable. Either way, nothing to see here. Move along. </p>\n\n<p>Or worse, if we are visible, we’re sex objects. Dating gay men confirmed every awful thing I’ve heard (and, let’s be honest, perpetuated) about how straight men treat bi women.  Qv the “bi for male pleasure” meme implicit in my first gay kiss experience.  They’re happy to fuck the <abbr title=\"straight-acting gay\">SAG</abbr>, but anything more than sex is off the table.  We can’t be trusted, after all.  We’re tourists.  Unicorns.  We don’t exist.</p>\n\n<p><abbr title=\"lesbian gay something trans\">LG_T</abbr></p>\n\n<hr><p>Maybe the strangest part about growing up a closeted bisexual is that I’ve been practicing dating girls since puberty.  I’m <em>very</em> good at it.  Confident.  Respectful.  Sensitive.  Witty.  Hungry and giving.  It’s not talent or PUA bullshit, and there isn’t any one weird trick.  It’s the result of many years of conscientious practice, with loving patient teachers who were learning from me as well; the occasional broken heart that didn’t kill me, even when I felt like it was trying to.</p>\n\n<p>But my experience with men is still so elementary.  Men and women are different!  Turns. Out.  I am 13 all over again, confused and stumbling, sending the wrong signals, and reading every situation backwards.  And they are grown men with adult expectations who very reasonably want a peer, not an apprentice.  So that’s been tricky.</p>\n\n<p>I don’t have it nearly so rough as the newly-out “baby gays”, celibate well into adulthood. At least I’ve had <em>some</em> relationships, enough to learn that the emotional bruises heal. My heart goes out to them.</p>\n\n<p>At first, I was very careful about who I told. I didn’t want to draw scandal or trolling to my online communities.  I didn’t want the drama.  I still fear the schoolyard teasing.</p>\n\n<p>Mostly, I didn’t want anyone else telling me how to feel about something I was only beginning to accept myself.</p>\n\n<hr><p>Eventually, I’ve come to see my queerness less as a “thing” to be disclosed, and more as just another part of my private life.  Something that friends probably know, and strangers probably don’t, no more scandalous or secret than my address or my allergy to shellfish.</p>\n\n<p>I envy kids growing up today, as the sharp lines between straight and gay finally begin to blur in the cultural consciousness. Straight boys in love today might explore that feeling, without suffering an identity crisis.  I wish those lines would blur faster.  I wish it was a big deal because love is awesome, instead of being a big deal because of the genders and stated identities of the actors.</p>\n\n<p>My home is technology.  This is My Culture, rotten though it can be at times.  As a privileged and visible person in it, I feel obligated to try to make it a little better in the ways I can.  That’s why I’ve decided to publicly tell this story, so that my presence can add weight to the claim that bisexual men exist.</p>\n\n<p>Maybe this can also be a reminder of the multitude of other things we casually erase from the people around us.  There are so many ways we make our friends invisible, unwittingly nudging them into a corner that denies important parts of their identities, by perpetuating memes we don’t even notice.</p>\n\n<p>Erasure isn’t healthy.  And we are all unaware that we do it.</p>",
        "tree_html": ""
    },
    "reblog_key": "yeMNrXww",
    "recommended_color": null,
    "recommended_source": null,
    "short_url": "https://tmblr.co/Z7nwWy1IQFLe-",
    "slug": "lgt",
    "state": "published",
    "summary": "LG_T",
    "tags": [],
    "timestamp": 1402507680,
    "title": "LG_T",
    "trail": [
        {
            "blog": {
                "active": true,
                "can_be_followed": true,
                "name": "izs",
                "share_following": false,
                "share_likes": false,
                "theme": {
                    "avatar_shape": "square",
                    "background_color": "#444444",
                    "body_font": "Helvetica Neue",
                    "header_bounds": "978,2448,2355,0",
                    "header_focus_height": 1152,
                    "header_focus_width": 2048,
                    "header_full_height": 3264,
                    "header_full_width": 2448,
                    "header_image": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o.jpg",
                    "header_image_focused": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/mA1nbvglg/tumblr_static_tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_focused_v3.jpg",
                    "header_image_scaled": "https://static.tumblr.com/d248e27715343669f06a3852fd2cda53/utow0jf/nwUnbvgl6/tumblr_static_d2yiqqjdv1w8gsw0s0g4goc0o_2048_v2.jpg",
                    "header_stretch": true,
                    "link_color": "#FB4C16",
                    "show_avatar": true,
                    "show_description": true,
                    "show_header_image": true,
                    "show_title": true,
                    "title_color": "#fb4c16",
                    "title_font": "Gibson",
                    "title_font_weight": "regular"
                }
            },
            "content": "<p><a href=\"http://en.wikipedia.org/wiki/Bisexual_erasure\">Erasure</a> is a complicated subject.</p>\n\n<p>I was born onto a bed of privilege.&nbsp; I&rsquo;m of white European descent, and my immigrant ancestors came over the ocean long enough ago that my parents could speak the exact same dialect as the teachers at my well-funded suburban public school.&nbsp; They both had graduate degrees, and our home was full of books.&nbsp; I was encouraged towards intellectual pursuits.</p>\n\n<p>My dad ran his own company when I was growing up.  We weren&rsquo;t super rich, but we never went hungry.  By virtue of that business, I played with computers from an early age, and learned the basics of strategy and sales as far back as I can remember.</p>\n\n<p>I wasn&rsquo;t abused or disabled.  In fact, for an extremely nerdy kid, I didn&rsquo;t even get picked on all that much.</p>\n\n<p>On top of that, I&rsquo;m <a href=\"http://en.wikipedia.org/wiki/Cisgender\">cismale</a> and straight.</p>\n\n<hr /><p>I knew that I was a straight boy, because I liked girls.&nbsp; A lot.&nbsp; Boy, oh, boy, girls were great.</p>\n\n<p>My TV education on human sexuality was clear.&nbsp; There are 5 sharply defined categories.  Lesbians, straight girls, girls who liked to fool around with other girls sometimes but are actually straight (aka &ldquo;bi&rdquo; or &ldquo;AWESOME&rdquo;), gay men, and straight men.&nbsp; Straight men go with women, and gay men don&rsquo;t.&nbsp; So obviously, I was straight.</p>\n\n<p>And just as obvious as my straightness, I knew that some of our culture&rsquo;s beliefs about straight people were off base.&nbsp; Straight men are also attracted to men.&nbsp; As a straight guy, any argument to the contrary was obviously wrong, because I knew from my own experience.&nbsp; I&rsquo;d had full-on crushes on male friends of mine, which was clearly a normal thing for normal straight people to do, as evidenced by me, a normal straight person doing it.</p>\n\n<p>They said in vicious teasing that boys who liked boys were gay, but I knew that I wasn&rsquo;t gay, because gay boys don&rsquo;t like girls.&nbsp; Therefore straight boys also like boys sometimes, and the people doing the teasing are just misguided or something.  But I feared the teasing, so I didn&rsquo;t point out their error.</p>\n\n<p>I always felt like it would be an easy thing to &ldquo;switch teams&rdquo;, and be gay if I wanted to.&nbsp; The fascination with the &ldquo;born this way&rdquo; meme in queer activism never made sense to me.&nbsp; Of <em>course</em> we have a choice in the gender we pursue, doesn&rsquo;t everyone?&nbsp; Isn&rsquo;t choice great?</p>\n\n<p>I never did switch, because I didn&rsquo;t want to be gay.  That would mean I&rsquo;d have to give up dating women, which I enjoyed.</p>\n\n<p>Heterosexuality carries the privilege of not having to explain why I&rsquo;m inviting someone out on a date.  You&rsquo;re a woman, I&rsquo;m a man, we just follow the script that society has handed us.</p>\n\n<p>It&rsquo;s easy to remain only partly visible.</p>\n\n<hr /><p>It took an embarrassingly long time to stop erasing, and become ok with calling myself &ldquo;bisexual&rdquo;, even in my own mind.</p>\n\n<p>The realization didn&rsquo;t come in High School when my crush on another boy had me following him around like a weird giddy puppy.  Or in college, when I first kissed a boy. Or the second or third time that boy and I made out.</p>\n\n<p>The scales started to lift from my eyes when I had a conversation with a good friend about the movie &ldquo;Troy&rdquo;, well into my 20&rsquo;s.</p>\n\n<p>He said, &ldquo;That movie was kind of boring.&rdquo;</p>\n\n<p>I was shocked, and then I realized he was talking about the plot.</p>\n\n<p>&ldquo;Well&hellip; I didn&rsquo;t really pay attention to the plot, tbh.&nbsp; That movie&rsquo;s just lots of Brad Pitt being gorgeous and half-naked.&rdquo;</p>\n\n<p>&ldquo;You&rsquo;re not as straight as you think you are.&rdquo;</p>\n\n<p>&ldquo;Yeah, like you&rsquo;re not attracted to guys sometimes.&rdquo;</p>\n\n<p>&ldquo;Nope.&rdquo;</p>\n\n<p>&ldquo;Not ever?&rdquo;</p>\n\n<p>&ldquo;Not ever.&rdquo;</p>\n\n<p>&ldquo;Not even Brad Pitt?&rdquo;</p>\n\n<p>&ldquo;Not even a little.&nbsp; You&rsquo;re bi, dude.&rdquo;</p>\n\n<p>&ldquo;Huh.&rdquo;</p>\n\n<p>I figured he was fucking with me.&nbsp; But a lot of things did start to make sense.</p>\n\n<hr /><p>My life since then has been significantly more interesting.</p>\n\n<p>I tried on the label like a new pair of shoes, awkward, and uncertain.</p>\n\n<p>Like a good nerd, I dove into the research, but found it surprisingly lacking.&nbsp; <a href=\"http://www.amazon.com/Bi-Men-Coming-Every-Which/dp/1560236159/\">Bi Men Coming Out Every Which Way</a> was a great read.&nbsp; I learned about how pervasive the erasure of male bisexuality is, even among academic studies of LGBT culture.&nbsp; It&rsquo;s as if the B isn&rsquo;t there.&nbsp; A man who has sex with men is gay.&nbsp; If he then has sex with a woman, he&rsquo;s &ldquo;closeted&rdquo;.</p>\n\n<p>But how can it be a closet if you go into it and out of it repeatedly, with lovers and families on both sides?&nbsp; That&rsquo;s not a closet, it&rsquo;s a room with a revolving door.</p>\n\n<p>The idea that bisexuality might exist is news <a href=\"http://www.nytimes.com/2014/03/23/magazine/the-scientific-quest-to-prove-bisexuality-exists.html?_r=0\">worthy of the New York Times</a>, even.</p>\n\n<p>Privilege is hard to give up.&nbsp; I can&rsquo;t overstate how <em>easy</em> it is being straight in public, just letting people think whatever they want.  But in the years since I&rsquo;ve come out to myself, this bugs me more and more.</p>\n\n<p>When meeting a new person, I try to say &ldquo;partner&rdquo; rather than &ldquo;girlfriend&rdquo;, and sometimes even &ldquo;they&rdquo; rather than &ldquo;she&rdquo;.&nbsp; The shape of my lover&rsquo;s body is no business of theirs, after all.</p>\n\n<p>But when I slip, and drop her name, or use female pronouns (which, to be fair, she <em>does</em> use, female as she is), I can&rsquo;t help but wonder if they&rsquo;re relieved to find out that I&rsquo;m not gay, or perhaps just relieved to know which mold I fit into.</p>\n\n<p>I find myself resenting being cast in a mold at all.&nbsp; Even if I say &ldquo;partner&rdquo;,\nand they assume I&rsquo;m gay, part of me feels so put upon by that idea.&nbsp; And then here I am making assumptions about what assumptions someone else might be making.  It&rsquo;s a vicious cycle, and there is no escape from the hypocrisy.</p>\n\n<p>I&rsquo;ve tried since then not to make assumptions about others&rsquo; sexual preferences.&nbsp; Yet despite my best intentions, I consistently find myself mentally putting people in the &ldquo;straight&rdquo; or &ldquo;gay&rdquo; buckets once I find out the gender of their significant other.</p>\n\n<p>The habit of bi erasure is silent and pervasive.</p>\n\n<hr /><p>The first time I kissed a boy was almost a dare.  In a dorm room, sitting around drinking, as you do.  The two girls, roommates, said to the 5 of us boys that they&rsquo;d both wondered what it would be like to kiss a girl.  But, they said, they&rsquo;re not lesbians, so they wanted to do it in front of people, so that it wouldn&rsquo;t get too serious, or go too far.</p>\n\n<p>You can imagine the reaction.</p>\n\n<p><strong>YES, LADIES, YOU HAVE OUR ATTENTION, PLEASE PROCEED</strong></p>\n\n<p>Afterwards, one of them remarked, &ldquo;See, that&rsquo;s why women are better.  Guys would never be secure enough to do something like that.&rdquo;</p>\n\n<p>He and I both replied, &ldquo;Bullshit,&rdquo; and before I knew it, sparks were flying.  The other 3 boys in the room were shocked, making the socially required homophobic anguish sounds.  I barely remember them being there.  I&rsquo;d been looking all day for an excuse to touch him.  It ended too fast, but endures in my mind to this day.</p>\n\n<p>What a shock it was when I learned, 14 years later, that he has a boyfriend now!&nbsp; I don&rsquo;t know why it should&rsquo;ve been a surprise.  Back then, making out just seemed like a thing straight friends did with each other once in a while.</p>\n\n<p>Again and again, I catch myself being surprised like that.&nbsp; I try to remember that, in fact, a significant portion of men are bisexual, perhaps even a majority, depending on how we decide to define things.&nbsp; I try to yank my thinking out of the mold, but it frequently slips back.</p>\n\n<p>You don&rsquo;t notice erasure until you stop doing it.<br />\nAnd then you don&rsquo;t notice when you start again.</p>\n\n<hr /><p>I&rsquo;ve been told by people in the LGBT community that &ldquo;bisexual isn&rsquo;t a real thing&rdquo;, that I&rsquo;m &ldquo;actually straight&rdquo; because I&rsquo;m with a woman, or even, &ldquo;men aren&rsquo;t bisexual, just closeted.&rdquo;  Bi-curious is code for &ldquo;about to leave the closet&rdquo;.  &ldquo;Bi now, gay later.&rdquo;</p>\n\n<p>I have taken to referring to gay and straight people as &ldquo;monosexuals&rdquo;.&nbsp; I respond by explaining that they&rsquo;re just going through a phase.&nbsp; Once they meet the right <em>person not of their stated preferred gender</em>, they&rsquo;ll grow out of it and realize that they&rsquo;re <em>actually</em> bi.</p>\n\n<p>But I know, that old &ldquo;everyone&rsquo;s bi&rdquo; story is just another way to push us into the background. If we&rsquo;re not nonexistent, we&rsquo;re unremarkable. Either way, nothing to see here. Move along.&nbsp;</p>\n\n<p>Or worse, if we are visible, we&rsquo;re sex objects. Dating gay men confirmed every awful thing I&rsquo;ve heard (and, let&rsquo;s be honest, perpetuated) about how straight men treat bi women.  Qv the &ldquo;bi for male pleasure&rdquo; meme implicit in my first gay kiss experience.  They&rsquo;re happy to fuck the SAG, but anything more than sex is off the table.  We can&rsquo;t be trusted, after all.  We&rsquo;re tourists.  Unicorns.  We don&rsquo;t exist.</p>\n\n<p>LG_T</p>\n\n<hr /><p>Maybe the strangest part about growing up a closeted bisexual is that I&rsquo;ve been practicing dating girls since puberty.  I&rsquo;m <em>very</em> good at it.  Confident.  Respectful.  Sensitive.  Witty.  Hungry and giving.  It&rsquo;s not talent or PUA bullshit, and there isn&rsquo;t any one weird trick.  It&rsquo;s the result of many years of conscientious practice, with&nbsp;loving patient teachers who were learning from me as well; the occasional broken heart that didn&rsquo;t kill me, even when I felt like it was trying to.</p>\n\n<p>But my experience with men is still so elementary.  Men and women are different!  Turns. Out.&nbsp; I am 13 all over again, confused and stumbling, sending the wrong signals, and reading every situation backwards.  And they are grown men with adult expectations who very reasonably want a peer, not an apprentice.  So that&rsquo;s been tricky.</p>\n\n<p>I don&rsquo;t have it nearly so rough as the newly-out &ldquo;baby gays&rdquo;, celibate well into adulthood. At least I&rsquo;ve had <em>some</em> relationships, enough to learn that the emotional bruises heal. My heart goes out to them.</p>\n\n<p>At first, I was very careful about who I told. I didn&rsquo;t want to draw scandal or trolling to my online communities.  I didn&rsquo;t want the drama.  I still fear the schoolyard teasing.</p>\n\n<p>Mostly, I didn&rsquo;t want anyone else telling me how to feel about something I was only beginning to accept myself.</p>\n\n<hr /><p>Eventually, I&rsquo;ve come to see my queerness less as a &ldquo;thing&rdquo; to be disclosed, and more as just another part of my private life.&nbsp; Something that friends probably know, and strangers probably don&rsquo;t, no more scandalous or secret than my address or my allergy to shellfish.</p>\n\n<p>I envy kids growing up today, as the sharp lines between straight and gay finally begin to blur in the cultural consciousness. Straight boys in love today might explore that feeling, without suffering an identity crisis.  I wish those lines would blur faster.  I wish it was a big deal because love is awesome, instead of being a big deal because of the genders and stated identities of the actors.</p>\n\n<p>My home is technology.&nbsp; This is My Culture, rotten though it can be at times.  As a privileged and visible person in it, I feel obligated to try to make it a little better in the ways I can.&nbsp; That&rsquo;s why I&rsquo;ve decided to publicly tell this story, so that my presence can add weight to the claim that bisexual men exist.</p>\n\n<p>Maybe this can also be a reminder of the multitude of other things we casually erase from the people around us.  There are so many ways we make our friends invisible, unwittingly nudging them into a corner that denies important parts of their identities, by perpetuating memes we don&rsquo;t even notice.</p>\n\n<p>Erasure isn&rsquo;t healthy.  And we are all unaware that we do it.</p>",
            "content_raw": "<p><a href=\"http://en.wikipedia.org/wiki/Bisexual_erasure\">Erasure</a> is a complicated subject.</p>\n\n<p>I was born onto a bed of privilege.  I’m of white European descent, and my immigrant ancestors came over the ocean long enough ago that my parents could speak the exact same dialect as the teachers at my well-funded suburban public school.  They both had graduate degrees, and our home was full of books.  I was encouraged towards intellectual pursuits.</p>\n\n<p>My dad ran his own company when I was growing up.  We weren’t super rich, but we never went hungry.  By virtue of that business, I played with computers from an early age, and learned the basics of strategy and sales as far back as I can remember.</p>\n\n<p>I wasn’t abused or disabled.  In fact, for an extremely nerdy kid, I didn’t even get picked on all that much.</p>\n\n<p>On top of that, I’m <a href=\"http://en.wikipedia.org/wiki/Cisgender\">cismale</a> and straight.</p>\n\n<hr><p>I knew that I was a straight boy, because I liked girls.  A lot.  Boy, oh, boy, girls were great.</p>\n\n<p>My TV education on human sexuality was clear.  There are 5 sharply defined categories.  Lesbians, straight girls, girls who liked to fool around with other girls sometimes but are actually straight (aka “bi” or “AWESOME”), gay men, and straight men.  Straight men go with women, and gay men don’t.  So obviously, I was straight.</p>\n\n<p>And just as obvious as my straightness, I knew that some of our culture’s beliefs about straight people were off base.  Straight men are also attracted to men.  As a straight guy, any argument to the contrary was obviously wrong, because I knew from my own experience.  I’d had full-on crushes on male friends of mine, which was clearly a normal thing for normal straight people to do, as evidenced by me, a normal straight person doing it.</p>\n\n<p>They said in vicious teasing that boys who liked boys were gay, but I knew that I wasn’t gay, because gay boys don’t like girls.  Therefore straight boys also like boys sometimes, and the people doing the teasing are just misguided or something.  But I feared the teasing, so I didn’t point out their error.</p>\n\n<p>I always felt like it would be an easy thing to “switch teams”, and be gay if I wanted to.  The fascination with the “born this way” meme in queer activism never made sense to me.  Of <em>course</em> we have a choice in the gender we pursue, doesn’t everyone?  Isn’t choice great?</p>\n\n<p>I never did switch, because I didn’t want to be gay.  That would mean I’d have to give up dating women, which I enjoyed.</p>\n\n<p>Heterosexuality carries the privilege of not having to explain why I’m inviting someone out on a date.  You’re a woman, I’m a man, we just follow the script that society has handed us.</p>\n\n<p>It’s easy to remain only partly visible.</p>\n\n<hr><p>It took an embarrassingly long time to stop erasing, and become ok with calling myself “bisexual”, even in my own mind.</p>\n\n<p>The realization didn’t come in High School when my crush on another boy had me following him around like a weird giddy puppy.  Or in college, when I first kissed a boy. Or the second or third time that boy and I made out.</p>\n\n<p>The scales started to lift from my eyes when I had a conversation with a good friend about the movie “Troy”, well into my 20’s.</p>\n\n<p>He said, “That movie was kind of boring.”</p>\n\n<p>I was shocked, and then I realized he was talking about the plot.</p>\n\n<p>“Well… I didn’t really pay attention to the plot, tbh.  That movie’s just lots of Brad Pitt being gorgeous and half-naked.”</p>\n\n<p>“You’re not as straight as you think you are.”</p>\n\n<p>“Yeah, like you’re not attracted to guys sometimes.”</p>\n\n<p>“Nope.”</p>\n\n<p>“Not ever?”</p>\n\n<p>“Not ever.”</p>\n\n<p>“Not even Brad Pitt?”</p>\n\n<p>“Not even a little.  You’re bi, dude.”</p>\n\n<p>“Huh.”</p>\n\n<p>I figured he was fucking with me.  But a lot of things did start to make sense.</p>\n\n<hr><p>My life since then has been significantly more interesting.</p>\n\n<p>I tried on the label like a new pair of shoes, awkward, and uncertain.</p>\n\n<p>Like a good nerd, I dove into the research, but found it surprisingly lacking.  <a href=\"http://www.amazon.com/Bi-Men-Coming-Every-Which/dp/1560236159/\">Bi Men Coming Out Every Which Way</a> was a great read.  I learned about how pervasive the erasure of male bisexuality is, even among academic studies of LGBT culture.  It’s as if the B isn’t there.  A man who has sex with men is gay.  If he then has sex with a woman, he’s “closeted”.</p>\n\n<p>But how can it be a closet if you go into it and out of it repeatedly, with lovers and families on both sides?  That’s not a closet, it’s a room with a revolving door.</p>\n\n<p>The idea that bisexuality might exist is news <a href=\"http://www.nytimes.com/2014/03/23/magazine/the-scientific-quest-to-prove-bisexuality-exists.html?_r=0\">worthy of the New York Times</a>, even.</p>\n\n<p>Privilege is hard to give up.  I can’t overstate how <em>easy</em> it is being straight in public, just letting people think whatever they want.  But in the years since I’ve come out to myself, this bugs me more and more.</p>\n\n<p>When meeting a new person, I try to say “partner” rather than “girlfriend”, and sometimes even “they” rather than “she”.  The shape of my lover’s body is no business of theirs, after all.</p>\n\n<p>But when I slip, and drop her name, or use female pronouns (which, to be fair, she <em>does</em> use, female as she is), I can’t help but wonder if they’re relieved to find out that I’m not gay, or perhaps just relieved to know which mold I fit into.</p>\n\n<p>I find myself resenting being cast in a mold at all.  Even if I say “partner”,\nand they assume I’m gay, part of me feels so put upon by that idea.  And then here I am making assumptions about what assumptions someone else might be making.  It’s a vicious cycle, and there is no escape from the hypocrisy.</p>\n\n<p>I’ve tried since then not to make assumptions about others’ sexual preferences.  Yet despite my best intentions, I consistently find myself mentally putting people in the “straight” or “gay” buckets once I find out the gender of their significant other.</p>\n\n<p>The habit of bi erasure is silent and pervasive.</p>\n\n<hr><p>The first time I kissed a boy was almost a dare.  In a dorm room, sitting around drinking, as you do.  The two girls, roommates, said to the 5 of us boys that they’d both wondered what it would be like to kiss a girl.  But, they said, they’re not lesbians, so they wanted to do it in front of people, so that it wouldn’t get too serious, or go too far.</p>\n\n<p>You can imagine the reaction.</p>\n\n<p><strong>YES, LADIES, YOU HAVE OUR ATTENTION, PLEASE PROCEED</strong></p>\n\n<p>Afterwards, one of them remarked, “See, that’s why women are better.  Guys would never be secure enough to do something like that.”</p>\n\n<p>He and I both replied, “Bullshit,” and before I knew it, sparks were flying.  The other 3 boys in the room were shocked, making the socially required homophobic anguish sounds.  I barely remember them being there.  I’d been looking all day for an excuse to touch him.  It ended too fast, but endures in my mind to this day.</p>\n\n<p>What a shock it was when I learned, 14 years later, that he has a boyfriend now!  I don’t know why it should’ve been a surprise.  Back then, making out just seemed like a thing straight friends did with each other once in a while.</p>\n\n<p>Again and again, I catch myself being surprised like that.  I try to remember that, in fact, a significant portion of men are bisexual, perhaps even a majority, depending on how we decide to define things.  I try to yank my thinking out of the mold, but it frequently slips back.</p>\n\n<p>You don’t notice erasure until you stop doing it.<br>\nAnd then you don’t notice when you start again.</p>\n\n<hr><p>I’ve been told by people in the LGBT community that “bisexual isn’t a real thing”, that I’m “actually straight” because I’m with a woman, or even, “men aren’t bisexual, just closeted.”  Bi-curious is code for “about to leave the closet”.  “Bi now, gay later.”</p>\n\n<p>I have taken to referring to gay and straight people as “monosexuals”.  I respond by explaining that they’re just going through a phase.  Once they meet the right <em>person not of their stated preferred gender</em>, they’ll grow out of it and realize that they’re <em>actually</em> bi.</p>\n\n<p>But I know, that old “everyone’s bi” story is just another way to push us into the background. If we’re not nonexistent, we’re unremarkable. Either way, nothing to see here. Move along. </p>\n\n<p>Or worse, if we are visible, we’re sex objects. Dating gay men confirmed every awful thing I’ve heard (and, let’s be honest, perpetuated) about how straight men treat bi women.  Qv the “bi for male pleasure” meme implicit in my first gay kiss experience.  They’re happy to fuck the <abbr title=\"straight-acting gay\">SAG</abbr>, but anything more than sex is off the table.  We can’t be trusted, after all.  We’re tourists.  Unicorns.  We don’t exist.</p>\n\n<p><abbr title=\"lesbian gay something trans\">LG_T</abbr></p>\n\n<hr><p>Maybe the strangest part about growing up a closeted bisexual is that I’ve been practicing dating girls since puberty.  I’m <em>very</em> good at it.  Confident.  Respectful.  Sensitive.  Witty.  Hungry and giving.  It’s not talent or PUA bullshit, and there isn’t any one weird trick.  It’s the result of many years of conscientious practice, with loving patient teachers who were learning from me as well; the occasional broken heart that didn’t kill me, even when I felt like it was trying to.</p>\n\n<p>But my experience with men is still so elementary.  Men and women are different!  Turns. Out.  I am 13 all over again, confused and stumbling, sending the wrong signals, and reading every situation backwards.  And they are grown men with adult expectations who very reasonably want a peer, not an apprentice.  So that’s been tricky.</p>\n\n<p>I don’t have it nearly so rough as the newly-out “baby gays”, celibate well into adulthood. At least I’ve had <em>some</em> relationships, enough to learn that the emotional bruises heal. My heart goes out to them.</p>\n\n<p>At first, I was very careful about who I told. I didn’t want to draw scandal or trolling to my online communities.  I didn’t want the drama.  I still fear the schoolyard teasing.</p>\n\n<p>Mostly, I didn’t want anyone else telling me how to feel about something I was only beginning to accept myself.</p>\n\n<hr><p>Eventually, I’ve come to see my queerness less as a “thing” to be disclosed, and more as just another part of my private life.  Something that friends probably know, and strangers probably don’t, no more scandalous or secret than my address or my allergy to shellfish.</p>\n\n<p>I envy kids growing up today, as the sharp lines between straight and gay finally begin to blur in the cultural consciousness. Straight boys in love today might explore that feeling, without suffering an identity crisis.  I wish those lines would blur faster.  I wish it was a big deal because love is awesome, instead of being a big deal because of the genders and stated identities of the actors.</p>\n\n<p>My home is technology.  This is My Culture, rotten though it can be at times.  As a privileged and visible person in it, I feel obligated to try to make it a little better in the ways I can.  That’s why I’ve decided to publicly tell this story, so that my presence can add weight to the claim that bisexual men exist.</p>\n\n<p>Maybe this can also be a reminder of the multitude of other things we casually erase from the people around us.  There are so many ways we make our friends invisible, unwittingly nudging them into a corner that denies important parts of their identities, by perpetuating memes we don’t even notice.</p>\n\n<p>Erasure isn’t healthy.  And we are all unaware that we do it.</p>",
            "is_current_item": true,
            "is_root_item": true,
            "post": {
                "id": "88487057983"
            }
        }
    ],
    "type": "text"
}